gdgly/NUC97X_JS/STM32F4xx/CSG/QCSG_Task/CH_PLC_AMR_Task.c
/*************************************************
版  权:正泰仪表智能终端部
文  件:CH_PLC_AMR_Task.c
作  者:zhaoyun
版  本:1.00
日  期:20170812
描  述:南网PLC载波模块抄表处理文件
*************************************************/
/* Includes ------------------------------------------------------------------*/
#include <string.h>
#include <stdio.h>
#include "../Hcsg/ProjectCSG.h"
#include "../QCSG_Head/QCSG_UpLinkProtocol.h"
#include "../QCSG_Head/QCSG_LocalLinkProtocol.h"
#include "../QCSG_Head/QCSG_DLT645_Protocol.h"

#include "../QCSG_Head/Chint_Type.h"
#include "../QCSG_Head/QCSG_PublicDefine.h"
#include "../QCSG_Head/QCSG_PublicFunc.h"
#include "../QCSG_Data/QCSG_NandDataInterface.h"
#include "../QCSG_Head/QCSG_Table.h"
#include "../QCSG_Data/QCSG_DefaultData.h"
#include "../STM32F4xx/STM32F4xx_UART.h"
#include "../STM32F4xx/STM32F4xx_DMA.h"
#include "../Device/MEMRW.h"
#include "../STM32F4xx/STM32F4xx_IO.h"
#include "../Calculate/Calculate.h"
#include "../Display/Warning.h"
#include "../QCSG_Head/QCSG_Hal.h"

#include "Terminal_Task.h"
#include "../QCSG_Head/CH_AMR_TaskManage.h"
#include "../QCSG_Head/CH_PLC_AMR_Task.h" 
#include "../QCSG_Head/QCSG_AlarmEvent.h"
#include "../TEST/LOG.h"

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
//68 1A 00 60 11 11 11 11 11 11 22 22 22 22 22 22 00 01 01 00 01 E8 01 01 7F 16
#if ((Project/100)==2 || ((Project/100)==9))

#define PLC_SEARCH_BPS	(0x0440)
/* Private constants ---------------------------------------------------------*/

void PLC_ModuleManage(u32 PORTn)
{
	PLCManageStruct* PLCManage = (PLCManageStruct*)ADDR_PLCManageCtrl;
	switch(PLCManage->State)
	{
		case PLC_POWER_UP_INIT:	
			PLC_PowerUpInit(PORTn, PLCManage);
			break;
		case PLC_RESET_INIT:
			PLC_ResetInit(PORTn, PLCManage);
			break;
		case PLC_MODLE_RECOGNIZE:
			PLC_ModleRecognizeProcess(PORTn, PLCManage);
			break;
		case PLC_FILE_SYNC:
			PLC_ModleFileSync(PORTn, PLCManage);
			break;
		case PLC_FILE_ADD:
			PLC_ModleFileAddNode(PORTn, PLCManage);
			break;
		case PLC_AMR_STATE:
			PLC_ModleAMR_Task(PORTn, PLCManage);
			break;
		case PLC_CHECK_MODLE: //容错机制检查载波模块
			PLC_CheckModle(PORTn,PLCManage);
			break;
		case PLC_YBWHZ_TEST: //err20190403 载波模块测试用
			PLC_YBWHZ_Test(PORTn,PLCManage);
			break;
		case PLC_MODLE_ERROR:		
			break;
		default:
			PLCManage->State = PLC_POWER_UP_INIT;
			break;
	}

	PLC_RT_AMR_ReqCheck(PORTn, PLCManage);
	
	QCSG_LocalModuleFrameProcess(PORTn, PLCManage);
}

void PLC_RT_AMR_ReqCheck(u32 PORTn, PLCManageStruct* PLCManage)
{
	u16* pAckTimer;
	u32 CurTicks = 0;
	Terminal_Router_TypeDef* pTerminalRouter = Terminal_Router;
	RT_AMRCtrlStruct* Task = (RT_AMRCtrlStruct*)ADDR_RealTimeAMRTaskCtrl;
	AMRCtrlStruct* AMRCtrl = (AMRCtrlStruct*)Get_AMR_TaskCtrlAddr(PORTn);

	if((AMRCtrl->Flag & AMR_FLAG_PAUSE) != 0)
	{
		AMRCtrl->Flag &= ~AMR_FLAG_PAUSE;
		if(PLCManage->State == PLC_AMR_STATE)
		{
			pAckTimer = (u16*)GetUartPortAckTimerAddr(PORTn);
			if(AMRCtrl->State <= AMR_Pause)
			{
				if(AMRCtrl->State != AMR_Pause)
				{
					AMRCtrl->OldState = AMRCtrl->State;
					AMRCtrl->State = AMR_Pause;	
				}
				pAckTimer[0] = AMR_PAUSE_MAX_TIME;
				Task->Flag |= RT_AMR_CH_READY;
			}		
		}		
	}

	if(PLCManage->State != PLC_AMR_STATE) return;

	if(Pin_Read(PIN_PLC_ID) == 0)
	{
		PLCManage->UnPlugCnt = 0;
	}
	else
	{
		PLCManage->UnPlugCnt++;
		if(PLCManage->UnPlugCnt < 20) return;

		PLCManage->UnPlugCnt = 0;
		WarningOccur(PORTn,(u8 *)"载波模块没插入");	//告警发生,入口告警代码和告警字符串
		PLCManage->State = PLC_POWER_UP_INIT;

		if(((AMRCtrl->AMR_ID & (AMR_DAY_FREEZ_ID | AMR_DAY_FREEZ_PATCH_ID | AMR_HOUR_FREEZ_ID)) != 0) && (AMRCtrl->State != AMR_Idle))
		{
			if((AMRCtrl->State == AMR_Tx) || (AMRCtrl->State == AMR_WaitRx))
			{
				AMRCtrl->OldState = AMR_Tx;
			}
			AMRCtrl->State = AMR_Resume;
		}
		else
		{
			AMRCtrl->State = AMR_Idle;
			AMRCtrl->AMR_ID = 0;
		}
	}	

	CurTicks = HAL_GetSystemTick();
	if((CurTicks - PLCManage->LastRcvTicks) > 30000) // 5分钟 5*60*1000/10 
	{
		PLCManage->State = PLC_CHECK_MODLE;//PLC_RESET_INIT;
		AMRCtrl->OldState = AMRCtrl->State;
		pTerminalRouter->Old_RouterInitTask = pTerminalRouter->RouterInitTask;
		pTerminalRouter->RouterResetCnt = 0;		
		pTerminalRouter->RouterInitTask = 0;
		pTerminalRouter->RetryCnt = 0;		
	}
}
void PLC_PowerUpInit(u32 PORTn, PLCManageStruct* PLCManage)
{
	Terminal_Router_TypeDef* pTerminalRouter = Terminal_Router;
	//Terminal_Ram_TypeDef* pTerminalRam = Terminal_Ram;
	switch(pTerminalRouter->RouterInitTask)
	{
		case 0:
			PLCModuleGPIOInit(PORTn);
			break;
		case 1:
			PLCModulePowerUpInit(PORTn);
			break;
		case 2:
			PLCManage->State = PLC_RESET_INIT;
			PLCManage->UnPlugCnt = 0;
			pTerminalRouter->RouterInitTask = 0;
		default:
			pTerminalRouter->RouterInitTask = 0;
			break;
	}
}

void PLCModuleGPIOInit(u32 PORTn)
{
	u16 * p16timer;
	Terminal_Router_TypeDef* pTerminalRouter = Terminal_Router;
	//Comm_Ram_TypeDef* pComm_Ram = Comm_Ram;
	Terminal_Ram_TypeDef* pTerminalRam = Terminal_Ram;
	if(GetTerminalPower_S_TimerValue() > 0) return;
	if(pTerminalRam->RouterCheck_S_Timer != 0) return;
	if(pTerminalRam->RouterAck_S_Timer != 0) return;
	
	p16timer = (u16*)Get_ADDR_UARTnTimer(PORTn);
	Pin_Configure(PIN_UART4_RX,//RXD输入,下拉
							0|//B3-B0:复用功能选择AF(0-15)
				 (0<<4)|//B5-B4:模式:00：输入（复位状态）,01：通用输出模式,10：复用功能模式,11：模拟模式
				 (0<<6)|//B6   :输出类型:0：输出推挽（复位状态）,1：输出开漏
				 (0<<7)|//B8-B7:输出速度:00：2 MHz（低速）,01：25 MHz（中速）,10：50 MHz（快速）,11：30 pF 时为 100 MHz（高速）（15 pF 时为 80 MHz 输出（最大速度））
				 (2<<9)|//B10-B9:上拉/下拉:00：无上拉或下拉,01：上拉,10：下拉,11：保留
				 (0<<11));//B11  :当为输出时：0=输出0,1=输出1	
	Pin_Configure(PIN_UART4_TX,//TXD输入,下拉
							0|//B3-B0:复用功能选择AF(0-15)
				 (0<<4)|//B5-B4:模式:00：输入（复位状态）,01：通用输出模式,10：复用功能模式,11：模拟模式
				 (0<<6)|//B6   :输出类型:0：输出推挽（复位状态）,1：输出开漏
				 (0<<7)|//B8-B7:输出速度:00：2 MHz（低速）,01：25 MHz（中速）,10：50 MHz（快速）,11：30 pF 时为 100 MHz（高速）（15 pF 时为 80 MHz 输出（最大速度））
				 (2<<9)|//B10-B9:上拉/下拉:00：无上拉或下拉,01：上拉,10：下拉,11：保留
				 (0<<11));//B11  :当为输出时：0=输出0,1=输出1	
	Pin_Configure(PIN_PLC_RST,//复位引脚输出0
							0|//B3-B0:复用功能选择AF(0-15)
				 (1<<4)|//B5-B4:模式:00：输入（复位状态）,01：通用输出模式,10：复用功能模式,11：模拟模式
				 (0<<6)|//B6   :输出类型:0：输出推挽（复位状态）,1：输出开漏
				 (0<<7)|//B8-B7:输出速度:00：2 MHz（低速）,01：25 MHz（中速）,10：50 MHz（快速）,11：30 pF 时为 100 MHz（高速）（15 pF 时为 80 MHz 输出（最大速度））
				 (0<<9)|//B10-B9:上拉/下拉:00：无上拉或下拉,01：上拉,10：下拉,11：保留
				 (0<<11));//B11  :当为输出时：0=输出0,1=输出1	
	//i = pComm_Ram->MYMDHMS[1] + (pComm_Ram->MYMDHMS[2] << 8);//时分
	Pin_Configure(PIN_PLC_PWR,//电源控制引脚输出 0， 开电源
							0|//B3-B0:复用功能选择AF(0-15)
				 (1<<4)|//B5-B4:模式:00：输入（复位状态）,01：通用输出模式,10：复用功能模式,11：模拟模式
				 (0<<6)|//B6   :输出类型:0：输出推挽（复位状态）,1：输出开漏
				 (0<<7)|//B8-B7:输出速度:00：2 MHz（低速）,01：25 MHz（中速）,10：50 MHz（快速）,11：30 pF 时为 100 MHz（高速）（15 pF 时为 80 MHz 输出（最大速度））
				 (0<<9)|//B10-B9:上拉/下拉:00：无上拉或下拉,01：上拉,10：下拉,11：保留
				 (0<<11));	//B11  :当为输出时：0=输出0,1=输出1	

	Pin_Configure(PIN_PLC_ID,//模块插入引脚,输入上拉
						0|//B3-B0:复用功能选择AF(0-15)
				 (0<<4)|//B5-B4:模式:00：输入（复位状态）,01：通用输出模式,10：复用功能模式,11：模拟模式
				 (0<<6)|//B6   :输出类型:0：输出推挽（复位状态）,1：输出开漏
				 (0<<7)|//B8-B7:输出速度:00：2 MHz（低速）,01：25 MHz（中速）,10：50 MHz（快速）,11：30 pF 时为 100 MHz（高速）（15 pF 时为 80 MHz 输出（最大速度））
				 (1<<9)|//B10-B9:上拉/下拉:00：无上拉或下拉,01：上拉,10：下拉,11：保留
				 (0<<11));//B11  :当为输出时：0=输出0,1=输出1
				 
	p16timer[0] = 2000/10;//延时(开电源)
	pTerminalRouter->RouterInitTask++;
	
