gdgly/NUC97X_JS/STM32F4xx/CSG/QCSG_Task/CH_PLC_AMR_Task.c
}


void PLCModulePowerUpInit(u32 PORTn)
{
	u16 * p16timer;
	Terminal_Router_TypeDef* pTerminalRouter = Terminal_Router;
	Terminal_Ram_TypeDef* pTerminalRam = Terminal_Ram;
	
	if(pTerminalRam->RouterCheck_S_Timer != 0) return;
	p16timer = (u16 *)Get_ADDR_UARTnTimer(PORTn);
	if(p16timer[0] != 0) return;
	
	if(Pin_Read(PIN_PLC_ID) == 0)
	{// 载波模块已插入
		Pin_Configure(PIN_PLC_RST,//复位引脚输出0
							0|//B3-B0:复用功能选择AF(0-15)
					 (1<<4)|//B5-B4:模式:00：输入（复位状态）,01：通用输出模式,10：复用功能模式,11：模拟模式
					 (0<<6)|//B6   :输出类型:0：输出推挽（复位状态）,1：输出开漏
					 (0<<7)|//B8-B7:输出速度:00：2 MHz（低速）,01：25 MHz（中速）,10：50 MHz（快速）,11：30 pF 时为 100 MHz（高速）（15 pF 时为 80 MHz 输出（最大速度））
					 (0<<9)|//B10-B9:上拉/下拉:00：无上拉或下拉,01：上拉,10：下拉,11：保留
					 (0<<11));//B11  :当为输出时：0=输出0,1=输出1		
		p16timer[0] = 1000/10;
		pTerminalRouter->RouterInitTask++;
	}
	else
	{
		WarningOccur(PORTn,(u8 *)"载波模块没插入");	//告警发生,入口告警代码和告警字符串
		pTerminalRam->RouterCheck_S_Timer = 3;		//下次检测模块插入延时: 3S
	}
}


void PLC_ResetInit(u32 PORTn, PLCManageStruct* PLCManage)
{
	Terminal_Router_TypeDef* pTerminalRouter = Terminal_Router;
	Terminal_Ram_TypeDef* pTerminalRam = Terminal_Ram;
	switch(pTerminalRouter->RouterInitTask)
	{
		case 0:
			PLCModuleResetInit(PORTn);
			break;
		case 1:
			PLCModuleResetRelease(PORTn);
			break;
		case 2:
			pTerminalRam->RouterAck_S_Timer = PLC_RECOGNIZE_TIME_OUT;		//20S,等待路由开机自动上报帧
			pTerminalRouter->RouterInitTask++;			
			break;
		case 3:
			if(pTerminalRam->RouterAck_S_Timer == 0)
			{
				PLCManage->State = PLC_MODLE_RECOGNIZE;
				pTerminalRouter->RouterInitTask = 0;
			}
			break;
		default:
			pTerminalRouter->RouterInitTask = 0;
			break;
	}
}


void PLCModuleResetInit(u32 PORTn)
{
	u16 * p16timer;
	Terminal_Router_TypeDef* pTerminalRouter = Terminal_Router;
	p16timer = (u16 *)Get_ADDR_UARTnTimer(PORTn);
	if(p16timer[0]==0)
	{
		Pin_Configure(PIN_PLC_RST,//复位引脚输出0
								0|//B3-B0:复用功能选择AF(0-15)
					 (1<<4)|//B5-B4:模式:00：输入（复位状态）,01：通用输出模式,10：复用功能模式,11：模拟模式
					 (0<<6)|//B6   :输出类型:0：输出推挽（复位状态）,1：输出开漏
					 (0<<7)|//B8-B7:输出速度:00：2 MHz（低速）,01：25 MHz（中速）,10：50 MHz（快速）,11：30 pF 时为 100 MHz（高速）（15 pF 时为 80 MHz 输出（最大速度））
					 (0<<9)|//B10-B9:上拉/下拉:00：无上拉或下拉,01：上拉,10：下拉,11：保留
					 (0<<11));//B11  :当为输出时：0=输出0,1=输出1	
		p16timer[0] = 200/10;//模块自行初始化延时
		pTerminalRouter->RouterInitTask++;
		//HAL_BuzzerON(BUZZ_MODE_RW_PARA, 20);//err20180806 测试用
	}
}

void PLCModuleResetRelease(u32 PORTn)
{
	u16 * p16timer;
	UARTCtrl_TypeDef* UARTCtrl;	
	Terminal_Router_TypeDef* pTerminalRouter = Terminal_Router;
	p16timer = (u16 *)Get_ADDR_UARTnTimer(PORTn);
	if(p16timer[0] == 0)
	{
		p16timer = (u16 *)Get_ADDR_UARTn(PORTn);
		p16timer[0] = 0;			// 中断接收指针
		p16timer[1] = 0;			// 当前已读指针
		UARTCtrl = (UARTCtrl_TypeDef*)Get_ADDR_UARTnCtrl(PORTn);
		UARTCtrl->Function = 1;		// 口功能 0=终端维护口,!=0终端抄表口
		UARTCtrl->Task = 0;			// UART_3762接收发送;0=空闲,1=完成1帧发收,2=接收超时(或错误),3=启动发送,4=正在发送,5=正在接收
		UARTCtrl->RxByte = 0;		// RX计数(已接收字节数)=0
		pTerminalRouter->RUNState = 0;			// 当前路由运行状态(从模块中读取值):b2=上报事件标志,b1=工作标志,b0=路由完成标志
		pTerminalRouter->StopFlags = 0;			// 暂停路由标志
		pTerminalRouter->RouterCtrlTask = 0;	// 路由器控制任务计数;完成后自动回到0
		pTerminalRouter->RouterCtrl = 0;		// 路由器控制0=空,1=重启,2=暂停,3=恢复;完成后自动回到0
		UARTCtrl->BpsCtrl = BPS_9600;			// 9600,8e1
		Init_UARTn(PORTn);						// 初始化UART口,入口通信控制字已填入
		Pin_OutH(PIN_PLC_RST);					// 引脚输出高,入口引脚使用名
		pTerminalRouter->RouterInitTask++;		// 路由器抄读任务0-99公共初始化,100-199分厂家初始化,>=200路由抄表
	}
}


void PLC_ModleRecognizeProcess(u32 PORTn, PLCManageStruct* PLCManage)
{
	u8 Temp[SIZE_8];
	CommunicationParaStruct CommPara;
	QCSGLocalFrameStruct LocalFrame;
	Terminal_Router_TypeDef* pTerminalRouter = Terminal_Router;
	Terminal_Ram_TypeDef* pTerminalRam = Terminal_Ram;

	switch(pTerminalRouter->RouterInitTask)
	{		
		case PLC_RECOGNIZE_READ_MODLE_INFO:					// 发送查询模块运行模式信息
			PLC_TxReadRunMode(PORTn, PLCManage, &LocalFrame);
			break;
		case PLC_RECOGNIZE_WAIT_READ_MODLE_INFO_ACK:		// 等待模块回复运行模式信息						
			if((PLCManage->Flag & PLC_FLAG_READ_MODLE_INFO_DONE) != 0)
			{
				PLCManage->Flag &= ~PLC_FLAG_READ_MODLE_INFO_DONE;
				pTerminalRam->RouterAck_S_Timer = 0;
				MC(0, (u32)&CommPara, sizeof(CommunicationParaStruct));
				MR((u32)&CommPara, ADDR_CommunicationPara, sizeof(CommunicationParaStruct));
				ConvertTerminalAddrToBCD(CommPara.TerminalAddr, CommPara.TerminalLocationCode, Temp);
				
				if(MemCompare(pTerminalRouter->RouterAddr, Temp, METER_ADDR_SIZE) == 0)
				{// PLC 模块地址与终端地址相等，则模块识别完成，进入设置 PLC 模块档案同步阶段
					MR((u32)PLCManage->TerminalAddr, (u32)pTerminalRouter->RouterAddr, METER_ADDR_SIZE);
					pTerminalRouter->RouterInitTask = PLC_RECOGNIZE_DONE;
					pTerminalRouter->RetryCnt = 0;				
				}
				else
				{// PLC 模块地址与终端地址不等，则进入初始化档案
					pTerminalRouter->RouterInitTask++;
					pTerminalRouter->RetryCnt = 0;
				}
			}
			else
			{
				if(pTerminalRam->RouterAck_S_Timer == 0)
				{
					pTerminalRouter->RouterInitTask--;
				}
			}
			break;
		case PLC_RECOGNIZE_INIT_FILE:		// 下发初始化档案
			PLC_TxInitFile(PORTn, PLCManage, &LocalFrame);
			break;
		case PLC_RECOGNIZE_WAIT_INIT_FILE_ACK:			
			if((PLCManage->Flag & PLC_FLAG_INIT_FILE_DONE) != 0)
			{// PLC 模块档案初始化完成，进入任务初始化
				PLCManage->Flag &= ~PLC_FLAG_INIT_FILE_DONE;
				pTerminalRam->RouterAck_S_Timer = 0;
				pTerminalRouter->RouterInitTask++;
				pTerminalRouter->RetryCnt = 0;
			}	
			else
			{
				if(pTerminalRam->RouterAck_S_Timer == 0)
				{// 超时，重发初始化档案
					pTerminalRouter->RouterInitTask--;
				}
			}
			break;
		case PLC_RECOGNIZE_INIT_TASK:				// 发送任务初始化
			PLC_TxInitTask(PORTn, PLCManage, &LocalFrame);
			break;
		case PLC_RECOGNIZE_WAIT_INIT_TASK_ACK:		
			if((PLCManage->Flag & PLC_FLAG_INIT_TASK_DONE) != 0)
			{// PLC 模块任务初始化完成，进入设置模块主节点地址
				PLCManage->Flag &= ~PLC_FLAG_INIT_TASK_DONE;
				pTerminalRam->RouterAck_S_Timer = 0;
				pTerminalRouter->RouterInitTask++;
				pTerminalRouter->RetryCnt = 0;
			}
			else
			{
				if(pTerminalRam->RouterAck_S_Timer == 0)
				{ // 超时，重发初始化任务
					pTerminalRouter->RouterInitTask--;
				}
			}
			break;
		case PLC_RECOGNIZE_SET_MODLE_ADDR:			// 发送设置主节点地址
			PLC_TxSetMasterNodeAddr(PORTn, PLCManage, &LocalFrame);
			break;
		case PLC_RECOGNIZE_WAIT_SET_MODLE_ADDR_ACK:			
			if((PLCManage->Flag & PLC_FLAG_SET_MODLE_ADDR_DONE) != 0)
			{// PLC 模块点知设置完成，进入查询主节点地址步骤
				PLCManage->Flag &= ~PLC_FLAG_SET_MODLE_ADDR_DONE;
				pTerminalRam->RouterAck_S_Timer = 0;
				pTerminalRouter->RouterInitTask++;
				pTerminalRouter->RetryCnt = 0;
			}
			else
			{
				if(pTerminalRam->RouterAck_S_Timer == 0)
				{ // 超时，重发设置模块地址
					pTerminalRouter->RouterInitTask--;
				}
			}
			break;
		case PLC_RECOGNIZE_READ_MODLE_ADDR:			// 发送查询主节点地址
			PLC_TxReadMasterNodeAddr(PORTn, PLCManage, &LocalFrame);
			break;
		case PLC_RECOGNIZE_WAIT_READ_MODLE_ADDR_ACK:		
			if((PLCManage->Flag & PLC_FLAG_READ_MODLE_ADDR_DONE) != 0)
			{// PLC 模块地址读取完成
				PLCManage->Flag &= ~PLC_FLAG_READ_MODLE_ADDR_DONE;
				pTerminalRam->RouterAck_S_Timer = 0;
				MC(0, (u32)&CommPara, sizeof(CommunicationParaStruct));
				MR((u32)&CommPara, ADDR_CommunicationPara, sizeof(CommunicationParaStruct));
				ConvertTerminalAddrToBCD(CommPara.TerminalAddr, CommPara.TerminalLocationCode, Temp);
				if(MemCompare(pTerminalRouter->RouterAddr, Temp, METER_ADDR_SIZE) == 0)
				{// PLC 模块地址与终端地址相等，则模块识别完成，进入设置 PLC 模块档案同步阶段
					MR((u32)PLCManage->TerminalAddr, (u32)pTerminalRouter->RouterAddr, METER_ADDR_SIZE);
					pTerminalRouter->RouterInitTask++;
					pTerminalRouter->RetryCnt = 0;
				}
				else
				{// PLC 模块地址与终端地址不等，则进入初始化档案
					pTerminalRouter->RouterInitTask = PLC_RECOGNIZE_INIT_FILE;
					pTerminalRouter->RetryCnt = 0;
					pTerminalRam->RouterAck_S_Timer = 3;
				}	
			}
			else
			{
				if(pTerminalRam->RouterAck_S_Timer == 0)
				{ // 超时，重发查询 PLC 模块主节点地址
					pTerminalRouter->RouterInitTask--;
				}
			}
			break;
		case PLC_RECOGNIZE_DONE:
			//DisplayRouterVer(PORTn);
			PLCManage->State = PLC_FILE_SYNC;
			pTerminalRouter->RouterInitTask = 0;
			pTerminalRouter->RetryCnt = 0;
			break;
		default:
			pTerminalRouter->RouterInitTask = 0;
			break;
	}
}

ResultEnum PLC_TxReadRunMode(u32 PORTn, PLCManageStruct* PLCManage, QCSGLocalFrameStruct* LocalFrame)
{
	u16* p16;
	u16 NextBps = 0;
	u32 FrameLen = 0, AddrTxBuf = 0;
	UARTCtrl_TypeDef* UARTCtrl;
	UartTxReqStruct UartTxReq;
	Terminal_Router_TypeDef* pTerminalRouter = Terminal_Router;
	Terminal_Ram_TypeDef* pTerminalRam = Terminal_Ram;
	
	if(pTerminalRam->RouterAck_S_Timer != 0) return ERROR_WRONG_TIME;
	
	if(pTerminalRouter->RetryCnt < PLC_CMD_MAX_CNT)
	{
		MC(0, (u32)LocalFrame, sizeof(QCSGLocalFrameStruct));					
		pTerminalRam->RouterAck_S_Timer = PLC_RECOGNIZE_TIME_OUT;
		LocalFrame->FC = LOCAL_FRAME_PRM_BIT;
		LocalFrame->AFN = LOCAL_FRAME_AFN_03;
		LocalFrame->SEQ = PLCManage->SEQ++;
		LocalFrame->DI = 0xE8000302;
		LocalFrame->DataLen = 0;

		AddrTxBuf = GetUartPortTxBuf(PORTn);
		FrameLen = BuildLocalModuleFrame((u8*)AddrTxBuf, LocalFrame);
		MC(0, (u32)&UartTxReq, sizeof(UartTxReqStruct));				
		UartTxReq.SrcTask = TASK_ID_PLC_INIT;
		UartTxReq.NeedAck = 1;
		UartTxReq.FrameType = FRAME_TYPE_QCSG_LOCAL;
		UartTxReq.RetryCnt = 0;
		UartTxReq.BpsCtrl = 0;
		UartTxReq.TimeOut = PLC_RECOGNIZE_TIME_OUT;
		UartTxReq.DataLen = FrameLen;
		UartTxReq.DataBuf = (u8*)AddrTxBuf;
		if(UartPortTxReqNew(PORTn, &UartTxReq) == NO_ERROR)
		{
			pTerminalRouter->RouterInitTask++;
			pTerminalRouter->RetryCnt++;
		}
		return NO_ERROR;
	}

	UARTCtrl = (UARTCtrl_TypeDef*)Get_ADDR_UARTnCtrl(PORTn);
	NextBps = GetNextBPS(UARTCtrl->BpsCtrl, PLC_SEARCH_BPS);
	if(NextBps != 0xFFFF)
	{
		UARTCtrl->BpsCtrl = NextBps;
		UARTCtrl->Function = 1;
		UARTCtrl->Task = 0;			
		UARTCtrl->RxByte = 0;
		Init_UARTn(PORTn);
		p16 = (u16 *)Get_ADDR_UARTn(PORTn);
		p16[0] = 0;			// 中断接收指针
		p16[1] = 0;			// 当前已读指针
		pTerminalRouter->RetryCnt = 0;
	}
	else
	{
		if(pTerminalRouter->RouterResetCnt < PLC_RESET_MAX_CNT)
		{
			PLCManage->State = PLC_RESET_INIT;
			pTerminalRouter->RouterResetCnt++;		
			pTerminalRouter->RouterInitTask = 0;
			pTerminalRouter->RetryCnt = 0;
		}
		else
		{
			PLCManage->State = PLC_MODLE_ERROR;
			WarningOccur(PORTn,(u8 *)"载波模块无法识别");
		}
	}
	return NO_ERROR;
}

ResultEnum PLC_TxInitFile(u32 PORTn, PLCManageStruct* PLCManage, QCSGLocalFrameStruct* LocalFrame)
{
	u32 FrameLen = 0, AddrTxBuf = 0;
	UartTxReqStruct UartTxReq;
	Terminal_Router_TypeDef* pTerminalRouter = Terminal_Router;
	Terminal_Ram_TypeDef* pTerminalRam = Terminal_Ram;
	
	if(pTerminalRam->RouterAck_S_Timer != 0) return ERROR_WRONG_TIME;
	
	if(pTerminalRouter->RetryCnt < PLC_CMD_MAX_CNT)
	{
		MC(0, (u32)LocalFrame, sizeof(QCSGLocalFrameStruct));
		pTerminalRam->RouterAck_S_Timer = PLC_RECOGNIZE_TIME_OUT;
		LocalFrame->FC = LOCAL_FRAME_PRM_BIT;
		LocalFrame->AFN = LOCAL_FRAME_AFN_01;
		LocalFrame->SEQ = PLCManage->SEQ++;
		LocalFrame->DI = 0xE8020102;
		LocalFrame->DataLen = 0;

		AddrTxBuf = GetUartPortTxBuf(PORTn);
		FrameLen = BuildLocalModuleFrame((u8*)AddrTxBuf, LocalFrame);
		MC(0, (u32)&UartTxReq, sizeof(UartTxReqStruct));				
		UartTxReq.SrcTask = TASK_ID_PLC_INIT;
		UartTxReq.NeedAck = 1;
		UartTxReq.FrameType = FRAME_TYPE_QCSG_LOCAL;
		UartTxReq.RetryCnt = 0;
		UartTxReq.BpsCtrl = 0;
		UartTxReq.TimeOut = PLC_RECOGNIZE_TIME_OUT;
		UartTxReq.DataLen = FrameLen;
		UartTxReq.DataBuf = (u8*)AddrTxBuf;
		if(UartPortTxReqNew(PORTn, &UartTxReq) == NO_ERROR)
		{
			pTerminalRouter->RouterInitTask++;
			pTerminalRouter->RetryCnt++;
		}
	}
	else
	{		
		PLCManage->State = PLC_RESET_INIT;
		pTerminalRouter->RouterResetCnt = 0;		
		pTerminalRouter->RouterInitTask = 0;
		pTerminalRouter->RetryCnt = 0;
	}
	return NO_ERROR;	
}

ResultEnum PLC_TxInitTask(u32 PORTn, PLCManageStruct* PLCManage, QCSGLocalFrameStruct* LocalFrame)
{
	u32 FrameLen = 0, AddrTxBuf = 0;
	UartTxReqStruct UartTxReq;
	Terminal_Router_TypeDef* pTerminalRouter = Terminal_Router;
	Terminal_Ram_TypeDef* pTerminalRam = Terminal_Ram;
	
	if(pTerminalRam->RouterAck_S_Timer != 0) return ERROR_WRONG_TIME;
	
	if(pTerminalRouter->RetryCnt < PLC_CMD_MAX_CNT)
	{
		MC(0, (u32)LocalFrame, sizeof(QCSGLocalFrameStruct));		
		LocalFrame->FC = LOCAL_FRAME_PRM_BIT;
		LocalFrame->AFN = LOCAL_FRAME_AFN_01;//初始化模块
		LocalFrame->SEQ = PLCManage->SEQ++;
		LocalFrame->DI = 0xE8020103;//初始化任务
		LocalFrame->DataLen = 0;

		AddrTxBuf = GetUartPortTxBuf(PORTn);
		FrameLen = BuildLocalModuleFrame((u8*)AddrTxBuf, LocalFrame);
		MC(0, (u32)&UartTxReq, sizeof(UartTxReqStruct));				
		UartTxReq.SrcTask = TASK_ID_PLC_INIT;
		UartTxReq.NeedAck = 1;
		UartTxReq.FrameType = FRAME_TYPE_QCSG_LOCAL;
		UartTxReq.RetryCnt = 0;
		UartTxReq.BpsCtrl = 0;
		UartTxReq.TimeOut = PLC_RECOGNIZE_TIME_OUT;
		UartTxReq.DataLen = FrameLen;
		UartTxReq.DataBuf = (u8*)AddrTxBuf;
		if(UartPortTxReqNew(PORTn, &UartTxReq) == NO_ERROR)
		{
			pTerminalRouter->RouterInitTask++;
			pTerminalRouter->RetryCnt++;
			pTerminalRam->RouterAck_S_Timer = PLC_WAIT_ACK_TIME_OUT;
		}
	}
	else
	{
		PLCManage->State = PLC_RESET_INIT;
		pTerminalRouter->RouterResetCnt = 0;		
		pTerminalRouter->RouterInitTask = 0;
		pTerminalRouter->RetryCnt = 0;
	}	
	return NO_ERROR;
}

