gdgly/NUC97X_JS/STM32F4xx/CSG/QCSG_Task/CH_PLC_AMR_Task.c
ResultEnum PLC_TxSetMasterNodeAddr(u32 PORTn, PLCManageStruct* PLCManage, QCSGLocalFrameStruct* LocalFrame)
{
	u8 Temp[8];
	u32 FrameLen = 0, AddrTxBuf = 0;
	UartTxReqStruct UartTxReq;
	CommunicationParaStruct CommPara;
	Terminal_Router_TypeDef* pTerminalRouter = Terminal_Router;
	Terminal_Ram_TypeDef* pTerminalRam = Terminal_Ram;
	
	if(pTerminalRam->RouterAck_S_Timer != 0) return ERROR_WRONG_TIME;
	
	if(pTerminalRouter->RetryCnt < PLC_CMD_MAX_CNT)
	{
		MC(0, (u32)LocalFrame, sizeof(QCSGLocalFrameStruct));
		MC(0, (u32)&CommPara, sizeof(CommunicationParaStruct));
		MR((u32)&CommPara, ADDR_CommunicationPara, sizeof(CommunicationParaStruct));
		ConvertTerminalAddrToBCD(CommPara.TerminalAddr, CommPara.TerminalLocationCode, Temp);
		pTerminalRam->RouterAck_S_Timer = PLC_RECOGNIZE_TIME_OUT;
		LocalFrame->FC = LOCAL_FRAME_PRM_BIT;
		LocalFrame->AFN = LOCAL_FRAME_AFN_04;
		LocalFrame->SEQ = PLCManage->SEQ++;
		LocalFrame->DI = 0xE8020401;
		LocalFrame->DataLen = METER_ADDR_SIZE;
		MR((u32)LocalFrame->Data, (u32)Temp, METER_ADDR_SIZE);

		AddrTxBuf = GetUartPortTxBuf(PORTn);
		FrameLen = BuildLocalModuleFrame((u8*)AddrTxBuf, LocalFrame);
		MC(0, (u32)&UartTxReq, sizeof(UartTxReqStruct));				
		UartTxReq.SrcTask = TASK_ID_PLC_INIT;
		UartTxReq.NeedAck = 1;
		UartTxReq.FrameType = FRAME_TYPE_QCSG_LOCAL;
		UartTxReq.RetryCnt = 0;
		UartTxReq.BpsCtrl = 0;
		UartTxReq.TimeOut = PLC_RECOGNIZE_TIME_OUT;
		UartTxReq.DataLen = (u16)FrameLen;
		UartTxReq.DataBuf = (u8*)AddrTxBuf;
		if(UartPortTxReqNew(PORTn, &UartTxReq) == NO_ERROR)
		{
			pTerminalRouter->RouterInitTask++;
			pTerminalRouter->RetryCnt++;
		}
	}
	else
	{
		PLCManage->State = PLC_RESET_INIT;
		pTerminalRouter->RouterResetCnt = 0;		
		pTerminalRouter->RouterInitTask = 0;
		pTerminalRouter->RetryCnt = 0;
	}
	return NO_ERROR;	
}

ResultEnum PLC_TxReadMasterNodeAddr(u32 PORTn, PLCManageStruct* PLCManage, QCSGLocalFrameStruct* LocalFrame)
{
	u32 FrameLen = 0, AddrTxBuf = 0;
	UartTxReqStruct UartTxReq;
	Terminal_Router_TypeDef* pTerminalRouter = Terminal_Router;
	Terminal_Ram_TypeDef* pTerminalRam = Terminal_Ram;
	
	if(pTerminalRam->RouterAck_S_Timer != 0) return ERROR_WRONG_TIME;
	
	if(pTerminalRouter->RetryCnt < PLC_CMD_MAX_CNT)
	{
		MC(0, (u32)LocalFrame, sizeof(QCSGLocalFrameStruct));
		pTerminalRam->RouterAck_S_Timer = PLC_RECOGNIZE_TIME_OUT;
		LocalFrame->FC = LOCAL_FRAME_PRM_BIT;
		LocalFrame->AFN = LOCAL_FRAME_AFN_03;
		LocalFrame->SEQ = PLCManage->SEQ++;
		LocalFrame->DI = 0xE8000303;
		LocalFrame->DataLen = 0;

		AddrTxBuf = GetUartPortTxBuf(PORTn);
		FrameLen = BuildLocalModuleFrame((u8*)AddrTxBuf, LocalFrame);
		MC(0, (u32)&UartTxReq, sizeof(UartTxReqStruct));				
		UartTxReq.SrcTask = TASK_ID_PLC_INIT;
		UartTxReq.NeedAck = 1;
		UartTxReq.FrameType = FRAME_TYPE_QCSG_LOCAL;
		UartTxReq.RetryCnt = 0;
		UartTxReq.BpsCtrl = 0;
		UartTxReq.TimeOut = PLC_RECOGNIZE_TIME_OUT;
		UartTxReq.DataLen = (u16)FrameLen;
		UartTxReq.DataBuf = (u8*)AddrTxBuf;
		if(UartPortTxReqNew(PORTn, &UartTxReq) == NO_ERROR)
		{
			pTerminalRouter->RouterInitTask++;
			pTerminalRouter->RetryCnt++;
		}
	}
	else
	{
		PLCManage->State = PLC_RESET_INIT;
		pTerminalRouter->RouterResetCnt = 0;		
		pTerminalRouter->RouterInitTask = 0;
		pTerminalRouter->RetryCnt = 0;
	}
	return NO_ERROR;	
}


void PLC_ModleFileSync(u32 PORTn, PLCManageStruct* PLCManage)
{
	u16 Index = 0, CurReadNodeNum = 0;
	QCSGLocalFrameStruct LocalFrame;
	Terminal_Router_TypeDef* pTerminalRouter = Terminal_Router;
	Terminal_Ram_TypeDef* pTerminalRam = Terminal_Ram;
	NodeListStruct* NodeList = (NodeListStruct*)ADDR_NodeList;
	u8* MeterAddrStart = (u8*)ADDR_PLC_AMR_DataBuf;
	MeterFileInfoStruct* MeterFileInfo = (MeterFileInfoStruct*)ADDR_MeterFileInfo;

	switch(pTerminalRouter->RouterInitTask)
	{
		case PLC_FILE_SYNC_READ_NODE_NUM:
			WarningOccur(PLC_PORT, (u8*)"载波正在同步档案...");
			PLC_FileSyncTxReadNodeNum(PORTn, PLCManage, &LocalFrame);
			break; 	
		case PLC_FILE_SYNC_WAIT_READ_NODE_NUM_ACK:			
			if((PLCManage->Flag & PLC_FLAG_READ_NODE_NUM_DONE) != 0)
			{// PLC 模块读取从节点数量完成，进入任务初始化
				PLCManage->Flag &= ~PLC_FLAG_READ_NODE_NUM_DONE;
				pTerminalRam->RouterAck_S_Timer = 0;
				if(MeterFileInfo->PLCMeters != pTerminalRouter->TotalNodeNum)
				{// 模块从节点数量与终端不一致，则进入初始化档案步骤
					pTerminalRouter->RouterInitTask++;
					pTerminalRouter->RetryCnt = 0;
				}
				else
				{// 模块从节点数量与终端一致，则进入查询从节点信息步骤
				
					//#if(TEST_ON == 1)//err20180626 临时去掉
					//	pTerminalRouter->RouterInitTask++;
					//	pTerminalRouter->RetryCnt = 0;
					//#else
						pTerminalRouter->RouterInitTask = PLC_FILE_SYNC_READ_NODE_INFO;
						pTerminalRouter->RetryCnt = 0;
						pTerminalRouter->CurReadNodeNum = 0;
						pTerminalRouter->ReadNodeNum = 0;
					//#endif	
				}	
			}
			else
			{
				if(pTerminalRam->RouterAck_S_Timer == 0)
				{// 超时，重发初始化档案
					pTerminalRouter->RouterInitTask--;
				}
			}
			break;
		case PLC_FILE_SYNC_INIT_FILE:		// 下发初始化档案
			PLC_TxInitFile(PORTn, PLCManage, &LocalFrame);
			break;
		case PLC_FILE_SYNC_WAIT_INIT_FILE_ACK:		
			if((PLCManage->Flag & PLC_FLAG_INIT_FILE_DONE) != 0)
			{// PLC 模块档案初始化完成，进入添加从节点步骤
				PLCManage->Flag &= ~PLC_FLAG_INIT_FILE_DONE;
				pTerminalRam->RouterAck_S_Timer = 0;
				pTerminalRouter->RouterInitTask++;
				pTerminalRouter->RetryCnt = 0;
				pTerminalRouter->AddNodeNum = 0;
				pTerminalRouter->CurAddNodeNum = 0;
				pTerminalRouter->TempCount = 0;
			}
			else
			{
				if(pTerminalRam->RouterAck_S_Timer == 0)
				{// 超时，重发初始化档案
					pTerminalRouter->RouterInitTask--;
				}
			}
			break;
		case PLC_FILE_SYNC_ADD_NODE:		// 下发添加从节点
			PLC_FileSyncTxAddNode(PORTn, PLCManage, &LocalFrame);
			break;
		case PLC_FILE_SYNC_WAIT_ADD_NODE_ACK:			
			if((PLCManage->Flag & PLC_FLAG_ADD_NODE_DONE) != 0)
			{// PLC 单次添加从节点信息完成，
				PLCManage->Flag &= ~PLC_FLAG_ADD_NODE_DONE;
				pTerminalRam->RouterAck_S_Timer = 0;
				pTerminalRouter->AddNodeNum += pTerminalRouter->CurAddNodeNum;
				if(pTerminalRouter->AddNodeNum < MeterFileInfo->PLCMeters)
				{// 已添加的从节点小于总节点数，继续添加
					pTerminalRouter->RouterInitTask--;
					pTerminalRouter->RetryCnt = 0;
				}
				else
				{// 无剩余从节点，则进入查询从节点信息
					//pTerminalRouter->RouterInitTask++;
					pTerminalRouter->RouterInitTask = PLC_FILE_SYNC_READ_NODE_NUM;//err20180626 台体测试 添加从节点完成后重新查询从节点数据
					pTerminalRouter->CurReadNodeNum = 0;
					pTerminalRouter->ReadNodeNum = 0;
					pTerminalRouter->RetryCnt = 0;
				}
			}
			else
			{
				if(pTerminalRam->RouterAck_S_Timer == 0)
				{// 超时，重发初始化档案
					pTerminalRouter->RouterInitTask--;
				}
			}
			break;
		case PLC_FILE_SYNC_READ_NODE_INFO:		// 下发查询从节点信息
			PLC_FileSyncTxReadNodeInfo(PORTn, PLCManage, &LocalFrame);
			break;
		case PLC_FILE_SYNC_WAIT_READ_NODE_INFO_ACK:
			if((PLCManage->Flag & PLC_FLAG_READ_NODE_INFO_DONE) != 0)
			{// PLC 单次读取从节点信息完成，
				PLCManage->Flag &= ~PLC_FLAG_READ_NODE_INFO_DONE;
				pTerminalRam->RouterAck_S_Timer = 0;
				CurReadNodeNum = pTerminalRouter->CurReadNodeNum;
				Index = CompareMeterAddrInNodeList(MeterAddrStart, CurReadNodeNum, NodeList, MAX_PN_NUM);
				if(Index < CurReadNodeNum)
				{// 比对从节点地址时，查询到在 PLC 载波表列表中存在不能匹配的地址，则回到初始化档案，重新添加从节点
					pTerminalRouter->RouterInitTask = PLC_FILE_SYNC_INIT_FILE;
					pTerminalRouter->RetryCnt = 0;
				}
				else
				{// 本次从节点信息比对成功，则判断是否还有剩余从节点需要比对
					PLC_FileSyncSetOkFlag(MeterAddrStart, CurReadNodeNum, NodeList);
					pTerminalRouter->ReadNodeNum += CurReadNodeNum;
					if((pTerminalRouter->ReadNodeNum < MeterFileInfo->PLCMeters) && (CurReadNodeNum != 0))
					{
						pTerminalRouter->RouterInitTask--;
						pTerminalRouter->RetryCnt = 0;
					}
					else
					{// 无剩余从节点需要比对，则进入初始化任务步骤
						pTerminalRouter->RouterInitTask++;
						pTerminalRouter->RetryCnt = 0;
					}
				}
			}	
			else
			{
				if(pTerminalRam->RouterAck_S_Timer == 0)
				{// 超时，重发查询从节点信息
					pTerminalRouter->RouterInitTask--;
				}
			}
			break;
		case PLC_FILE_SYNC_INIT_TASK:		// 发送任务初始化
			PLC_TxInitTask(PORTn, PLCManage, &LocalFrame);
			break;
		case PLC_FILE_SYNC_WAIT_INIT_TASK_ACK:			
			if((PLCManage->Flag & PLC_FLAG_INIT_TASK_DONE) != 0)
			{// PLC 模块任务初始化完成，进入设置模块档案同步完成
				PLCManage->Flag &= ~PLC_FLAG_INIT_TASK_DONE;
				pTerminalRam->RouterAck_S_Timer = 0;
				pTerminalRouter->RouterInitTask++;
				pTerminalRouter->RetryCnt = 0;
			}
			else
			{
				if(pTerminalRam->RouterAck_S_Timer == 0)
				{ // 超时，重发初始化任务
					pTerminalRouter->RouterInitTask--;
				}
			}
			break;			
		case PLC_FILE_SYNC_DONE:
			if(pTerminalRam->RouterAck_S_Timer == 0)
			{// 模块档案完成，进入抄表空闲状态，等待启动抄表
				WarningCancel(PLC_PORT);
				PLCManage->State = PLC_AMR_STATE;
				MeterFileInfo->PLCMeterSyncFlag = 0;
				pTerminalRouter->RouterInitTask = 0;
				pTerminalRouter->RetryCnt = 0;
			}		
			break;
		default:
			pTerminalRouter->RouterInitTask = 0;
			break;
		
