gdgly/NUC97X_JS/STM32F4xx/CSG/QCSG_Task/CH_PLC_AMR_Task.c
	}
}

void PLC_FileSyncSetOkFlag(u8* MeterList, u32 MeterListNum, NodeListStruct* NodeList)
{
	u32 i = 0, Index = 0;
	for(i = 0; i < MeterListNum; i++)
	{
		Index = FindMeterInNodeList(&MeterList[i*METER_ADDR_SIZE], NodeList, MAX_PN_NUM);
		if(Index < MAX_PN_NUM)
		{
			NodeList[Index].Flag |= NODE_FLAG_SYNC_TO_PLC_OK;
			NodeList[Index].Flag &= ~NODE_FLAG_NEED_FILE_SYNC;
		}
	}
}

ResultEnum PLC_FileSyncTxReadNodeNum(u32 PORTn, PLCManageStruct* PLCManage, QCSGLocalFrameStruct* LocalFrame)
{
	u32 FrameLen = 0, AddrTxBuf = 0;
	UartTxReqStruct UartTxReq;
	Terminal_Router_TypeDef* pTerminalRouter = Terminal_Router;
	Terminal_Ram_TypeDef* pTerminalRam = Terminal_Ram;
	
	if(pTerminalRam->RouterAck_S_Timer != 0) return ERROR_WRONG_TIME;
	
	if(pTerminalRouter->RetryCnt < PLC_CMD_MAX_CNT)
	{
		MC(0, (u32)LocalFrame, sizeof(QCSGLocalFrameStruct));
		pTerminalRam->RouterAck_S_Timer = PLC_WAIT_ACK_TIME_OUT;
		LocalFrame->FC = LOCAL_FRAME_PRM_BIT;
		LocalFrame->AFN = LOCAL_FRAME_AFN_03;
		LocalFrame->SEQ = PLCManage->SEQ++;
		LocalFrame->DI = 0xE8000305;
		LocalFrame->DataLen = 0;

		AddrTxBuf = GetUartPortTxBuf(PORTn);
		FrameLen = BuildLocalModuleFrame((u8*)AddrTxBuf, LocalFrame);
		MC(0, (u32)&UartTxReq, sizeof(UartTxReqStruct));				
		UartTxReq.SrcTask = TASK_ID_PLC_FILE_SYNC;
		UartTxReq.NeedAck = 1;
		UartTxReq.FrameType = FRAME_TYPE_QCSG_LOCAL;
		UartTxReq.RetryCnt = 0;
		UartTxReq.BpsCtrl = 0;
		UartTxReq.TimeOut = PLC_WAIT_ACK_TIME_OUT;
		UartTxReq.DataLen = FrameLen;
		UartTxReq.DataBuf = (u8*)AddrTxBuf;
		if(UartPortTxReqNew(PORTn, &UartTxReq) == NO_ERROR)
		{
			pTerminalRouter->RouterInitTask++;
			pTerminalRouter->RetryCnt++;
		}
	}
	else
	{
		PLCManage->State = PLC_RESET_INIT;
		pTerminalRouter->RouterResetCnt = 0;		
		pTerminalRouter->RouterInitTask = 0;
		pTerminalRouter->RetryCnt = 0;
	}	
	return NO_ERROR;
}

ResultEnum PLC_FileSyncTxAddNode(u32 PORTn, PLCManageStruct* PLCManage, QCSGLocalFrameStruct* LocalFrame)
{
	u16 i = 0, TempAddNodeNum = 0;
	u32 FrameLen = 0, AddrTxBuf = 0;
	UartTxReqStruct UartTxReq;
	Terminal_Router_TypeDef* pTerminalRouter = Terminal_Router;
	Terminal_Ram_TypeDef* pTerminalRam = Terminal_Ram;
	NodeListStruct* NodeList = (NodeListStruct*)ADDR_NodeList;
	MeterFileInfoStruct* MeterFileInfo = (MeterFileInfoStruct*)ADDR_MeterFileInfo;
	
	if(pTerminalRam->RouterAck_S_Timer != 0) return ERROR_WRONG_TIME;
	
	if(pTerminalRouter->RetryCnt < PLC_CMD_MAX_CNT)
	{	
		MC(0, (u32)LocalFrame, sizeof(QCSGLocalFrameStruct));
		pTerminalRam->RouterAck_S_Timer = PLC_WAIT_ACK_TIME_OUT;
		LocalFrame->FC = LOCAL_FRAME_PRM_BIT;
		LocalFrame->AFN = LOCAL_FRAME_AFN_04;
		LocalFrame->SEQ = PLCManage->SEQ++;
		LocalFrame->DI = 0xE8020402;
		LocalFrame->DataLen = 0;
		if(MeterFileInfo->PLCMeters > pTerminalRouter->AddNodeNum)
		{
			if((MeterFileInfo->PLCMeters - pTerminalRouter->AddNodeNum) > pTerminalRouter->MaxRWNodeNum)
			{
				TempAddNodeNum = pTerminalRouter->MaxRWNodeNum;
			}
			else
			{
				TempAddNodeNum = MeterFileInfo->PLCMeters - pTerminalRouter->AddNodeNum;
			}
		}
		else
		{
			TempAddNodeNum = 0;
		}

		if(TempAddNodeNum == 0)
		{
			pTerminalRouter->RouterInitTask = PLC_FILE_SYNC_READ_NODE_INFO;
			return ERROR_WRONG_ACCESS;
		}

		LocalFrame->DataLen++;
		for(i = 0; i < TempAddNodeNum; i++)
		{
			pTerminalRouter->TempCount = FindPortNextMeterInNodeList(PORT_ID_PLC, NodeList, pTerminalRouter->TempCount, MAX_PN_NUM);
			if(pTerminalRouter->TempCount >= MAX_PN_NUM) break;
			MR((u32)&LocalFrame->Data[LocalFrame->DataLen], (u32)NodeList[pTerminalRouter->TempCount].Addr, METER_ADDR_SIZE);
			pTerminalRouter->TempCount++;
			LocalFrame->DataLen += METER_ADDR_SIZE;
		}

		pTerminalRouter->CurAddNodeNum = i;
		LocalFrame->Data[0] = pTerminalRouter->CurAddNodeNum;
		
		AddrTxBuf = GetUartPortTxBuf(PORTn);
		FrameLen = BuildLocalModuleFrame((u8*)AddrTxBuf, LocalFrame);
		MC(0, (u32)&UartTxReq, sizeof(UartTxReqStruct));				
		UartTxReq.SrcTask = TASK_ID_PLC_FILE_SYNC;
		UartTxReq.NeedAck = 1;
		UartTxReq.FrameType = FRAME_TYPE_QCSG_LOCAL;
		UartTxReq.RetryCnt = 0;
		UartTxReq.BpsCtrl = 0;
		UartTxReq.TimeOut = PLC_WAIT_ACK_TIME_OUT;
		UartTxReq.DataLen = FrameLen;
		UartTxReq.DataBuf = (u8*)AddrTxBuf;
		if(UartPortTxReqNew(PORTn, &UartTxReq) == NO_ERROR)
		{
			pTerminalRouter->RouterInitTask++;
			pTerminalRouter->RetryCnt++;
		}
	}
	else
	{
		PLCManage->State = PLC_RESET_INIT;
		pTerminalRouter->RouterResetCnt = 0;		
		pTerminalRouter->RouterInitTask = 0;
		pTerminalRouter->RetryCnt = 0;
	}
	return NO_ERROR;
}

ResultEnum PLC_FileSyncTxReadNodeInfo(u32 PORTn, PLCManageStruct* PLCManage, QCSGLocalFrameStruct* LocalFrame)
{
	u32 FrameLen = 0, AddrTxBuf = 0;
	UartTxReqStruct UartTxReq;
	Terminal_Router_TypeDef* pTerminalRouter = Terminal_Router;
	Terminal_Ram_TypeDef* pTerminalRam = Terminal_Ram;
	
	if(pTerminalRam->RouterAck_S_Timer != 0) return ERROR_WRONG_TIME;
	
	if(pTerminalRouter->RetryCnt < PLC_CMD_MAX_CNT)
	{	
		MC(0, (u32)LocalFrame, sizeof(QCSGLocalFrameStruct));
		pTerminalRam->RouterAck_S_Timer = PLC_WAIT_ACK_TIME_OUT;
		LocalFrame->FC = LOCAL_FRAME_PRM_BIT;
		LocalFrame->AFN = LOCAL_FRAME_AFN_03;
		LocalFrame->SEQ = PLCManage->SEQ++;
		LocalFrame->DI = 0xE8030306;
		LocalFrame->DataLen = 0;
		LocalFrame->Data[LocalFrame->DataLen++] = pTerminalRouter->ReadNodeNum;
		LocalFrame->Data[LocalFrame->DataLen++] = pTerminalRouter->ReadNodeNum >> 8;
		LocalFrame->Data[LocalFrame->DataLen++] = pTerminalRouter->MaxRWNodeNum;

		AddrTxBuf = GetUartPortTxBuf(PORTn);
		FrameLen = BuildLocalModuleFrame((u8*)AddrTxBuf, LocalFrame);
		MC(0, (u32)&UartTxReq, sizeof(UartTxReqStruct));				
		UartTxReq.SrcTask = TASK_ID_PLC_FILE_SYNC;
		UartTxReq.NeedAck = 1;
		UartTxReq.FrameType = FRAME_TYPE_QCSG_LOCAL;
		UartTxReq.RetryCnt = 0;
		UartTxReq.BpsCtrl = 0;
		UartTxReq.TimeOut = PLC_WAIT_ACK_TIME_OUT;
		UartTxReq.DataLen = FrameLen;
		UartTxReq.DataBuf = (u8*)AddrTxBuf;
		if(UartPortTxReqNew(PORTn, &UartTxReq) == NO_ERROR)
		{
			pTerminalRouter->RouterInitTask++;
			pTerminalRouter->RetryCnt++;
		}
	}
	else
	{
		PLCManage->State = PLC_RESET_INIT;
		pTerminalRouter->RouterResetCnt = 0;		
		pTerminalRouter->RouterInitTask = 0;
		pTerminalRouter->RetryCnt = 0;
	}	
	return NO_ERROR;
}


ResultEnum PLC_FileAddNodeTxAddNode(u32 PORTn, PLCManageStruct* PLCManage, QCSGLocalFrameStruct* LocalFrame)
{
	u16 i = 0, TempAddNodeNum = 0;
	u32 FrameLen = 0, AddrTxBuf = 0;
	UartTxReqStruct UartTxReq;
	Terminal_Router_TypeDef* pTerminalRouter = Terminal_Router;
	Terminal_Ram_TypeDef* pTerminalRam = Terminal_Ram;
	NodeListStruct* NodeList = (NodeListStruct*)ADDR_NodeList;
	
	if(pTerminalRam->RouterAck_S_Timer != 0) return ERROR_WRONG_TIME;
	if(pTerminalRouter->RetryCnt < PLC_CMD_MAX_CNT)
	{	
		MC(0, (u32)LocalFrame, sizeof(QCSGLocalFrameStruct));
		pTerminalRam->RouterAck_S_Timer = PLC_WAIT_ACK_TIME_OUT;
		LocalFrame->FC = LOCAL_FRAME_PRM_BIT;
		LocalFrame->AFN = LOCAL_FRAME_AFN_04;
		LocalFrame->SEQ = PLCManage->SEQ++;
		LocalFrame->DI = 0xE8020402;
		LocalFrame->DataLen = 0;

		LocalFrame->DataLen++;
		for(i = pTerminalRouter->TempCount; i < MAX_PN_NUM; i++)
		{// pTerminalRouter->TempCount在进入添加节点状态之前必须清零，目的是在多次添加节点时，不必每次都从头开始查找
			if(TempAddNodeNum >= pTerminalRouter->MaxRWNodeNum) break;
			if((NodeList[i].PortID == PORT_ID_PLC) && ((NodeList[i].Flag & NODE_FLAG_NEED_FILE_SYNC) != 0))
			{
				MR((u32)&LocalFrame->Data[LocalFrame->DataLen], (u32)NodeList[i].Addr, METER_ADDR_SIZE);
				LocalFrame->DataLen += METER_ADDR_SIZE;
				TempAddNodeNum++;
			}			
		}
		if(TempAddNodeNum == 0)
		{
			pTerminalRouter->RouterInitTask = PLC_FILE_ADD_DONE;
			return ERROR_WRONG_ACCESS;
		}
		pTerminalRouter->TempCount = i;
		LocalFrame->Data[0] = TempAddNodeNum;
		
		AddrTxBuf = GetUartPortTxBuf(PORTn);
		FrameLen = BuildLocalModuleFrame((u8*)AddrTxBuf, LocalFrame);
		MC(0, (u32)&UartTxReq, sizeof(UartTxReqStruct));				
		UartTxReq.SrcTask = TASK_ID_PLC_ADD_NODE;
		UartTxReq.NeedAck = 1;
		UartTxReq.FrameType = FRAME_TYPE_QCSG_LOCAL;
		UartTxReq.RetryCnt = 0;
		UartTxReq.BpsCtrl = 0;
		UartTxReq.TimeOut = PLC_WAIT_ACK_TIME_OUT;
		UartTxReq.DataLen = FrameLen;
		UartTxReq.DataBuf = (u8*)AddrTxBuf;
		if(UartPortTxReqNew(PORTn, &UartTxReq) == NO_ERROR)
		{
			pTerminalRouter->RouterInitTask++;
			pTerminalRouter->RetryCnt++;
		}
	}
	else
	{
		PLCManage->State = PLC_RESET_INIT;
		pTerminalRouter->RouterResetCnt = 0;		
		pTerminalRouter->RouterInitTask = 0;
		pTerminalRouter->RetryCnt = 0;
	}
	return NO_ERROR;
}

void PLC_ModleFileAddNode(u32 PORTn, PLCManageStruct* PLCManage)
{
	u16 i = 0;
	QCSGLocalFrameStruct LocalFrame;
	Terminal_Router_TypeDef* pTerminalRouter = Terminal_Router;
	Terminal_Ram_TypeDef* pTerminalRam = Terminal_Ram;
	NodeListStruct* NodeList = (NodeListStruct*)ADDR_NodeList;
	MeterFileInfoStruct* MeterFileInfo = (MeterFileInfoStruct*)ADDR_MeterFileInfo;

	switch(pTerminalRouter->RouterInitTask)
	{
		case PLC_FILE_ADD_ADD_NODE:		// 下发添加从节点
			PLC_FileAddNodeTxAddNode(PORTn, PLCManage, &LocalFrame);
			break;
		case PLC_FILE_ADD_WAIT_ADD_NODE_ACK:			
			if((PLCManage->Flag & PLC_FLAG_ADD_NODE_DONE) != 0)
			{// PLC 单次添加从节点信息完成，
				PLCManage->Flag &= ~PLC_FLAG_ADD_NODE_DONE;
				pTerminalRam->RouterAck_S_Timer = 0;
				for(i = 0; i < pTerminalRouter->TempCount; i++)
				{
					if((NodeList[i].PortID == PORT_ID_PLC) && 
					   ((NodeList[i].Flag & NODE_FLAG_NEED_FILE_SYNC) != 0))
					{
						NodeList[i].Flag &= ~NODE_FLAG_NEED_FILE_SYNC;
						NodeList[i].Flag |= NODE_FLAG_SYNC_TO_PLC_OK;
					}			
				}
				for(i = pTerminalRouter->TempCount; i < MAX_PN_NUM; i++)
				{
					if((NodeList[i].PortID == PORT_ID_PLC) && 
					   ((NodeList[i].Flag & NODE_FLAG_NEED_FILE_SYNC) != 0))
					{
						break;
					}			
				}
				if(i < MAX_PN_NUM)
				{
					pTerminalRouter->RouterInitTask--;
					pTerminalRouter->RetryCnt = 0;
				}
				else
				{
					pTerminalRouter->RouterInitTask++;
					pTerminalRouter->RetryCnt = 0;
				}
			}
			else
			{
				if(pTerminalRam->RouterAck_S_Timer == 0)
				{// 超时，重发添加节点
					pTerminalRouter->RouterInitTask--;
					pTerminalRouter->TempCount = 0;
				}
			}
			break;
		case PLC_FILE_ADD_DONE:
			if(pTerminalRam->RouterAck_S_Timer == 0)
			{// 模块档案完成，进入抄表空闲状态，等待启动抄表
				PLCManage->State = PLC_AMR_STATE;
				MeterFileInfo->PLCMeterSyncFlag = 0;
				pTerminalRouter->RouterInitTask = 0;
				pTerminalRouter->RetryCnt = 0;
				pTerminalRouter->TempCount = 0;
			}		
			break;
		default:
			pTerminalRouter->RouterInitTask = 0;
			break;
		
