gdgly/NUC97X_JS/STM32F4xx/CSG/QCSG_Task/CH_PLC_AMR_Task.c
	}
}



void PLC_ModleAMR_Task(u32 PORTn, PLCManageStruct* PLCManage)
{
	RealTimeStruct RealTime;	
	MeterFileInfoStruct* MeterFileInfo = (MeterFileInfoStruct*)ADDR_MeterFileInfo;
	AMRCtrlStruct* AMRCtrl = (AMRCtrlStruct*)Get_AMR_TaskCtrlAddr(PORTn);
	
	HAL_GetSystemTime(&RealTime);
	if(RealTime.u8Minute == 0x00)
	{
		AMRCtrl->Flag |= AMR_FLAG_TIME_CROSS_HOUR;
	}
	if((MeterFileInfo->PLCMeters == 0) && ((RealTime.u8Second & 0x07) == 0) && 
	   (AMRCtrl->State > AMR_Idle) && (AMRCtrl->State < AMR_Pause))
	{
		AMRCtrl->State = AMR_Idle;
		AMRCtrl->AMR_ID = 0;
	}
	
	switch(AMRCtrl->State)
	{
		case AMR_Idle:
			PLC_AMR_IdleProcess(PORTn, AMRCtrl, PLCManage, &RealTime);
			break;
		case AMR_Tx:
			PLC_AMR_TxProcess(PORTn, AMRCtrl, PLCManage);
			break;
		case AMR_WaitRx:
			PLC_AMR_WaitRxProcess(PORTn, AMRCtrl, PLCManage);
			break;
		case AMR_Pause:
			PLC_AMR_PauseProcess(PORTn, AMRCtrl, PLCManage);
			break;
		case AMR_RealTimeTx:
			PLC_AMR_RealTimeTxProcess(PORTn, AMRCtrl, PLCManage);
			break;
		case AMR_RealTimeWaitRx:
			PLC_AMR_WaitRealTimeRxProcess(PORTn, AMRCtrl, PLCManage);
			break;
		case AMR_Resume:
			PLC_AMR_ResumeProcess(PORTn, AMRCtrl, PLCManage);
			break;
		default:
			AMRCtrl->State = AMR_Idle;
			AMRCtrl->AMR_ID = 0;
			break;
	}
}


ResultEnum PLC_AMR_IdleProcess(u32 PORTn, AMRCtrlStruct* AMRCtrl, PLCManageStruct* PLCManage, RealTimeStruct* RealTime)
{
	u16* pAckTimer;
	Terminal_Router_TypeDef* pTerminalRouter = Terminal_Router;
	MeterFileInfoStruct* MeterFileInfo = (MeterFileInfoStruct*)ADDR_MeterFileInfo;

	pAckTimer = (u16*)GetUartPortAckTimerAddr(PORTn);
	if((pAckTimer == NULL) || (pAckTimer[0] != 0)) return ERROR_WRONG_TIME;
	
	if(MeterFileInfo->PLCMeterSyncFlag == METER_FILE_SYNC_TO_PLC_FLAG)
	{
		PLCManage->State = PLC_FILE_SYNC;
		pTerminalRouter->RouterInitTask = 0;
		pTerminalRouter->RetryCnt = 0;
		pTerminalRouter->TempCount = 0;
		return NO_ERROR;
	}
	
	if(AMRCtrl == NULL) return ERROR_POINTER_NULL;
	if(PLCManage == NULL) return ERROR_POINTER_NULL;
	if(RealTime == NULL) return ERROR_POINTER_NULL;

	if(AMRCtrl->LastCheckTime.u8Minute == RealTime->u8Minute) return ERROR_WRONG_TIME;
	DisplayRouterVer(PORTn);

#if(TEST_ON == 0)//err20180711 台体测试时跨日不同步档案，防止影响模块任务测试项
	if(AMRCtrl->LastCheckTime.u8Day != RealTime->u8Day)
	{
		PLCManage->State = PLC_FILE_SYNC;
		pTerminalRouter->RouterInitTask = 0;
		pTerminalRouter->RetryCnt = 0;
		pTerminalRouter->TempCount = 0;

		AMRCtrl->LastCheckTime.u8Second = RealTime->u8Second;
		AMRCtrl->LastCheckTime.u8Minute = RealTime->u8Minute;
		AMRCtrl->LastCheckTime.u8Hour   = RealTime->u8Hour;
		AMRCtrl->LastCheckTime.u8Day    = RealTime->u8Day;
		AMRCtrl->LastCheckTime.u8Month  = RealTime->u8Month;
		AMRCtrl->LastCheckTime.u8Year   = RealTime->u8Year;
		AMRCtrl->LastCheckTime.u8Week   = RealTime->u8Week;
		AMRCtrl->LastCheckTime.u8Sync   = RealTime->u8Sync;
		return NO_ERROR;
	}
#endif 
	AMRCtrl->LastCheckTime.u8Second = RealTime->u8Second;
	AMRCtrl->LastCheckTime.u8Minute = RealTime->u8Minute;
	AMRCtrl->LastCheckTime.u8Hour   = RealTime->u8Hour;
	AMRCtrl->LastCheckTime.u8Day    = RealTime->u8Day;
	AMRCtrl->LastCheckTime.u8Month  = RealTime->u8Month;
	AMRCtrl->LastCheckTime.u8Year   = RealTime->u8Year;
	AMRCtrl->LastCheckTime.u8Week   = RealTime->u8Week;
	AMRCtrl->LastCheckTime.u8Sync   = RealTime->u8Sync;

	if(MeterFileInfo->PLCMeters == 0) return ERROR_DestAddrNotExist;	
	AMRCtrl->TotalMeters = MeterFileInfo->PLCMeters;
	
	AMRCtrl->AMR_ID = 0;
	if((RealTime->u8Year != AMRCtrl->LastDayFrozenTime.u8Year) || 
	   (RealTime->u8Month != AMRCtrl->LastDayFrozenTime.u8Month))
	{
		AMRCtrl->MonthFreezFailMeters = 0;
		AMRCtrl->MonthFreezOkMeters = 0;
		MeterFileInfo->AMRMonthFreezFailMeters = 0;
	}
	
	if((RealTime->u8Year != AMRCtrl->LastDayFrozenTime.u8Year) || 
	   (RealTime->u8Month != AMRCtrl->LastDayFrozenTime.u8Month) || 
	   (RealTime->u8Day != AMRCtrl->LastDayFrozenTime.u8Day))
	{
		#if (TEST_ON == 0)
			if(RealTime->u8Minute > 0x04)
		#endif
		{
			AMRCtrl->AMR_ID |= AMR_DAY_FREEZ_ID;
			AMRCtrl->DayFreezFailMeters = 0;
			AMRCtrl->DayFreezOkMeters = 0;
			MeterFileInfo->AMRDayFreezFailMeters = 0;
			MC(0, (u32)ADDR_MeterDayFreezFailList, LEN_MeterDayFreezFailList);
		}	
	}

	if((RealTime->u8Year != AMRCtrl->LastHourFrozenTime.u8Year) || 
	   (RealTime->u8Month != AMRCtrl->LastHourFrozenTime.u8Month) || 
	   (RealTime->u8Day != AMRCtrl->LastHourFrozenTime.u8Day) || 
	   (RealTime->u8Hour != AMRCtrl->LastHourFrozenTime.u8Hour))
	{
		#if (TEST_ON == 0)
		if(RealTime->u8Minute > 0x04)
		#endif
		{
			AMRCtrl->AMR_ID |= AMR_HOUR_FREEZ_ID;
			AMRCtrl->HourFreezFailMeters = 0;
			AMRCtrl->HourFreezOkMeters = 0;
			if(AMRCtrl->DayFreezFailMeters != 0)
			{
				AMRCtrl->AMR_ID |= AMR_DAY_FREEZ_PATCH_ID;
			}
		}	
	}

	AMRTaskManageCheckNormalTask(PORTn, AMRCtrl, RealTime);
	AMRTaskManageCheckRelayTask(PORTn, AMRCtrl, RealTime);
	CheckNormalTasktoExecute(PORTn, AMRCtrl, RealTime);
	CheckRelayTasktoExecute(PORTn, AMRCtrl, RealTime);
	CheckAlarmTasktoExecute(PORTn, AMRCtrl, RealTime);
	if(AMRCtrl->AMR_ID == 0) return ERROR_NO_AMR_TASK;

	if((AMRCtrl->AMR_ID & (AMR_DAY_FREEZ_ID | AMR_DAY_FREEZ_PATCH_ID)) != 0)
	{
		AMRCtrl->LastDayFrozenTime.u8Second = RealTime->u8Second;
		AMRCtrl->LastDayFrozenTime.u8Minute = RealTime->u8Minute;
		AMRCtrl->LastDayFrozenTime.u8Hour   = RealTime->u8Hour;
		AMRCtrl->LastDayFrozenTime.u8Day    = RealTime->u8Day;
		AMRCtrl->LastDayFrozenTime.u8Month  = RealTime->u8Month;
		AMRCtrl->LastDayFrozenTime.u8Year   = RealTime->u8Year;
		AMRCtrl->LastDayFrozenTime.u8Week   = RealTime->u8Week;
		AMRCtrl->LastDayFrozenTime.u8Sync   = RealTime->u8Sync;
	}

	if((AMRCtrl->AMR_ID & AMR_HOUR_FREEZ_ID) != 0)
	{
		AMRCtrl->LastHourFrozenTime.u8Second = RealTime->u8Second;
		AMRCtrl->LastHourFrozenTime.u8Minute = RealTime->u8Minute;
		AMRCtrl->LastHourFrozenTime.u8Hour   = RealTime->u8Hour;
		AMRCtrl->LastHourFrozenTime.u8Day    = RealTime->u8Day;
		AMRCtrl->LastHourFrozenTime.u8Month  = RealTime->u8Month;
		AMRCtrl->LastHourFrozenTime.u8Year   = RealTime->u8Year;
		AMRCtrl->LastHourFrozenTime.u8Week   = RealTime->u8Week;
		AMRCtrl->LastHourFrozenTime.u8Sync   = RealTime->u8Sync;
	}

