gdgly/NUC97X_JS/STM32F4xx/CSG/QCSG_Task/CH_PLC_AMR_Task.c
	AMRCtrl->AMR_ID_Step = 0x0001;
	if(Get_NextAMR_ID(AMRCtrl) != NO_ERROR)
	{
		AMRCtrl->AMR_ID = 0;
		return ERROR_NO_AMR_TASK;
	}

	while(Get_NextMeter(PORTn, AMRCtrl) != NO_ERROR)
	{
		AMRCtrl->AMR_ID_Step <<= 1;
		if(Get_NextAMR_ID(AMRCtrl) != NO_ERROR)
		{
			return ERROR_NO_AMR_TASK;
		}
	}
	
	while(Get_NextAMR_NW_DI(AMRCtrl) != NO_ERROR)
	{
		AMRCtrl->MeterIndex++;
		while(Get_NextMeter(PORTn, AMRCtrl) != NO_ERROR)
		{
			AMRCtrl->AMR_ID_Step <<= 1;
			if(Get_NextAMR_ID(AMRCtrl) != NO_ERROR)
			{
				return ERROR_NO_AMR_TASK;
			}
		}
	}

	while(Get_NextAMR_645_DI(AMRCtrl) != NO_ERROR)
	{
		AMRCtrl->CurNW_DI_Step++;
		while(Get_NextAMR_NW_DI(AMRCtrl) != NO_ERROR)
		{
			AMRCtrl->MeterIndex++;
			while(Get_NextMeter(PORTn, AMRCtrl) != NO_ERROR)
			{
				AMRCtrl->AMR_ID_Step <<= 1;
				if(Get_NextAMR_ID(AMRCtrl) != NO_ERROR)
				{
					return ERROR_NO_AMR_TASK;
				}
			}
		}
	}
	
	AMRCtrl->TryCnt = 0;
	AMRCtrl->State = AMR_Tx;
	AMRCtrl->FailMeters = 0;
	AMRCtrl->SuccessMeters = 0;
	AMRCtrl->PLCTaskIDAckNum = 0;
	AMRCtrl->PLCTaskIDAddNum = 0;
	PLCManage->DataLenInDataBuf = 0;
	PLCManage->ReportDataLen = 0;
	pTerminalRouter->RouterInitTask = 0;
	pTerminalRouter->RetryCnt = 0;

	if((AMRCtrl->AMR_ID_Step & (AMR_DAY_FREEZ_ID | AMR_HOUR_FREEZ_ID)) != 0)
	{
		AMR_NUM_Display(PORTn, AMRCtrl->TotalMeters, AMRCtrl->SuccessMeters, AMRCtrl->FailMeters);
	}
	return NO_ERROR;
	
}


ResultEnum PLC_AMR_TxProcess(u32 PORTn, AMRCtrlStruct* AMRCtrl, PLCManageStruct* PLCManage)
{
	ResultEnum Result = NO_ERROR;
	switch(AMRCtrl->AMR_ID_Step)
	{
		case AMR_DAY_FREEZ_ID:
			Result = PLC_AMR_AddTaskProcess(PORTn, AMRCtrl, PLCManage);
			break;
		case AMR_DAY_FREEZ_PATCH_ID:
			Result = PLC_AMR_AddTaskProcess(PORTn, AMRCtrl, PLCManage);
			break;
		case AMR_HOUR_FREEZ_ID:
			Result = PLC_AMR_AddTaskProcess(PORTn, AMRCtrl, PLCManage);
			break;	
		case AMR_NORMAL_TASK_ID:
			Result = PLC_AMR_AddTaskProcess(PORTn, AMRCtrl, PLCManage);
			break;
		case AMR_RELAY_TASK_ID:
			Result = PLC_AMR_AddTaskProcess(PORTn, AMRCtrl, PLCManage);
			break;
		case AMR_ALARM_TASK_ID:
			Result = PLC_AMR_AddTaskProcess(PORTn, AMRCtrl, PLCManage);
			break;
		case AMR_EVENT_TASK_ID:
			AMRCtrl->State = AMR_Idle;
			AMRCtrl->AMR_ID = 0;
			break;
		default:
			AMRCtrl->State = AMR_Idle;
			AMRCtrl->AMR_ID = 0;
			break;
	}
	return Result;
}

ResultEnum PLC_AMR_AddTaskProcess(u32 PORTn, AMRCtrlStruct* AMRCtrl, PLCManageStruct* PLCManage)
{
	u16* pPortAckTimer;
	QCSGLocalFrameStruct LocalFrame;
	Terminal_Router_TypeDef* pTerminalRouter = Terminal_Router;
	ResultEnum Result = NO_ERROR;

	pPortAckTimer = (u16*)GetUartPortAckTimerAddr(PORTn);
	switch(pTerminalRouter->RouterInitTask)
	{
		case PLC_ADD_TASK_STOP_TASK:
			Result = PLC_AMR_ADD_TASK_TxStopTask(PORTn, PLCManage, &LocalFrame);
			break;
		case PLC_ADD_TASK_STOP_TASK_WAIT_ACK:
			if((PLCManage->Flag & PLC_FLAG_STOP_TASK_DONE) != 0)//模块回复确认处置上
			{// PLC  抄表，首先停止任务
				PLCManage->Flag &= ~PLC_FLAG_STOP_TASK_DONE;
				pPortAckTimer[0] = 0;
				pTerminalRouter->RouterInitTask++;
				pTerminalRouter->RetryCnt = 0;
			}
			else
			{
				if(pPortAckTimer[0] == 0)
				{// 超时，重发停止任务
					pTerminalRouter->RouterInitTask--;
				}
			}
			break;
		case PLC_ADD_TASK_REMAIN_TASK:
			Result = PLC_TxCheckRemainTask(PORTn, PLCManage, &LocalFrame);
			break;
		/*case PLC_ADD_TASK_REMAIN_TASK_WAIT_ACK:
			if((PLCManage->Flag & PLC_FLAG_INIT_TASK_DONE) != 0)
			{// PLC 抄表初始化任务完成
				PLCManage->Flag &= ~PLC_FLAG_INIT_TASK_DONE;
				pPortAckTimer[0] = 0;
				pTerminalRouter->RouterInitTask++;
				pTerminalRouter->RetryCnt = 0;
				//AMRCtrl->PLCTaskIDAckNum = 0;
				//AMRCtrl->PLCTaskIDAddNum = 0;
			}
			else
			{
				if(pPortAckTimer[0] == 0)
				{// 超时，重发初始化任务
					pTerminalRouter->RouterInitTask--;
				}
			}
			break;
*/
			
		case PLC_ADD_TASK_INIT:
			Result = PLC_TxInitTask(PORTn, PLCManage, &LocalFrame);
			break;
		case PLC_ADD_TASK_INIT_WAIT_ACK:
			if((PLCManage->Flag & PLC_FLAG_INIT_TASK_DONE) != 0)
			{// PLC 抄表初始化任务完成
				PLCManage->Flag &= ~PLC_FLAG_INIT_TASK_DONE;
				pPortAckTimer[0] = 0;
				pTerminalRouter->RouterInitTask++;
				pTerminalRouter->RetryCnt = 0;
				//AMRCtrl->PLCTaskIDAckNum = 0;
				//AMRCtrl->PLCTaskIDAddNum = 0;
			}
			else
			{
				if(pPortAckTimer[0] == 0)
				{// 超时，重发初始化任务
					pTerminalRouter->RouterInitTask--;
				}
			}
			break;
		case PLC_ADD_TASK_ADD_ONE:
			if(AMRCtrl->AMR_ID_Step == AMR_RELAY_TASK_ID)
			{
				Result = PLC_AMR_ADD_OneRelayTask(PORTn, AMRCtrl, PLCManage, &LocalFrame);
			}
			else
			{
				Result = PLC_AMR_ADD_OneTask(PORTn, AMRCtrl, PLCManage, &LocalFrame);
			}
			break;
		case PLC_ADD_TASK_ADD_ONE_WAIT_ACK:
			if((PLCManage->Flag & PLC_FLAG_ADD_ONE_TASK_DONE) != 0)
			{// PLC 单次添加任务完成，
				PLCManage->Flag &= ~PLC_FLAG_ADD_ONE_TASK_DONE;
				pPortAckTimer[0] = 0;
				if(AMRCtrl->AMR_ID_Step < AMR_NORMAL_TASK_ID)
				{
					PLCManage->AMR_Data[AMRCtrl->CurNW_DI_Step].NW_DI = AMRCtrl->CurNW_DI;
					PLCManage->AMR_Data[AMRCtrl->CurNW_DI_Step].TblIndex = AMRCtrl->CurNW_DI_TblIndex;
					PLCManage->AMR_Data[AMRCtrl->CurNW_DI_Step].DataLen = 0;				
					PLCManage->AMR_Data[AMRCtrl->CurNW_DI_Step].DI645Num++;
					PLCManage->AMR_Data[AMRCtrl->CurNW_DI_Step].TaskIDNum++;
					PLCManage->AMR_Data[AMRCtrl->CurNW_DI_Step].TaskIDList[AMRCtrl->Cur645_DI_Step] = AMRCtrl->PLCTaskIDAddNum;
				}
				else if(AMRCtrl->AMR_ID_Step == AMR_NORMAL_TASK_ID)
				{
					AMRCtrl->NormalTask->DataList[AMRCtrl->CurNW_DI_Step].NW_DI = AMRCtrl->CurNW_DI;
					AMRCtrl->NormalTask->DataList[AMRCtrl->CurNW_DI_Step].TblIndex = AMRCtrl->CurNW_DI_TblIndex;
					AMRCtrl->NormalTask->DataList[AMRCtrl->CurNW_DI_Step].DataLen = 0;
					AMRCtrl->NormalTask->DataList[AMRCtrl->CurNW_DI_Step].DI645Num++;
					AMRCtrl->NormalTask->DataList[AMRCtrl->CurNW_DI_Step].TaskIDNum++;
					AMRCtrl->NormalTask->DataList[AMRCtrl->CurNW_DI_Step].TaskIDList[AMRCtrl->Cur645_DI_Step] = AMRCtrl->PLCTaskIDAddNum;
				}
				/*else if(AMRCtrl->AMR_ID_Step == AMR_ALARM_TASK_ID)
				{
					//err20190220 修改载波抄表流程
					u8 Pos=0,Bit=0;
					Pos = AMRCtrl->PLCTaskIDAddNum >> 3;
					Bit = AMRCtrl->PLCTaskIDAddNum & 0x07;	
					AMRCtrl->PLCTaskIDFlagList[Pos] |= 1 << Bit;	
				}*/
				else
				{
				}
				
				AMRCtrl->PLCTaskIDAddNum++;
				Result = PLC_AMR_ADD_TASK_SwitchToNextTaskID(PORTn, AMRCtrl, PLCManage);
				if(Result == NO_ERROR)//还有数据项要抄，则返回上一步继续添加任务
				{
					pTerminalRouter->RouterInitTask--;
					pTerminalRouter->RetryCnt = 0;
				}
				else
				{
					pTerminalRouter->RouterInitTask++;
					pTerminalRouter->RetryCnt = 0;
				}
			}
			else
			{
				if(pPortAckTimer[0] == 0)
				{// 超时，重发添加任务
					pTerminalRouter->RouterInitTask--;
				}
			}
			break;
		case PLC_ADD_TASK_START_TASK:
			Result = PLC_AMR_ADD_TASK_TxStartTask(PORTn, PLCManage, &LocalFrame);
			break;
		case PLC_ADD_TASK_START_TASK_WAIT_ACK:
			if((PLCManage->Flag & PLC_FLAG_START_TASK_DONE) != 0)
			{// PLC 抄表启动任务完成，
				PLCManage->Flag &= ~PLC_FLAG_START_TASK_DONE;
				pPortAckTimer[0] = 0;
				pTerminalRouter->RouterInitTask++;
				pTerminalRouter->RetryCnt = 0;
			}
			else
			{
				if(pPortAckTimer[0] == 0)
				{// 超时，重发初始化任务
					pTerminalRouter->RouterInitTask--;
				}
			}
			break;
		case PLC_ADD_TASK_DONE:
			if(pPortAckTimer[0] == 0)
			{
				AMRCtrl->State = AMR_WaitRx;
				pTerminalRouter->RouterInitTask++;
				pTerminalRouter->RetryCnt = 0;
				pPortAckTimer[0] = PLCManage->AMRTimeOut;
				AMR_ADDR_Display(PORTn, AMRCtrl->Addr);
			}
			break;
		default:
			if(pPortAckTimer[0] == 0) pTerminalRouter->RouterInitTask++;	
			// 此处不将 pTerminalRouter->RouterInitTask 直接清 0，是因为切换抄表地址前刚刚向模块发送了
			// 最后一个任务数据上报的确认信息，需要等待确认信息发送完毕，若不进行此操作，则会因为添加
			// 任务的第一个步骤串口被占用，而设置超时时间为 3 S，时间比较长，浪费时间。
		break;
	}
	
	return Result;
}

ResultEnum PLC_AMR_ADD_TASK_TxStopTask(u32 PORTn, PLCManageStruct* PLCManage, QCSGLocalFrameStruct* LocalFrame)
{
	u32 FrameLen = 0, AddrTxBuf = 0;
	UartTxReqStruct UartTxReq;
	u16* pPortAckTimer;
	Terminal_Router_TypeDef* pTerminalRouter = Terminal_Router;

	pPortAckTimer = (u16*)GetUartPortAckTimerAddr(PORTn);
	if(pPortAckTimer[0] != 0) return ERROR_WRONG_TIME;
	
	if(pTerminalRouter->RetryCnt < PLC_CMD_MAX_CNT)
	{	
		MC(0, (u32)LocalFrame, sizeof(QCSGLocalFrameStruct));
		LocalFrame->FC = LOCAL_FRAME_PRM_BIT;
		LocalFrame->AFN = LOCAL_FRAME_AFN_02;//管理任务
		LocalFrame->SEQ = PLCManage->SEQ++;
		LocalFrame->DI = 0xE8020209;//暂停任务
		LocalFrame->DataLen = 0;

		AddrTxBuf = GetUartPortTxBuf(PORTn);
		FrameLen = BuildLocalModuleFrame((u8*)AddrTxBuf, LocalFrame);
		MC(0, (u32)&UartTxReq, sizeof(UartTxReqStruct));				
		UartTxReq.SrcTask = TASK_ID_PLC_AMR;
		UartTxReq.NeedAck = 1;
		UartTxReq.FrameType = FRAME_TYPE_QCSG_LOCAL;
		UartTxReq.RetryCnt = 0;
		UartTxReq.BpsCtrl = 0;
		UartTxReq.TimeOut = PLC_WAIT_ACK_TIME_OUT;
		UartTxReq.DataLen = FrameLen;
		UartTxReq.DataBuf = (u8*)AddrTxBuf;
		if(UartPortTxReqNew(PORTn, &UartTxReq) == NO_ERROR)
		{
			pTerminalRouter->RouterInitTask++;
			pTerminalRouter->RetryCnt++;
			pPortAckTimer[0] = PLC_WAIT_ACK_TIME_OUT;
		}	
	}
	else
	{
		PLCManage->State = PLC_RESET_INIT;
		pTerminalRouter->RouterResetCnt = 0;		
		pTerminalRouter->RouterInitTask = 0;
		pTerminalRouter->RetryCnt = 0;
	}	
	return NO_ERROR;
}

ResultEnum PLC_AMR_ADD_OneTask(u32 PORTn, AMRCtrlStruct* AMRCtrl, PLCManageStruct* PLCManage, QCSGLocalFrameStruct* LocalFrame)
{
	DLT645FrameStruct DLT645Frame;
	UartTxReqStruct UartTxReq;
	u16* pPortAckTimer;
	u32 FrameLen = 0, AddrTxBuf = 0;
	Terminal_Router_TypeDef* pTerminalRouter = Terminal_Router;

	pPortAckTimer = (u16*)GetUartPortAckTimerAddr(PORTn);
	if(pPortAckTimer[0] != 0) return ERROR_WRONG_TIME;
	
	if(pTerminalRouter->RetryCnt < PLC_CMD_MAX_CNT)
	{	
		MC(0, (u32)LocalFrame, sizeof(QCSGLocalFrameStruct));
		pPortAckTimer[0] = PLC_WAIT_ACK_TIME_OUT;
		LocalFrame->FC = LOCAL_FRAME_PRM_BIT | LOCAL_FRAME_ADR_BIT;
		MR((u32)LocalFrame->SrcAddr, (u32)PLCManage->TerminalAddr, METER_ADDR_SIZE);
		MR((u32)LocalFrame->DstAddr, (u32)AMRCtrl->Addr, METER_ADDR_SIZE);
		LocalFrame->AFN = LOCAL_FRAME_AFN_02;
		LocalFrame->SEQ = PLCManage->SEQ++;
		LocalFrame->DI = 0xE8020201;
		LocalFrame->DataLen = 0;
		LocalFrame->Data[LocalFrame->DataLen++] = AMRCtrl->PLCTaskIDAddNum;
		LocalFrame->Data[LocalFrame->DataLen++] = AMRCtrl->PLCTaskIDAddNum >> 8;
		LocalFrame->Data[LocalFrame->DataLen++] = PLC_TASK_LEVEL_3 | PLC_TASK_RESP_BIT;

		if(AMRCtrl->PMType == METER_TYPE_SINGLE)
		{
			PLCManage->AMRTimeOut = PLC_AMR_SIGLE_TIME_OUT;
		}
		else
		{
			PLCManage->AMRTimeOut = PLC_AMR_MULTI_TIME_OUT;
		}
		LocalFrame->Data[LocalFrame->DataLen++] = PLCManage->AMRTimeOut;
		LocalFrame->Data[LocalFrame->DataLen++] = PLCManage->AMRTimeOut >> 8;
		MC(0, (u32)&DLT645Frame, sizeof(DLT645FrameStruct));
		BuildMeterAMR645FrameStruct(&DLT645Frame, AMRCtrl);
		LocalFrame->Data[LocalFrame->DataLen] = Build645Frame(&DLT645Frame, &LocalFrame->Data[LocalFrame->DataLen + 1], NO_FE_IN_645);
		LocalFrame->DataLen += LocalFrame->Data[LocalFrame->DataLen] + 1;
		
		AddrTxBuf = GetUartPortTxBuf(PORTn);
		FrameLen = BuildLocalModuleFrame((u8*)AddrTxBuf, LocalFrame);
		MC(0, (u32)&UartTxReq, sizeof(UartTxReqStruct));				
		UartTxReq.SrcTask = TASK_ID_PLC_AMR;
		UartTxReq.NeedAck = 1;
		UartTxReq.FrameType = FRAME_TYPE_QCSG_LOCAL;
		UartTxReq.RetryCnt = 0;
		UartTxReq.BpsCtrl = 0;
		UartTxReq.TimeOut = PLC_WAIT_ACK_TIME_OUT;
		UartTxReq.DataLen = FrameLen;
		UartTxReq.DataBuf = (u8*)AddrTxBuf;
		if(UartPortTxReqNew(PORTn, &UartTxReq) == NO_ERROR)
		{
			pTerminalRouter->RouterInitTask++;
			pTerminalRouter->RetryCnt++;
		}	
	}
	else
	{
		PLCManage->State = PLC_RESET_INIT;
		pTerminalRouter->RouterResetCnt = 0;		
		pTerminalRouter->RouterInitTask = 0;
		pTerminalRouter->RetryCnt = 0;
	}	
	return NO_ERROR;
}

