gdgly/NUC97X_JS/STM32F4xx/CSG/QCSG_Task/CH_PLC_AMR_Task.c
ResultEnum PLC_AMR_ADD_TASK_SwitchToNextTaskID(u32 PORTn, AMRCtrlStruct* AMRCtrl, PLCManageStruct* PLCManage)
{
	AMRCtrl->Cur645_DI_Step++;
	if(Get_NextAMR_645_DI(AMRCtrl) == NO_ERROR) return NO_ERROR;

	AMRCtrl->CurNW_DI_Step++;
	while(Get_NextAMR_NW_DI(AMRCtrl) == NO_ERROR)
	{
		if(Get_NextAMR_645_DI(AMRCtrl) == NO_ERROR)
		{
			return NO_ERROR;
		}
		AMRCtrl->CurNW_DI_Step++;
	}

	return ERROR_WRONG_ACCESS;
}

ResultEnum PLC_AMR_ADD_TASK_TxStartTask(u32 PORTn, PLCManageStruct* PLCManage, QCSGLocalFrameStruct* LocalFrame)
{
	u32 FrameLen = 0, AddrTxBuf = 0;
	UartTxReqStruct UartTxReq;
	u16* pPortAckTimer;
	Terminal_Router_TypeDef* pTerminalRouter = Terminal_Router;

	pPortAckTimer = (u16*)GetUartPortAckTimerAddr(PORTn);
	if(pPortAckTimer[0] != 0) return ERROR_WRONG_TIME;
	
	if(pTerminalRouter->RetryCnt < PLC_CMD_MAX_CNT)
	{	
		MC(0, (u32)LocalFrame, sizeof(QCSGLocalFrameStruct));
		pPortAckTimer[0] = PLC_WAIT_ACK_TIME_OUT;
		LocalFrame->FC = LOCAL_FRAME_PRM_BIT;
		LocalFrame->AFN = LOCAL_FRAME_AFN_02;
		LocalFrame->SEQ = PLCManage->SEQ++;
		LocalFrame->DI = 0xE8020208;
		LocalFrame->DataLen = 0;

		AddrTxBuf = GetUartPortTxBuf(PORTn);
		FrameLen = BuildLocalModuleFrame((u8*)AddrTxBuf, LocalFrame);
		MC(0, (u32)&UartTxReq, sizeof(UartTxReqStruct));				
		UartTxReq.SrcTask = TASK_ID_PLC_AMR;
		UartTxReq.NeedAck = 1;
		UartTxReq.FrameType = FRAME_TYPE_QCSG_LOCAL;
		UartTxReq.RetryCnt = 0;
		UartTxReq.BpsCtrl = 0;
		UartTxReq.TimeOut = PLC_WAIT_ACK_TIME_OUT;
		UartTxReq.DataLen = FrameLen;
		UartTxReq.DataBuf = (u8*)AddrTxBuf;
		if(UartPortTxReqNew(PORTn, &UartTxReq) == NO_ERROR)
		{
			pTerminalRouter->RouterInitTask++;
			pTerminalRouter->RetryCnt++;
		}	
	}
	else
	{
		PLCManage->State = PLC_RESET_INIT;
		pTerminalRouter->RouterResetCnt = 0;		
		pTerminalRouter->RouterInitTask = 0;
		pTerminalRouter->RetryCnt = 0;
	}	
	return NO_ERROR;
}

/*
ResultEnum PLC_AMR_ADD_OneNormalTask(u32 PORTn, AMRCtrlStruct* AMRCtrl, PLCManageStruct* PLCManage, QCSGLocalFrameStruct* LocalFrame)
{
	DLT645FrameStruct DLT645Frame;
	UartTxReqStruct UartTxReq;
	u16* pPortAckTimer;
	u32 FrameLen = 0, AddrTxBuf = 0;
	Terminal_Router_TypeDef* pTerminalRouter = Terminal_Router;

	pPortAckTimer = (u16*)GetUartPortAckTimerAddr(PORTn);
	if(pPortAckTimer[0] != 0) return ERROR_WRONG_TIME;
	
	if(pTerminalRouter->RetryCnt < PLC_CMD_MAX_CNT)
	{	
		MC(0, (u32)LocalFrame, sizeof(QCSGLocalFrameStruct));
		pPortAckTimer[0] = PLC_WAIT_ACK_TIME_OUT;
		LocalFrame->FC = LOCAL_FRAME_PRM_BIT | LOCAL_FRAME_ADR_BIT;
		MR((u32)LocalFrame->SrcAddr, (u32)PLCManage->TerminalAddr, METER_ADDR_SIZE);
		MR((u32)LocalFrame->DstAddr, (u32)AMRCtrl->Addr, METER_ADDR_SIZE);
		LocalFrame->AFN = LOCAL_FRAME_AFN_02;
		LocalFrame->SEQ = PLCManage->SEQ++;
		LocalFrame->DI = 0xE8020201;
		LocalFrame->DataLen = 0;
		LocalFrame->Data[LocalFrame->DataLen++] = AMRCtrl->PLCTaskIDAddNum;
		LocalFrame->Data[LocalFrame->DataLen++] = AMRCtrl->PLCTaskIDAddNum >> 8;
		LocalFrame->Data[LocalFrame->DataLen++] = PLC_TASK_LEVEL_3 | PLC_TASK_RESP_BIT;

		if(AMRCtrl->PMType == METER_TYPE_SINGLE)
		{
			PLCManage->AMRTimeOut = PLC_AMR_SIGLE_TIME_OUT;
		}
		else
		{
			PLCManage->AMRTimeOut = PLC_AMR_MULTI_TIME_OUT;
		}
		LocalFrame->Data[LocalFrame->DataLen++] = PLCManage->AMRTimeOut;
		LocalFrame->Data[LocalFrame->DataLen++] = PLCManage->AMRTimeOut >> 8;
		MC(0, (u32)&DLT645Frame, sizeof(DLT645FrameStruct));
		BuildMeterAMR645FrameStruct(&DLT645Frame, AMRCtrl);
		LocalFrame->Data[LocalFrame->DataLen] = Build645Frame(&DLT645Frame, &LocalFrame->Data[LocalFrame->DataLen + 1], NO_FE_IN_645);
		LocalFrame->DataLen += LocalFrame->Data[LocalFrame->DataLen] + 1;	
		
		AddrTxBuf = GetUartPortTxBuf(PORTn);
		FrameLen = BuildLocalModuleFrame((u8*)AddrTxBuf, LocalFrame);
		MC(0, (u32)&UartTxReq, sizeof(UartTxReqStruct));				
		UartTxReq.SrcTask = TASK_ID_PLC_AMR;
		UartTxReq.NeedAck = 1;
		UartTxReq.FrameType = FRAME_TYPE_QCSG_LOCAL;
		UartTxReq.RetryCnt = 0;
		UartTxReq.BpsCtrl = 0;
		UartTxReq.TimeOut = PLC_WAIT_ACK_TIME_OUT;
		UartTxReq.DataLen = FrameLen;
		UartTxReq.DataBuf = (u8*)AddrTxBuf;
		if(UartPortTxReqNew(PORTn, &UartTxReq) == NO_ERROR)
		{
			pTerminalRouter->RouterInitTask++;
			pTerminalRouter->RetryCnt++;
		}	
	}
	else
	{
		PLCManage->State = PLC_RESET_INIT;
		pTerminalRouter->RouterResetCnt = 0;		
		pTerminalRouter->RouterInitTask = 0;
		pTerminalRouter->RetryCnt = 0;
	}	
	return NO_ERROR;
}
*/

ResultEnum PLC_AMR_ADD_OneRelayTask(u32 PORTn, AMRCtrlStruct* AMRCtrl, PLCManageStruct* PLCManage, QCSGLocalFrameStruct* LocalFrame)
{
	UartTxReqStruct UartTxReq;
	RelayTaskParaStruct RelayTaskPara;
	u16* pPortAckTimer;
	u32 FrameLen = 0, AddrTxBuf = 0, CurTaskID = 0, Addr = 0;
	Terminal_Router_TypeDef* pTerminalRouter = Terminal_Router;

	pPortAckTimer = (u16*)GetUartPortAckTimerAddr(PORTn);
	if(pPortAckTimer[0] != 0) return ERROR_WRONG_TIME;
	
	if(pTerminalRouter->RetryCnt < PLC_CMD_MAX_CNT)
	{	
		MC(0, (u32)LocalFrame, sizeof(QCSGLocalFrameStruct));		
		MC(0, (u32)&RelayTaskPara, sizeof(RelayTaskParaStruct));
		
		CurTaskID = AMRCtrl->RelayTask->CurTaskID;
		Addr = ADDR_RelayTaskPara + CurTaskID*sizeof(RelayTaskParaStruct);
		MR((u32)&RelayTaskPara, Addr, sizeof(RelayTaskParaStruct));

		for(Addr = 0; Addr < RelayTaskPara.Length; Addr++)
		{
			if(RelayTaskPara.Frame[Addr] == DLT_645_HEAD) break;
		}

		MR((u32)AMRCtrl->Addr, (u32)&RelayTaskPara.Frame[Addr + 1], METER_ADDR_SIZE);
		PLCManage->AMRTimeOut = PLC_AMR_MULTI_TIME_OUT;
		pPortAckTimer[0] = PLC_WAIT_ACK_TIME_OUT;
		LocalFrame->FC = LOCAL_FRAME_PRM_BIT | LOCAL_FRAME_ADR_BIT;
		MR((u32)LocalFrame->SrcAddr, (u32)PLCManage->TerminalAddr, METER_ADDR_SIZE);
		MR((u32)LocalFrame->DstAddr, (u32)AMRCtrl->Addr, METER_ADDR_SIZE);
		LocalFrame->AFN = LOCAL_FRAME_AFN_02;
		LocalFrame->SEQ = PLCManage->SEQ++;
		LocalFrame->DI = 0xE8020201;
		LocalFrame->DataLen = 0;
		LocalFrame->Data[LocalFrame->DataLen++] = AMRCtrl->PLCTaskIDAddNum;
		LocalFrame->Data[LocalFrame->DataLen++] = AMRCtrl->PLCTaskIDAddNum >> 8;
		LocalFrame->Data[LocalFrame->DataLen++] = PLC_TASK_LEVEL_3 | PLC_TASK_RESP_BIT;
		LocalFrame->Data[LocalFrame->DataLen++] = PLCManage->AMRTimeOut;
		LocalFrame->Data[LocalFrame->DataLen++] = PLCManage->AMRTimeOut >> 8;
		LocalFrame->Data[LocalFrame->DataLen++] = RelayTaskPara.Length;
		MR((u32)&LocalFrame->Data[LocalFrame->DataLen], (u32)RelayTaskPara.Frame, RelayTaskPara.Length);
		LocalFrame->DataLen += RelayTaskPara.Length;	
		
		AddrTxBuf = GetUartPortTxBuf(PORTn);
		FrameLen = BuildLocalModuleFrame((u8*)AddrTxBuf, LocalFrame);
		MC(0, (u32)&UartTxReq, sizeof(UartTxReqStruct));				
		UartTxReq.SrcTask = TASK_ID_PLC_AMR;
		UartTxReq.NeedAck = 1;
		UartTxReq.FrameType = FRAME_TYPE_QCSG_LOCAL;
		UartTxReq.RetryCnt = 0;
		UartTxReq.BpsCtrl = 0;
		UartTxReq.TimeOut = PLC_WAIT_ACK_TIME_OUT;
		UartTxReq.DataLen = FrameLen;
		UartTxReq.DataBuf = (u8*)AddrTxBuf;
		if(UartPortTxReqNew(PORTn, &UartTxReq) == NO_ERROR)
		{
			pTerminalRouter->RouterInitTask++;
			pTerminalRouter->RetryCnt++;
		}	
	}
	else
	{
		PLCManage->State = PLC_RESET_INIT;
		pTerminalRouter->RouterResetCnt = 0;		
		pTerminalRouter->RouterInitTask = 0;
		pTerminalRouter->RetryCnt = 0;
	}	
	return NO_ERROR;
}

ResultEnum PLC_AMR_WaitRxProcess(u32 PORTn, AMRCtrlStruct* AMRCtrl, PLCManageStruct* PLCManage)
{
	DLT645FrameStruct DLT645Frame;
	u16* pAckTimer;
	ResultEnum Result = NO_ERROR;
	u8* DataBuf = 0; 
	
	pAckTimer = (u16*)GetUartPortAckTimerAddr(PORTn);
	if(pAckTimer[0] == 0)
	{
		Result = PLC_AMR_RxTimeOutProcess(PORTn, AMRCtrl, PLCManage);
		return Result;
	}

	if(PLCManage->DataLenInDataBuf == 0) return ERROR_WRONG_LENGTH;

	DataBuf = (u8*)Get_AMR_CH_DataBufAddr(PORTn);
	if(DataBuf == NULL) return ERROR_POINTER_NULL;

