gdgly/NUC97X_JS/STM32F4xx/CSG/QCSG_Task/CH_PLC_AMR_Task.c
	//err20190221 测试屏蔽后是否周期抄表时切换表还要很久
	
//pAckTimer[0] = PLCManage->AMRTimeOut;	//周期抄表超时100s
	Result = DLT645FrameDcompress(&DLT645Frame, DataBuf, PLCManage->DataLenInDataBuf);
	PLCManage->DataLenInDataBuf = 0;
	if(Result != NO_ERROR) return Result;
	
	switch(AMRCtrl->AMR_ID_Step)
	{
		case AMR_DAY_FREEZ_ID:
			Result = PLC_AMR_RxDayFreezProcess(PORTn, AMRCtrl, &DLT645Frame, PLCManage);
			break;
		case AMR_DAY_FREEZ_PATCH_ID:
			Result = PLC_AMR_RxDayFreezProcess(PORTn, AMRCtrl, &DLT645Frame, PLCManage);
			break;
		case AMR_HOUR_FREEZ_ID:
			Result = PLC_AMR_RxHourFreezProcess(PORTn, AMRCtrl, &DLT645Frame, PLCManage);
			break;
		case AMR_NORMAL_TASK_ID:
			Result = PLC_AMR_RxNormalTaskProcess(PORTn, AMRCtrl, &DLT645Frame, PLCManage);
			break;
		case AMR_RELAY_TASK_ID:
			Result = PLC_AMR_RxRelayTaskProcess(PORTn, AMRCtrl, &DLT645Frame, PLCManage);
			break;
		case AMR_ALARM_TASK_ID:
			Result = PLC_AMR_RxAlarmTaskProcess(PORTn, AMRCtrl, &DLT645Frame, PLCManage);
			break;
		case AMR_EVENT_TASK_ID:
			AMRCtrl->State = AMR_Idle;
			AMRCtrl->AMR_ID = 0;
			break;
		default:
			AMRCtrl->State = AMR_Idle;
			AMRCtrl->AMR_ID = 0;
			break;
	}
	return Result;
}


ResultEnum PLC_AMR_RxTimeOutProcess(u32 PORTn, AMRCtrlStruct* AMRCtrl, PLCManageStruct* PLCManage)
{
	RealTimeYYStruct YYTime;
	ResultEnum Result = NO_ERROR;
	u8* AMRDataBuf = NULL;
	u8 NW_DI_Num = 0;
	u16 Index = 0, OffSet = 0;
	u32 DIDataLenPos = 0;
	Terminal_Router_TypeDef* pTerminalRouter = Terminal_Router;
	NodeListStruct* NodeList = (NodeListStruct*)ADDR_NodeList;
	MeterFileInfoStruct* MeterFileInfo = (MeterFileInfoStruct*)ADDR_MeterFileInfo;
	u8* DayFreezFailMeterList = (u8*)ADDR_MeterDayFreezFailList;

	///////////////////////////ybwhz测试///////////////////////////////
	if(YBWHZ_TEST)
	{
		u8 *p8;
		u8 count = 0;
		MC(0, ADDR_YBWHZ_DATABUFF, 64); 
		p8=(u8*)(ADDR_YBWHZ_DATABUFF);
		p8[count++] = 'R';
		p8[count++] = 'x';
		p8[count++] = 'T';
		p8[count++] = 'i';
		p8[count++] = 'm';
		p8[count++] = 'e';
		p8[count++] = 'O';
		p8[count++] = 'u';
		p8[count++] = 't';
		p8[count++] = ':';
		switch(AMRCtrl->AMR_ID_Step)
		{
			case AMR_DAY_FREEZ_ID:
				p8[count++] = 'D';
				p8[count++] = 'A';
				p8[count++] = 'Y';
				break;
			case AMR_DAY_FREEZ_PATCH_ID:
				p8[count++] = 'D';
				p8[count++] = 'A';
				p8[count++] = 'P';
				break;
			case AMR_HOUR_FREEZ_ID:
				p8[count++] = 'C';
				p8[count++] = 'U';
				p8[count++] = 'V';
				break;
			case AMR_ALARM_TASK_ID:
				p8[count++] = 'A';
				p8[count++] = 'M';
				p8[count++] = 'R';
				break;
			default: 
				p8[count++] = 'O';
				p8[count++] = 'T';
				p8[count++] = 'H';
				break;
		}
		p8[count++] = '#';

		QCSG_LogToRS232Port((u32)PORTn,ADDR_YBWHZ_DATABUFF,count);
	}
	////////////////////////////ybwhz测试/////////////////////////////



	
	if(AMRCtrl->AMR_ID_Step == AMR_DAY_FREEZ_ID)
	{// 记录日冻结抄表失败，保存到抄表失败列表等待下次整点补抄
		OffSet = LEN_ListForOneMeter * MeterFileInfo->AMRDayFreezFailMeters;
		DayFreezFailMeterList[OffSet++] = AMRCtrl->Addr[0];
		DayFreezFailMeterList[OffSet++] = AMRCtrl->Addr[1];
		DayFreezFailMeterList[OffSet++] = AMRCtrl->Addr[2];
		DayFreezFailMeterList[OffSet++] = AMRCtrl->Addr[3];
		DayFreezFailMeterList[OffSet++] = AMRCtrl->Addr[4];
		DayFreezFailMeterList[OffSet++] = AMRCtrl->Addr[5];
		AMRCtrl->DayFreezFailMeters++;
		MeterFileInfo->AMRDayFreezFailMeters++;

		if(AMRCtrl->LastDayFrozenTime.u8Day == 0x01)
		{// 记录日冻结抄表失败，保存到月冻结抄表失败列表等待下次整点补抄
			AMRCtrl->MonthFreezFailMeters++;
			MeterFileInfo->AMRMonthFreezFailMeters++;
		}
		NodeList[AMRCtrl->MeterIndex].FailCnt++;

		//err20190214 多个表抄表失败一次只上报一条
		if(AMRCtrl->DayFreezOkMeters + AMRCtrl->DayFreezFailMeters == AMRCtrl->TotalMeters)
			GenerateMeterAMRFailAlarm_E200003D(AMRCtrl->MeterIndex);
		//GenerateMeterAMRFailAlarm_E200003D(AMRCtrl->MeterIndex);
	}
	
	AMRDataBuf = (u8*)Get_AMR_CH_DataBufAddr(PORTn);
	if((AMRCtrl->AMR_ID_Step == AMR_HOUR_FREEZ_ID) && (AMRDataBuf != NULL))
	{
		for(NW_DI_Num = 0; NW_DI_Num < AMRCtrl->HourFreezNwDINum; NW_DI_Num++)
		{
			if(PLCManage->AMR_Data[NW_DI_Num].DataLen == 0) continue;
			//Index = FindNwDIFrom_AFN0C_0D_Tbl(PLCManage->PLC_AMR_Data[NW_DI_Num].NW_DI);
			Index = PLCManage->AMR_Data[NW_DI_Num].TblIndex;
			if(Index >= MAX_AFN0C_0D_IDENT_NUM) continue;
			
			AMRDataBuf[AMRCtrl->AMRTotalDataLen++] = PLCManage->AMR_Data[NW_DI_Num].NW_DI;
			AMRDataBuf[AMRCtrl->AMRTotalDataLen++] = PLCManage->AMR_Data[NW_DI_Num].NW_DI >> 8;
			AMRDataBuf[AMRCtrl->AMRTotalDataLen++] = PLCManage->AMR_Data[NW_DI_Num].NW_DI >> 16;
			AMRDataBuf[AMRCtrl->AMRTotalDataLen++] = PLCManage->AMR_Data[NW_DI_Num].NW_DI >> 24;
			DIDataLenPos = AMRCtrl->AMRTotalDataLen;
			AMRDataBuf[AMRCtrl->AMRTotalDataLen++] = 0;
			AMRDataBuf[AMRCtrl->AMRTotalDataLen++] = 0;
			MR((u32)&AMRDataBuf[AMRCtrl->AMRTotalDataLen], (u32)PLCManage->AMR_Data[NW_DI_Num].Data, PLCManage->AMR_Data[NW_DI_Num].DataLen);
			AMRCtrl->AMRTotalDataLen += PLCManage->AMR_Data[NW_DI_Num].DataLen;

			if((PLCManage->AMR_Data[NW_DI_Num].NW_DI == 0x0201FF00) || (PLCManage->AMR_Data[NW_DI_Num].NW_DI == 0x0202FF00))
			{
				Index = gc_stQCSGAFN0C_0D_DLT645_Table[AMRCtrl->CurNW_DI_TblIndex].u16Dlen;
				for(; PLCManage->AMR_Data[NW_DI_Num].DataLen < Index; PLCManage->AMR_Data[NW_DI_Num].DataLen++)
				{
					AMRDataBuf[AMRCtrl->AMRTotalDataLen++] = 0xFF;
				}
			}
			AMRDataBuf[DIDataLenPos]     = PLCManage->AMR_Data[NW_DI_Num].DataLen;
			AMRDataBuf[DIDataLenPos + 1] = PLCManage->AMR_Data[NW_DI_Num].DataLen >> 8;
		}
		
		if(AMRCtrl->AMRTotalDataLen != 0)
		{
			RealTimeToYYTime(&AMRCtrl->LastHourFrozenTime, &YYTime);
			YYTime.Minute = 0;
			YYTime.Ack = 0;
			YYTime.Report = 0;
			NAND_WriteMeterAMRData(AMR_CurveFreeze, AMRCtrl->Addr, AMRCtrl->PMType, AMRCtrl->CurNW_DI, &YYTime, (u8*)AMRDataBuf, &AMRCtrl->AMRTotalDataLen);
		}
		else
		{
			AMRCtrl->HourFreezFailMeters++;
		}
	}

	if((AMRCtrl->AMR_ID_Step == AMR_NORMAL_TASK_ID) && (AMRDataBuf != NULL))
	{
		StoreNormalTaskAMRData(PORTn, AMRCtrl);
	}

	Result = AMR_SwitchToNextMeter(PORTn, AMRCtrl);
	if(Result == NO_ERROR)
	{
		AMRCtrl->State = AMR_Tx;
		pTerminalRouter->RouterInitTask = PLC_ADD_TASK_DONE + 1;
		SwitchMeterClearAMRInfo(AMRCtrl);
		MC(0, (u32)PLCManage->AMR_Data, sizeof(NwDIAMRDataStruct) * SIZE_12);
	}
	else if(Result == ERROR_NO_AMR_TASK)
	{
		AMRCtrl->State = AMR_Idle;
		AMRCtrl->AMR_ID = 0;
		WarningCancel(PORTn);

