gdgly/NUC97X_JS/STM32F4xx/CSG/QCSG_Task/CH_PLC_AMR_Task.c
		#if(TEST_ON == 1)
			MeterFileInfo->PLCMeterSyncFlag = METER_FILE_SYNC_TO_PLC_FLAG;
		#endif
	}
	else
	{

	}
	
	return Result;
}

ResultEnum PLC_AMR_RxDayFreezProcess(u32 PORTn, AMRCtrlStruct* AMRCtrl, DLT645FrameStruct* Frame, PLCManageStruct* PLCManage)
{
	u16* pAckTimer; 
	RealTimeYYStruct YYTime;
	RealTimeStruct RealTime;
	AMRFileHeadStruct FileHead;
	ResultEnum Result = NO_ERROR;
	u8 DI_Size = 0, NW_DI_Num = 0;
	u16 Index = 0, OffSet = 0, TaskIDNum = 0, DataLen = 0;
	u32 Cur645_DI = 0;
	u8* AMRDataBuf = NULL;
	u8* PnData = (u8*)(ADDR_DATABUFF);
	Terminal_Router_TypeDef* pTerminalRouter = Terminal_Router;
	NodeListStruct* NodeList = (NodeListStruct*)ADDR_NodeList;
	//MeterFileInfoStruct* MeterFileInfo = (MeterFileInfoStruct*)ADDR_MeterFileInfo;
	u8* DayFreezFailMeterList = (u8*)ADDR_MeterDayFreezFailList;	

	if(MemCompare(Frame->Addr, AMRCtrl->Addr, METER_ADDR_SIZE) != 0) return ERROR_WRONG_ADDR;
	if(GetProtocolTypeByCtrlCode(Frame->CtrlCode & DLT_645_CODE_MASK) != AMRCtrl->Protocol) return ERROR_InvalidData;
	if((Frame->CtrlCode & DLT_645_ERROR_BIT) == 0)//从站正确应答
	{
		Cur645_DI = Get645FrameDataID(Frame, AMRCtrl->Protocol);
		for(NW_DI_Num = 0; NW_DI_Num < AMRCtrl->DayFreezNwDINum; NW_DI_Num++)
		{
			//Index = FindNwDIFrom_AFN0D_Tbl(PLCManage->AMR_Data[NW_DI_Num].NW_DI);
			Index = PLCManage->AMR_Data[NW_DI_Num].TblIndex;
			if(Index >= MAX_AFN0C_0D_IDENT_NUM) continue;
			AMRCtrl->CurNW_DI_TblIndex = Index;
			AMRCtrl->Cur645_DI_Step = 0;
			while(Get_NextAMR_645_DI(AMRCtrl) == NO_ERROR)
			{
				if(Cur645_DI == AMRCtrl->Cur645_DI) break;
				AMRCtrl->Cur645_DI_Step++;
			}
			if(Cur645_DI == AMRCtrl->Cur645_DI) break;	
		}
		if(NW_DI_Num >= AMRCtrl->DayFreezNwDINum) return ERROR_InvalidData;//数据项不在表格内

		DI_Size = DLT_645_07_ID_SIZE;
		if(AMRCtrl->Protocol == DLT_645_PROTOCOL_97)
		{
			DI_Size = DLT_645_97_ID_SIZE;
		}
		if(Frame->DataLen > DI_Size)
		{
			DataLen = Frame->DataLen - DI_Size;
			Index = PLCManage->AMR_Data[NW_DI_Num].DataLen;
			MR((u32)&PLCManage->AMR_Data[NW_DI_Num].Data[Index], (u32)&Frame->Data[DI_Size], DataLen);
			PLCManage->AMR_Data[NW_DI_Num].DataLen += DataLen;
		}
	}
	else //if((Frame->CtrlCode & DLT_645_ERROR_BIT) != 0)
	{	
		for(NW_DI_Num = 0; NW_DI_Num < AMRCtrl->DayFreezNwDINum; NW_DI_Num++)
		{
			OffSet = 0;
			Index = PLCManage->AMR_Data[NW_DI_Num].TblIndex;
			if(Index >= MAX_AFN0C_0D_IDENT_NUM) continue;
			for(TaskIDNum = 0; TaskIDNum < PLCManage->AMR_Data[NW_DI_Num].TaskIDNum; TaskIDNum++)
			{
				if(PLCManage->ReportTaskID == PLCManage->AMR_Data[NW_DI_Num].TaskIDList[TaskIDNum])
				{
					if(AMRCtrl->Protocol == DLT_645_PROTOCOL_97)
					{
						DataLen = gc_stQCSGAFN0C_0D_DLT645_Table[Index].stDLT64597Resolve[TaskIDNum].u8BlDataLen;
					}
					else
					{
						DataLen = gc_stQCSGAFN0C_0D_DLT645_Table[Index].stDLT64507Resolve[TaskIDNum].u8BlDataLen;
					}
					break;
				}
				if(AMRCtrl->Protocol == DLT_645_PROTOCOL_97)
				{
					OffSet += gc_stQCSGAFN0C_0D_DLT645_Table[Index].stDLT64597Resolve[TaskIDNum].u8BlDataLen;
				}
				else
				{
					OffSet += gc_stQCSGAFN0C_0D_DLT645_Table[Index].stDLT64507Resolve[TaskIDNum].u8BlDataLen;
				}
			}
			if(TaskIDNum < PLCManage->AMR_Data[NW_DI_Num].TaskIDNum) break;
		}
		if(NW_DI_Num >= AMRCtrl->DayFreezNwDINum) return ERROR_InvalidData;
		
		MC(0xFF, (u32)&PLCManage->AMR_Data[NW_DI_Num].Data[OffSet], DataLen);
		if((OffSet + DataLen) >= PLCManage->AMR_Data[NW_DI_Num].DataLen)
		{
			PLCManage->AMR_Data[NW_DI_Num].DataLen = OffSet + DataLen;
		}
	}

	AMRCtrl->PLCTaskIDAckNum++;
	///////////////////////////ybwhz测试///////////////////////////////
	if(YBWHZ_TEST)
	{
		u8 *p8;
		u8 count = 0;
		MC(0, ADDR_YBWHZ_DATABUFF, 64);	
		p8=(u8*)(ADDR_YBWHZ_DATABUFF);
		p8[count++] = 'D';
		p8[count++] = 'A';
		p8[count++] = 'Y';
		p8[count++] = ':';
		
		p8[count++] = AMRCtrl->MeterIndex/10%10 +'0';
		p8[count++] = AMRCtrl->MeterIndex/1%10 +'0';
		p8[count++] = '*';
		p8[count++] = AMRCtrl->PLCTaskIDAckNum/10%10 +'0';
		p8[count++] = AMRCtrl->PLCTaskIDAckNum/1%10 +'0';
		p8[count++] = '/';
		p8[count++] = AMRCtrl->PLCTaskIDAddNum/10%10 +'0';
		p8[count++] = AMRCtrl->PLCTaskIDAddNum/1%10 +'0';
		p8[count++] = ' ';

		p8[count++] = PLCManage->ReportTaskID/10%10 +'0';
		p8[count++] = PLCManage->ReportTaskID/1%10 +'0';
		p8[count++] = '#';


		QCSG_LogToRS232Port((u32)PORTn,ADDR_YBWHZ_DATABUFF,count);
	}
////////////////////////////ybwhz测试/////////////////////////////
	if(AMRCtrl->PLCTaskIDAckNum < AMRCtrl->PLCTaskIDAddNum) return ERROR_WRONG_LENGTH;
	if(AMRCtrl->AMR_ID_Step == AMR_DAY_FREEZ_ID)
	{
		AMRCtrl->DayFreezOkMeters++;
		AMRCtrl->SuccessMeters++;
		NodeList[AMRCtrl->MeterIndex].FailCnt = 0;
		AMR_NUM_Display(PORTn, AMRCtrl->TotalMeters, AMRCtrl->SuccessMeters, AMRCtrl->FailMeters);
		//err20190214 多个表抄表失败一次只上报一条
		if(AMRCtrl->DayFreezOkMeters + AMRCtrl->DayFreezFailMeters == AMRCtrl->TotalMeters)
			GenerateMeterAMRFailAlarm_E200003D(AMRCtrl->MeterIndex);
	}
	
	AMRDataBuf = (u8*)Get_AMR_CH_DataBufAddr(PORTn);
	if(AMRDataBuf == NULL) return ERROR_POINTER_NULL;
	
	for(NW_DI_Num = 0; NW_DI_Num < AMRCtrl->DayFreezNwDINum; NW_DI_Num++)
	{
		if(PLCManage->AMR_Data[NW_DI_Num].DataLen == 0) continue;
		//Index = FindNwDIFrom_AFN0D_Tbl(PLCManage->PLC_AMR_Data[NW_DI_Num].NW_DI);
		Index = PLCManage->AMR_Data[NW_DI_Num].TblIndex;
		if(Index >= MAX_AFN0C_0D_IDENT_NUM) continue;
		
		AMRDataBuf[AMRCtrl->AMRTotalDataLen++] = PLCManage->AMR_Data[NW_DI_Num].NW_DI;
		AMRDataBuf[AMRCtrl->AMRTotalDataLen++] = PLCManage->AMR_Data[NW_DI_Num].NW_DI >> 8;
		AMRDataBuf[AMRCtrl->AMRTotalDataLen++] = PLCManage->AMR_Data[NW_DI_Num].NW_DI >> 16;
		AMRDataBuf[AMRCtrl->AMRTotalDataLen++] = PLCManage->AMR_Data[NW_DI_Num].NW_DI >> 24;
		AMRDataBuf[AMRCtrl->AMRTotalDataLen++] = PLCManage->AMR_Data[NW_DI_Num].DataLen;
		AMRDataBuf[AMRCtrl->AMRTotalDataLen++] = PLCManage->AMR_Data[NW_DI_Num].DataLen >> 8;
		MR((u32)&AMRDataBuf[AMRCtrl->AMRTotalDataLen], (u32)PLCManage->AMR_Data[NW_DI_Num].Data, PLCManage->AMR_Data[NW_DI_Num].DataLen);
		AMRCtrl->AMRTotalDataLen += PLCManage->AMR_Data[NW_DI_Num].DataLen;
		
		if((AMRCtrl->PMType == METER_TYPE_MULTI) && (NW_DI_Num == (METER_DAY_M_DI_NUM - 1)) && (AMRCtrl->AMRTotalDataLen != 0))
		{
			HAL_GetSystemTime(&RealTime);
			RealTimeToYYTime(&RealTime, &YYTime);
			//RealTimeToYYTime(&AMRCtrl->LastDayFrozenTime, &YYTime);
			YYTime.Ack = 0;
			YYTime.Report = 0;
			NAND_WriteMeterAMRData(AMR_DailyFreeze, AMRCtrl->Addr, AMRCtrl->PMType, AMRCtrl->CurNW_DI, &YYTime, (u8*)AMRDataBuf, &AMRCtrl->AMRTotalDataLen);
		}
	}
	
	if(AMRCtrl->AMRTotalDataLen != 0)
	{
		if(AMRCtrl->PMType == METER_TYPE_SINGLE)
		{
			HAL_GetSystemTime(&RealTime);
			RealTimeToYYTime(&RealTime, &YYTime);
			//RealTimeToYYTime(&AMRCtrl->LastDayFrozenTime, &YYTime);
			YYTime.Ack = 0;
			YYTime.Report = 0;
			NAND_WriteMeterAMRData(AMR_DailyFreeze, AMRCtrl->Addr, AMRCtrl->PMType, AMRCtrl->CurNW_DI, &YYTime, (u8*)AMRDataBuf, &AMRCtrl->AMRTotalDataLen);	
		}	
		if(YYTime.Day == 0x01)
		{
			NAND_WriteMeterAMRData(AMR_MonthFreeze, AMRCtrl->Addr, AMRCtrl->PMType, AMRCtrl->CurNW_DI, &YYTime, (u8*)AMRDataBuf, &AMRCtrl->AMRTotalDataLen);
			if(AMRCtrl->MonthFreezOkMeters < AMRCtrl->TotalMeters) AMRCtrl->MonthFreezOkMeters++;
		}
		else
		{
			Result = NAND_ReadMeterAMRData(AMR_MonthFreeze, AMRCtrl->Addr, &FileHead, AMRCtrl->CurNW_DI, &YYTime, PnData, &Cur645_DI);
			if(Result != NO_ERROR)
			{
				NAND_WriteMeterAMRData(AMR_MonthFreeze, AMRCtrl->Addr, AMRCtrl->PMType, AMRCtrl->CurNW_DI, &YYTime, (u8*)AMRDataBuf, &AMRCtrl->AMRTotalDataLen);
				if(AMRCtrl->MonthFreezOkMeters < AMRCtrl->TotalMeters) AMRCtrl->MonthFreezOkMeters++;
			}
		}
	}

