gdgly/NUC97X_JS/STM32F4xx/CSG/QCSG_Task/CH_PLC_AMR_Task.c
	if(AMRCtrl->AMR_ID_Step == AMR_DAY_FREEZ_PATCH_ID)
	{
		if(AMRCtrl->DayFreezFailMeters > 0) AMRCtrl->DayFreezFailMeters--;
		//if(MeterFileInfo->AMRDayFreezFailMeters > 0) MeterFileInfo->AMRDayFreezFailMeters--;	
		Index = FindMeterInNodeList(AMRCtrl->Addr, NodeList, MAX_PN_NUM);
		NodeList[Index].FailCnt = 0;
		MC(0, (u32)&DayFreezFailMeterList[AMRCtrl->MeterIndex * METER_ADDR_SIZE], METER_ADDR_SIZE);
	}
	
	pAckTimer = (u16*)GetUartPortAckTimerAddr(PORTn);
	pAckTimer[0] = 0;
	MC(0, (u32)PLCManage->AMR_Data, sizeof(NwDIAMRDataStruct) * SIZE_12);
	Result = AMR_SwitchToNextMeter(PORTn, AMRCtrl);
	if(Result == NO_ERROR)
	{
		AMRCtrl->State = AMR_Tx;
		pTerminalRouter->RouterInitTask = PLC_ADD_TASK_DONE + 1;
		SwitchMeterClearAMRInfo(AMRCtrl);
	}
	else if(Result == ERROR_NO_AMR_TASK)
	{
		AMRCtrl->State = AMR_Idle;
		AMRCtrl->AMR_ID = 0;
		WarningCancel(PORTn);
	}
	else
	{

	}
	
	return Result;
}

ResultEnum PLC_AMR_RxHourFreezProcess(u32 PORTn, AMRCtrlStruct* AMRCtrl, DLT645FrameStruct* Frame, PLCManageStruct* PLCManage)
{
	RealTimeYYStruct YYTime;
	u16* pAckTimer; 
	
	ResultEnum Result = NO_ERROR;
	u8 DI_Size = 0, NW_DI_Num = 0;
	u16 Index = 0, DataLen = 0, OffSet = 0, TaskIDNum = 0;
	u32 Cur645_DI = 0, DIDataLenPos = 0;
	u8* AMRDataBuf = NULL;
	Terminal_Router_TypeDef* pTerminalRouter = Terminal_Router;
	NodeListStruct* NodeList = (NodeListStruct*)ADDR_NodeList;
	
	if(MemCompare(Frame->Addr, AMRCtrl->Addr, METER_ADDR_SIZE) != 0) return ERROR_WRONG_ADDR;	
	if(GetProtocolTypeByCtrlCode(Frame->CtrlCode & DLT_645_CODE_MASK) != AMRCtrl->Protocol) return ERROR_InvalidData;
	if((Frame->CtrlCode & DLT_645_ERROR_BIT) == 0)	//正常应答
	{
		Cur645_DI = Get645FrameDataID(Frame, AMRCtrl->Protocol);
		for(NW_DI_Num = 0; NW_DI_Num < AMRCtrl->HourFreezNwDINum; NW_DI_Num++)
		{
			//Index = FindNwDIFrom_AFN0D_Tbl(PLCManage->PLC_AMR_Data[NW_DI_Num].NW_DI);
			Index = PLCManage->AMR_Data[NW_DI_Num].TblIndex;
			if(Index >= MAX_AFN0C_0D_IDENT_NUM) continue;
			AMRCtrl->CurNW_DI_TblIndex = Index;
			AMRCtrl->Cur645_DI_Step = 0;
			OffSet = 0;
			while(Get_NextAMR_645_DI(AMRCtrl) == NO_ERROR)
			{
				if(Cur645_DI == AMRCtrl->Cur645_DI) break;
				
				if(AMRCtrl->Protocol == DLT_645_PROTOCOL_97)
				{
					OffSet += gc_stQCSGAFN0C_0D_DLT645_Table[Index].stDLT64597Resolve[AMRCtrl->Cur645_DI_Step].u8BlDataLen;
				}
				else
				{
					OffSet += gc_stQCSGAFN0C_0D_DLT645_Table[Index].stDLT64507Resolve[AMRCtrl->Cur645_DI_Step].u8BlDataLen;
				}
				AMRCtrl->Cur645_DI_Step++;
			}
			if(Cur645_DI == AMRCtrl->Cur645_DI) break;	
		}
		if(NW_DI_Num >= AMRCtrl->HourFreezNwDINum) return ERROR_InvalidData;

		AMRCtrl->CurNW_DI = PLCManage->AMR_Data[NW_DI_Num].NW_DI;
		DI_Size = DLT_645_07_ID_SIZE;
		if(AMRCtrl->Protocol == DLT_645_PROTOCOL_97) DI_Size = DLT_645_97_ID_SIZE;
		if(Frame->DataLen > DI_Size)
		{
			if(AMRCtrl->CurNW_DI == 0x0202FF00 || AMRCtrl->CurNW_DI == 0x0201FF00)	//整点电流示值，数据需要转换
			{
				AMRCtrl->Cur645DataLen = 0;
				Convert645ToNWAMRData(Frame, AMRCtrl->CurNW_DI_TblIndex, AMRCtrl->Cur645_DI_Step, AMRCtrl->Protocol, AMRCtrl->Cur645Data, &AMRCtrl->Cur645DataLen);
				if(AMRCtrl->Cur645DataLen != 0)
				{
					MR((u32)&PLCManage->AMR_Data[NW_DI_Num].Data[OffSet], (u32)AMRCtrl->Cur645Data, AMRCtrl->Cur645DataLen);
					if((OffSet + AMRCtrl->Cur645DataLen) >= PLCManage->AMR_Data[NW_DI_Num].DataLen)
					{
						PLCManage->AMR_Data[NW_DI_Num].DataLen = OffSet + AMRCtrl->Cur645DataLen;
					}
				}
			}
			else
			{
				DataLen = Frame->DataLen - DI_Size;
				MR((u32)&PLCManage->AMR_Data[NW_DI_Num].Data[OffSet], (u32)&Frame->Data[DI_Size], DataLen);
				if((OffSet + DataLen) >= PLCManage->AMR_Data[NW_DI_Num].DataLen)
				{
					PLCManage->AMR_Data[NW_DI_Num].DataLen = OffSet + DataLen;
				}
			}
		}
	}	
	else		//异常应答
	{
		for(NW_DI_Num = 0; NW_DI_Num < AMRCtrl->HourFreezNwDINum; NW_DI_Num++)
		{
			OffSet = 0;
			Index = PLCManage->AMR_Data[NW_DI_Num].TblIndex;
			if(Index >= MAX_AFN0C_0D_IDENT_NUM) continue;
			for(TaskIDNum = 0; TaskIDNum < PLCManage->AMR_Data[NW_DI_Num].TaskIDNum; TaskIDNum++)
			{
				if(PLCManage->ReportTaskID == PLCManage->AMR_Data[NW_DI_Num].TaskIDList[TaskIDNum])
				{
					if(AMRCtrl->Protocol == DLT_645_PROTOCOL_97)
					{
						DataLen = gc_stQCSGAFN0C_0D_DLT645_Table[Index].stDLT64597Resolve[TaskIDNum].u8BlDataLen;
					}
					else
					{
						DataLen = gc_stQCSGAFN0C_0D_DLT645_Table[Index].stDLT64507Resolve[TaskIDNum].u8BlDataLen;
					}
					break;
				}
				if(AMRCtrl->Protocol == DLT_645_PROTOCOL_97)
				{
					OffSet += gc_stQCSGAFN0C_0D_DLT645_Table[Index].stDLT64597Resolve[TaskIDNum].u8BlDataLen;
				}
				else
				{
					OffSet += gc_stQCSGAFN0C_0D_DLT645_Table[Index].stDLT64507Resolve[TaskIDNum].u8BlDataLen;
				}
			}
			if(TaskIDNum < PLCManage->AMR_Data[NW_DI_Num].TaskIDNum) break;
		}
		if(NW_DI_Num >= AMRCtrl->HourFreezNwDINum) return ERROR_InvalidData;
		
		MC(0xFF, (u32)&PLCManage->AMR_Data[NW_DI_Num].Data[OffSet], DataLen);
		if((OffSet + DataLen) >= PLCManage->AMR_Data[NW_DI_Num].DataLen)
		{
			PLCManage->AMR_Data[NW_DI_Num].DataLen = OffSet + DataLen;
		}
	}

	AMRCtrl->PLCTaskIDAckNum++;
	///////////////////////////ybwhz测试///////////////////////////////
		if(YBWHZ_TEST)
		{
			u8 *p8;
			u8 count = 0;
			MC(0, ADDR_YBWHZ_DATABUFF, 64); 
			p8=(u8*)(ADDR_YBWHZ_DATABUFF);
			p8[count++] = 'C';
			p8[count++] = 'U';
			p8[count++] = 'V';
			p8[count++] = ':';
			
			p8[count++] = AMRCtrl->MeterIndex/10%10 +'0';
			p8[count++] = AMRCtrl->MeterIndex/1%10 +'0';
			p8[count++] = '*';
			p8[count++] = AMRCtrl->PLCTaskIDAckNum/10%10 +'0';
			p8[count++] = AMRCtrl->PLCTaskIDAckNum/1%10 +'0';
			p8[count++] = '/';
			p8[count++] = AMRCtrl->PLCTaskIDAddNum/10%10 +'0';
			p8[count++] = AMRCtrl->PLCTaskIDAddNum/1%10 +'0';
			p8[count++] = ' ';
	
			p8[count++] = PLCManage->ReportTaskID/10%10 +'0';
			p8[count++] = PLCManage->ReportTaskID/1%10 +'0';
			p8[count++] = '#';
	
	
			QCSG_LogToRS232Port((u32)PORTn,ADDR_YBWHZ_DATABUFF,count);
		}
	////////////////////////////ybwhz测试/////////////////////////////

	
	//等一个表所有数据项抄完再保存
	if(AMRCtrl->PLCTaskIDAckNum < AMRCtrl->PLCTaskIDAddNum) return ERROR_WRONG_LENGTH;


	AMRCtrl->HourFreezOkMeters++;
	AMRCtrl->SuccessMeters++;
	NodeList[AMRCtrl->MeterIndex].FailCnt = 0;
	AMR_NUM_Display(PORTn, AMRCtrl->TotalMeters, AMRCtrl->SuccessMeters, AMRCtrl->FailMeters);
	AMRDataBuf = (u8*)Get_AMR_CH_DataBufAddr(PORTn);
	if(AMRDataBuf == NULL) return ERROR_POINTER_NULL;
	
	for(NW_DI_Num = 0; NW_DI_Num < AMRCtrl->HourFreezNwDINum; NW_DI_Num++)
	{
		if(PLCManage->AMR_Data[NW_DI_Num].DataLen == 0) continue;
		//Index = FindNwDIFrom_AFN0C_0D_Tbl(PLCManage->PLC_AMR_Data[NW_DI_Num].NW_DI);
		Index = PLCManage->AMR_Data[NW_DI_Num].TblIndex;
		if(Index >= MAX_AFN0C_0D_IDENT_NUM) continue;
		
