gdgly/NUC97X_JS/STM32F4xx/CSG/QCSG_Task/CH_PLC_AMR_Task.c
		AMRDataBuf[AMRCtrl->AMRTotalDataLen++] = PLCManage->AMR_Data[NW_DI_Num].NW_DI;
		AMRDataBuf[AMRCtrl->AMRTotalDataLen++] = PLCManage->AMR_Data[NW_DI_Num].NW_DI >> 8;
		AMRDataBuf[AMRCtrl->AMRTotalDataLen++] = PLCManage->AMR_Data[NW_DI_Num].NW_DI >> 16;
		AMRDataBuf[AMRCtrl->AMRTotalDataLen++] = PLCManage->AMR_Data[NW_DI_Num].NW_DI >> 24;
		DIDataLenPos = AMRCtrl->AMRTotalDataLen;
		AMRDataBuf[AMRCtrl->AMRTotalDataLen++] = 0;
		AMRDataBuf[AMRCtrl->AMRTotalDataLen++] = 0;
		MR((u32)&AMRDataBuf[AMRCtrl->AMRTotalDataLen], (u32)PLCManage->AMR_Data[NW_DI_Num].Data, PLCManage->AMR_Data[NW_DI_Num].DataLen);
		AMRCtrl->AMRTotalDataLen += PLCManage->AMR_Data[NW_DI_Num].DataLen;

		if((PLCManage->AMR_Data[NW_DI_Num].NW_DI == 0x0201FF00) || (PLCManage->AMR_Data[NW_DI_Num].NW_DI == 0x0202FF00))
		{
			Index = gc_stQCSGAFN0C_0D_DLT645_Table[AMRCtrl->CurNW_DI_TblIndex].u16Dlen;
			for(; PLCManage->AMR_Data[NW_DI_Num].DataLen < Index; PLCManage->AMR_Data[NW_DI_Num].DataLen++)
			{
				AMRDataBuf[AMRCtrl->AMRTotalDataLen++] = 0xFF;
			}
		}
		AMRDataBuf[DIDataLenPos]     = PLCManage->AMR_Data[NW_DI_Num].DataLen;
		AMRDataBuf[DIDataLenPos + 1] = PLCManage->AMR_Data[NW_DI_Num].DataLen >> 8;
	}
	
	if(AMRCtrl->AMRTotalDataLen != 0)
	{
		RealTimeToYYTime(&AMRCtrl->LastHourFrozenTime, &YYTime);
		YYTime.Minute = 0x00;
		YYTime.Ack = 0;
		YYTime.Report = 0;
		NAND_WriteMeterCurveData(AMR_CurveFreeze, AMRCtrl->Addr, AMRCtrl->PMType, AMRCtrl->CurNW_DI, &YYTime, (u8*)AMRDataBuf, &AMRCtrl->AMRTotalDataLen);
	}

	pAckTimer = (u16*)GetUartPortAckTimerAddr(PORTn);
	pAckTimer[0] = 0;
	MC(0, (u32)PLCManage->AMR_Data, sizeof(NwDIAMRDataStruct) * SIZE_12);	
	Result = AMR_SwitchToNextMeter(PORTn, AMRCtrl);
	if(Result == NO_ERROR)
	{
		AMRCtrl->State = AMR_Tx;
		pTerminalRouter->RouterInitTask = PLC_ADD_TASK_DONE + 1;
		SwitchMeterClearAMRInfo(AMRCtrl);	
	}
	else
	{
		AMRCtrl->State = AMR_Idle;
		AMRCtrl->AMR_ID = 0;
		WarningCancel(PORTn);
	}
	
	return Result;
}


ResultEnum PLC_AMR_RxNormalTaskProcess(u32 PORTn, AMRCtrlStruct* AMRCtrl, DLT645FrameStruct* Frame, PLCManageStruct* PLCManage)
{
	u16* pAckTimer;
	ResultEnum Result = NO_ERROR;
	u16 Index = 0, NW_DI_Num = 0, OffSet = 0;
	u32 Cur645_DI = 0;
	Terminal_Router_TypeDef* pTerminalRouter = Terminal_Router;
	if(MemCompare(Frame->Addr, AMRCtrl->Addr, METER_ADDR_SIZE) != 0) return ERROR_WRONG_ADDR;
	if(GetProtocolTypeByCtrlCode(Frame->CtrlCode & DLT_645_CODE_MASK) != AMRCtrl->Protocol) return ERROR_InvalidData;

	if((Frame->CtrlCode & DLT_645_ERROR_BIT) == 0)//从站正确应答
	{
		Cur645_DI = Get645FrameDataID(Frame, AMRCtrl->Protocol);
		for(NW_DI_Num = 0; NW_DI_Num < AMRCtrl->NormalTask->DINum; NW_DI_Num++)
		{
			//Index = FindNwDIFrom_AFN0C_0D_Tbl(AMRCtrl->NormalTask->DataList[NW_DI_Num].NW_DI);
			Index = AMRCtrl->NormalTask->DataList[NW_DI_Num].TblIndex;
			if(Index >= MAX_AFN0C_0D_IDENT_NUM) continue;
			AMRCtrl->CurNW_DI_TblIndex = Index;
			AMRCtrl->Cur645_DI_Step = 0;
			OffSet = 0;
			while(Get_NextAMR_645_DI(AMRCtrl) == NO_ERROR)
			{
				if(Cur645_DI == AMRCtrl->Cur645_DI) break;
				
				if(AMRCtrl->Protocol == DLT_645_PROTOCOL_97)
				{
					OffSet += gc_stQCSGAFN0C_0D_DLT645_Table[Index].stDLT64597Resolve[AMRCtrl->Cur645_DI_Step].u8BlDataLen;
				}
				else
				{
					OffSet += gc_stQCSGAFN0C_0D_DLT645_Table[Index].stDLT64507Resolve[AMRCtrl->Cur645_DI_Step].u8BlDataLen;
				}
				AMRCtrl->Cur645_DI_Step++;
			}
			if(Cur645_DI == AMRCtrl->Cur645_DI) break;	
		}
		if(NW_DI_Num >= AMRCtrl->NormalTask->DINum) return ERROR_InvalidData;

		AMRCtrl->Cur645DataLen = 0;
		Convert645ToNWAMRData(Frame, AMRCtrl->CurNW_DI_TblIndex, AMRCtrl->Cur645_DI_Step, AMRCtrl->Protocol, AMRCtrl->Cur645Data, &AMRCtrl->Cur645DataLen);

		if(AMRCtrl->Cur645DataLen != 0)
		{
			MR((u32)&AMRCtrl->NormalTask->DataList[NW_DI_Num].Data[OffSet], (u32)AMRCtrl->Cur645Data, AMRCtrl->Cur645DataLen);
			if((OffSet + AMRCtrl->Cur645DataLen) >= AMRCtrl->NormalTask->DataList[NW_DI_Num].DataLen)
			{
				AMRCtrl->NormalTask->DataList[NW_DI_Num].DataLen = OffSet + AMRCtrl->Cur645DataLen;
			}
		}
	}

	AMRCtrl->PLCTaskIDAckNum++;
	///////////////////////////ybwhz测试///////////////////////////////
		if(YBWHZ_TEST)
		{
			u8 *p8;
			u8 count = 0;
			MC(0, ADDR_YBWHZ_DATABUFF, 64); 
			p8=(u8*)(ADDR_YBWHZ_DATABUFF);
			p8[count++] = 'N';
			p8[count++] = 'R';
			p8[count++] = 'M';
			p8[count++] = ':';
			
			p8[count++] = AMRCtrl->MeterIndex/10%10 +'0';
			p8[count++] = AMRCtrl->MeterIndex/1%10 +'0';
			p8[count++] = '*';
			p8[count++] = AMRCtrl->PLCTaskIDAckNum/10%10 +'0';
			p8[count++] = AMRCtrl->PLCTaskIDAckNum/1%10 +'0';
			p8[count++] = '/';
			p8[count++] = AMRCtrl->PLCTaskIDAddNum/10%10 +'0';
			p8[count++] = AMRCtrl->PLCTaskIDAddNum/1%10 +'0';
			p8[count++] = ' ';
	
			p8[count++] = PLCManage->ReportTaskID/10%10 +'0';
			p8[count++] = PLCManage->ReportTaskID/1%10 +'0';
			p8[count++] = '#';
	
	
			QCSG_LogToRS232Port((u32)PORTn,ADDR_YBWHZ_DATABUFF,count);
		}
	////////////////////////////ybwhz测试/////////////////////////////

	
	if(AMRCtrl->PLCTaskIDAckNum < AMRCtrl->PLCTaskIDAddNum) return ERROR_WRONG_LENGTH;
	
	StoreNormalTaskAMRData(PORTn, AMRCtrl);

	pAckTimer = (u16*)GetUartPortAckTimerAddr(PORTn);
	pAckTimer[0] = 0;
	
	Result = AMR_SwitchToNextMeter(PORTn, AMRCtrl);
	if(Result == NO_ERROR)
	{
		AMRCtrl->State = AMR_Tx;
		pTerminalRouter->RouterInitTask = PLC_ADD_TASK_DONE + 1;
		SwitchMeterClearAMRInfo(AMRCtrl);
	}
	else if(Result == ERROR_NO_AMR_TASK)
	{
		AMRCtrl->State = AMR_Idle;
		AMRCtrl->AMR_ID = 0;
		WarningCancel(PORTn);
	}
	else
	{

	}
	
	return Result;
}


ResultEnum PLC_AMR_RxRelayTaskProcess(u32 PORTn, AMRCtrlStruct* AMRCtrl, DLT645FrameStruct* Frame, PLCManageStruct* PLCManage)
{
	u16* pAckTimer;
	RealTimeYYStruct YYTime;
	RealTimeStruct RealTime;
	ResultEnum Result = NO_ERROR;
	u32 RelayTaskID = 0, DataLen = 0;
	Terminal_Router_TypeDef* pTerminalRouter = Terminal_Router;
	if(MemCompare(Frame->Addr, AMRCtrl->Addr, METER_ADDR_SIZE) != 0) return ERROR_WRONG_ADDR;
	DataLen = Build645Frame(Frame, AMRCtrl->Cur645Data, NO_FE_IN_645);

	if(DataLen != 0)
	{
		HAL_GetSystemTime(&RealTime);
		RealTimeToYYTime(&RealTime, &YYTime);
		YYTime.Ack = 0;
		YYTime.Report = 0;
		RelayTaskID = 0xE0000401 + AMRCtrl->RelayTask->CurTaskID;
		NAND_WriteRelayTask(AMRCtrl->RelayTask->RelayType,RelayTaskID, &YYTime, AMRCtrl->Cur645Data, &DataLen);
	}

	pAckTimer = (u16*)GetUartPortAckTimerAddr(PORTn);
	pAckTimer[0] = 0;
	
	Result = AMR_SwitchToNextMeter(PORTn, AMRCtrl);
	if(Result == NO_ERROR)
	{
		AMRCtrl->State = AMR_Tx;
		pTerminalRouter->RouterInitTask = PLC_ADD_TASK_DONE + 1;
		SwitchMeterClearAMRInfo(AMRCtrl);
	}
	else if(Result == ERROR_NO_AMR_TASK)
	{
		AMRCtrl->State = AMR_Idle;
		AMRCtrl->AMR_ID = 0;
		WarningCancel(PORTn);
	}
	else
	{

