gdgly/NUC97X_JS/STM32F4xx/CSG/QCSG_Task/CH_PLC_AMR_Task.c
	}
	
	return Result;
}

ResultEnum PLC_AMR_RxAlarmTaskProcess(u32 PORTn, AMRCtrlStruct* AMRCtrl, DLT645FrameStruct* Frame, PLCManageStruct* PLCManage)
{
	u16* pAckTimer;
	ResultEnum Result = NO_ERROR;
	Terminal_Router_TypeDef* pTerminalRouter = Terminal_Router;
	AlarmAMRDataStruct* AlarmAMRData = (AlarmAMRDataStruct*)ADDR_AlarmTaskAMRDataBuf_New;
	AlarmAMRData += AMRCtrl->MeterIndex;


//if(PLCManage->ReportTaskID < RT_AMR_TASK_ID_START) 
{
	if(MemCompare(Frame->Addr, AMRCtrl->Addr, METER_ADDR_SIZE) != 0) return ERROR_WRONG_ADDR;
	
	if(GetProtocolTypeByCtrlCode(Frame->CtrlCode & DLT_645_CODE_MASK) != AMRCtrl->Protocol) return ERROR_InvalidData;

	if((Frame->CtrlCode & DLT_645_ERROR_BIT) == 0)
	{
		if(AMRCtrl->Protocol == DLT_645_PROTOCOL_97)
		{
			StoreAlarmTaskAMRData_97(PORTn, AMRCtrl, Frame);
		}
		else
		{
			StoreAlarmTaskAMRData_07(PORTn, AMRCtrl, Frame);
		}
	}

	/*{
	//err20190220 修改载波抄表流程
		u8 Pos=0,Bit=0;
		Pos = AMRCtrl->PLCTaskIDAddNum >> 3;
		Bit = AMRCtrl->PLCTaskIDAddNum & 0x07;	
		AMRCtrl->PLCTaskIDFlagList[Pos] |= 1 << Bit;
	}*/
	
	AMRCtrl->PLCTaskIDAckNum++;
	
	///////////////////////////ybwhz测试///////////////////////////////
	if(YBWHZ_TEST)
	{
		u8 *p8;
		u8 count = 0;
		MC(0, ADDR_YBWHZ_DATABUFF, 64);	
		p8=(u8*)(ADDR_YBWHZ_DATABUFF);
		p8[count++] = 'A';
		p8[count++] = 'M';
		p8[count++] = 'R';
		p8[count++] = ':';
		
		p8[count++] = AMRCtrl->MeterIndex/10%10 +'0';
		p8[count++] = AMRCtrl->MeterIndex/1%10 +'0';
		p8[count++] = '*';
		p8[count++] = AMRCtrl->PLCTaskIDAckNum/10%10 +'0';
		p8[count++] = AMRCtrl->PLCTaskIDAckNum/1%10 +'0';
		p8[count++] = '/';
		p8[count++] = AMRCtrl->PLCTaskIDAddNum/10%10 +'0';
		p8[count++] = AMRCtrl->PLCTaskIDAddNum/1%10 +'0';
		p8[count++] = ' ';

		p8[count++] = PLCManage->ReportTaskID/10%10 +'0';
		p8[count++] = PLCManage->ReportTaskID/1%10 +'0';
		p8[count++] = '#';


		QCSG_LogToRS232Port((u32)PORTn,ADDR_YBWHZ_DATABUFF,count);
	}
////////////////////////////ybwhz测试/////////////////////////////

	if(AMRCtrl->PLCTaskIDAckNum < AMRCtrl->PLCTaskIDAddNum) return ERROR_WRONG_LENGTH;
		//周期抄表任务未上报完则继续等待
	pAckTimer = (u16*)GetUartPortAckTimerAddr(PORTn);
	pAckTimer[0] = 0;
	
	AlarmAMRData->State[1] = 0x01;	//数据已更新
	Result = AMR_SwitchToNextMeter(PORTn, AMRCtrl);
	if(Result == NO_ERROR)
	{
		AMRCtrl->State = AMR_Tx;
		pTerminalRouter->RouterInitTask = PLC_ADD_TASK_DONE + 1;
		SwitchMeterClearAMRInfo(AMRCtrl);
	}
	else if(Result == ERROR_NO_AMR_TASK)
	{
		AMRCtrl->State = AMR_Idle;
		AMRCtrl->AMR_ID = 0;
		WarningCancel(PORTn);
	}
	else
	{

	}
}
	return Result;
}


ResultEnum PLC_AMR_PauseProcess(u32 PORTn, AMRCtrlStruct* AMRCtrl, PLCManageStruct* PLCManage)
{
	u16* pAckTimer;
	ResultEnum Result = NO_ERROR;
	Terminal_Router_TypeDef* pTerminalRouter = Terminal_Router;
	RT_AMRCtrlStruct* Task = (RT_AMRCtrlStruct*)ADDR_RealTimeAMRTaskCtrl;
	
	pAckTimer = (u16*)GetUartPortAckTimerAddr(PORTn);
	if(pAckTimer[0] == 0)
	{
		AMRCtrl->State = AMR_Resume;
		return Result;
	}

	if((AMRCtrl->Flag & AMR_FLAG_RT_AMR_START) == 0) return Result;
	AMRCtrl->Flag &= ~AMR_FLAG_RT_AMR_START;

	PLCManage->Flag = 0;
	if(Task->SrcDataType == DATA_TYPE_BCAST_CMD)
	{
		AMRCtrl->State = AMR_RealTimeTx;
		pAckTimer[0] = 0;
		pTerminalRouter->RouterInitTask = PLC_ADD_TASK_STOP_TASK;
		//if(Task->RequestCnt == 0x01) pAckTimer[0] = RT_AMR_PLC_FIRST_TIME_DELAY;
		//pTerminalRouter->RouterInitTask = PLC_ADD_TASK_DONE + 1;
	}
	else if(Task->SrcDataType == DATA_TYPE_FRAME)
	{
		AMRCtrl->State = AMR_RealTimeTx;
		pAckTimer[0] = 0;
		pTerminalRouter->RouterInitTask = PLC_ADD_TASK_STOP_TASK;
		//if(Task->RequestCnt == 0x01) pAckTimer[0] = RT_AMR_PLC_FIRST_TIME_DELAY;
		//pTerminalRouter->RouterInitTask = PLC_ADD_TASK_DONE + 1;
	}
	else if(Task->SrcDataType == DATA_TYPE_RELAY)
	{
		AMRCtrl->State = AMR_RealTimeTx;
		pAckTimer[0] = 0;
		pTerminalRouter->RouterInitTask = PLC_ADD_TASK_STOP_TASK;
		//if(Task->RequestCnt == 0x01) pAckTimer[0] = RT_AMR_PLC_FIRST_TIME_DELAY;
		//pTerminalRouter->RouterInitTask = PLC_ADD_TASK_DONE + 1;
	}
	else //if(Task->SrcDataType == DATA_TYPE_STRUCT)
	{
		if(Task->Protocol == DLT_645_PROTOCOL_07)
		{
			Task->Cur645_DI = gc_stQCSGAFN0C_0D_DLT645_Table[Task->CurNW_DI_TblIndex].stDLT64507Resolve[Task->Cur645_DI_Step].u32Ident;
		}
		else //if(AMRCtrl->Protocol == DLT_645_PROTOCOL_97)
		{
			Task->Cur645_DI = gc_stQCSGAFN0C_0D_DLT645_Table[Task->CurNW_DI_TblIndex].stDLT64597Resolve[Task->Cur645_DI_Step].u32Ident;
		}
		if(Task->Cur645_DI == 0xFFFFFFFF)
		{	
			Task->Flag |= RT_AMR_DATA_READY;
			AMRCtrl->State = AMR_Pause;
			pAckTimer[0] = AMR_PAUSE_MAX_TIME;
		}
		else
		{
			AMRCtrl->State = AMR_RealTimeTx;
			pAckTimer[0] = 0;
			pTerminalRouter->RouterInitTask = PLC_ADD_TASK_STOP_TASK;
			//if(Task->RequestCnt == 0x01) pAckTimer[0] = RT_AMR_PLC_FIRST_TIME_DELAY;
			//pTerminalRouter->RouterInitTask = PLC_ADD_TASK_DONE + 1;
			// 此处不将 pTerminalRouter->RouterInitTask 直接清 0，是因为切换抄表地址前可能刚刚向模块发送了
			// 最后一个任务数据上报的确认信息，需要等待确认信息发送完毕，若不进行此操作，则会因为添加
			// 任务的第一个步骤串口被占用，而设置超时时间为 3 S，时间比较长，浪费时间。
		}
	}
	
	return Result;
}

ResultEnum PLC_AMR_RealTimeTxProcess(u32 PORTn, AMRCtrlStruct* AMRCtrl, PLCManageStruct* PLCManage)
{
	u16* pPortAckTimer;
	QCSGLocalFrameStruct LocalFrame;
	Terminal_Router_TypeDef* pTerminalRouter = Terminal_Router;
	RT_AMRCtrlStruct* Task = (RT_AMRCtrlStruct*)ADDR_RealTimeAMRTaskCtrl;
	ResultEnum Result = NO_ERROR;

	pPortAckTimer = (u16*)GetUartPortAckTimerAddr(PORTn);
	switch(pTerminalRouter->RouterInitTask)
	{
		case PLC_ADD_TASK_STOP_TASK:
			Result = PLC_AMR_ADD_TASK_TxStopTask(PORTn, PLCManage, &LocalFrame);
			break;
		case PLC_ADD_TASK_STOP_TASK_WAIT_ACK:
			if((PLCManage->Flag & PLC_FLAG_STOP_TASK_DONE) != 0)
			{// PLC  抄表，首先停止任务
				PLCManage->Flag &= ~PLC_FLAG_STOP_TASK_DONE;
				pPortAckTimer[0] = 0;
				//err20190221 改变周期抄表时插入的实时流程，不再进行初始化
				if((AMRCtrl->OldState == AMR_WaitRx)&& (AMRCtrl->AMR_ID_Step == AMR_ALARM_TASK_ID))
				{
					Task->PLCTaskIDAckNum = RT_AMR_TASK_ID_START;
					Task->PLCTaskIDAddNum = RT_AMR_TASK_ID_START;
					pTerminalRouter->RouterInitTask = PLC_ADD_TASK_ADD_ONE;
					//pTerminalRouter->RouterInitTask = PLC_ADD_TASK_DONE;//临时暂停观察无线模块状态
				}
				else
					pTerminalRouter->RouterInitTask++;
				pTerminalRouter->RetryCnt = 0;
			}
			else
			{
				if(pPortAckTimer[0] == 0)
				{// 超时，重发停止任务
					pTerminalRouter->RouterInitTask--;
				}
			}
			break;
		case PLC_ADD_TASK_INIT:
			Result = PLC_TxInitTask(PORTn, PLCManage, &LocalFrame);
			break;
		case PLC_ADD_TASK_INIT_WAIT_ACK:
			if((PLCManage->Flag & PLC_FLAG_INIT_TASK_DONE) != 0)
			{// PLC 抄表初始化任务完成
				PLCManage->Flag &= ~PLC_FLAG_INIT_TASK_DONE;
				pPortAckTimer[0] = 3;
				if(AMRCtrl->OldState == AMR_Idle) pPortAckTimer[0] = 0;
				pTerminalRouter->RouterInitTask++;
				pTerminalRouter->RetryCnt = 0;
				Task->PLCTaskIDAckNum = RT_AMR_TASK_ID_START;
				Task->PLCTaskIDAddNum = RT_AMR_TASK_ID_START;
			}
			else
			{
				if(pPortAckTimer[0] == 0)
				{// 超时，重发初始化任务
					pTerminalRouter->RouterInitTask--;
				}
			}
			break;
		case PLC_ADD_TASK_ADD_ONE:
			Result = PLC_AMR_RealTimeAddTaskProcess(PORTn, AMRCtrl, PLCManage, &LocalFrame);
			break;
		case PLC_ADD_TASK_ADD_ONE_WAIT_ACK:
			if((PLCManage->Flag & PLC_FLAG_ADD_ONE_TASK_DONE) != 0)
			{// PLC 单次添加任务完成，
				PLCManage->Flag &= ~PLC_FLAG_ADD_ONE_TASK_DONE;
				pPortAckTimer[0] = 0;
				Task->PLCTaskIDAddNum++;
				if(Task->SrcDataType == DATA_TYPE_STRUCT)
				{
					Task->Cur645_DI_Step++;
					if(Task->Protocol == DLT_645_PROTOCOL_07)
					{
						Task->Cur645_DI = gc_stQCSGAFN0C_0D_DLT645_Table[Task->CurNW_DI_TblIndex].stDLT64507Resolve[Task->Cur645_DI_Step].u32Ident;
					}
					else //if(AMRCtrl->Protocol == DLT_645_PROTOCOL_97)
					{
						Task->Cur645_DI = gc_stQCSGAFN0C_0D_DLT645_Table[Task->CurNW_DI_TblIndex].stDLT64597Resolve[Task->Cur645_DI_Step].u32Ident;
					}
					if(Task->Cur645_DI == 0xFFFFFFFF)
					{
						Result = ERROR_NO_AMR_TASK;
					}
					else
					{
						Result = NO_ERROR;
					}
				}
				else
				{
					Result = ERROR_NO_AMR_TASK;
				}
				if(Result == NO_ERROR)
				{
					pTerminalRouter->RouterInitTask--;
					pTerminalRouter->RetryCnt = 0;					
				}
				else
				{
					pTerminalRouter->RouterInitTask++;
					pTerminalRouter->RetryCnt = 0;
				}
			}
			else
			{
				if(pPortAckTimer[0] == 0)
				{// 超时，重发添加任务
					pTerminalRouter->RouterInitTask--;
				}
			}
			break;
		case PLC_ADD_TASK_START_TASK:
			Result = PLC_AMR_ADD_TASK_TxStartTask(PORTn, PLCManage, &LocalFrame);
			break;
		case PLC_ADD_TASK_START_TASK_WAIT_ACK:
			if((PLCManage->Flag & PLC_FLAG_START_TASK_DONE) != 0)
			{// PLC 抄表启动任务完成，
				PLCManage->Flag &= ~PLC_FLAG_START_TASK_DONE;
				PLCManage->ReportTaskID = 0;
				pPortAckTimer[0] = 0;
				pTerminalRouter->RouterInitTask++;
				pTerminalRouter->RetryCnt = 0;
			}
			else
			{
				if(pPortAckTimer[0] == 0)
				{// 超时，重发初始化任务
					pTerminalRouter->RouterInitTask--;
				}
			}
			break;
		case PLC_ADD_TASK_DONE:
			if(pPortAckTimer[0] == 0)
			{
				AMRCtrl->State = AMR_RealTimeWaitRx;
				pTerminalRouter->RouterInitTask++;
				pTerminalRouter->RetryCnt = 0;
				pPortAckTimer[0] = PLCManage->AMRTimeOut;
				if(Task->SrcDataType == DATA_TYPE_RELAY)
				{
					RT_AMR_Info_Display(PORTn, Task->Addr, RT_AMR_INFO_CODE_RELAY);
				}
				if(Task->SrcDataType == DATA_TYPE_STRUCT)
				{
					RT_AMR_Info_Display(PORTn, Task->Addr, RT_AMR_INFO_CODE_RT);
				}

				if(Task->SrcDataType == DATA_TYPE_BCAST_CMD)
				{
					Task->Flag |= RT_AMR_DATA_READY;//err20190315 载波广播任务执行完成就应答请求防止等待过久。
					RT_AMR_Info_Display(PORTn, Task->Addr, RT_AMR_INFO_CODE_BCAST);
				}	

				if(Task->SrcDataType == DATA_TYPE_FRAME)
				{
					RT_AMR_Info_Display(PORTn, Task->Addr, RT_AMR_INFO_CODE_CONTROL);
				}
			}
			break;
		default:
			if(pPortAckTimer[0] == 0) pTerminalRouter->RouterInitTask++;
			// 此处不将 pTerminalRouter->RouterInitTask 直接清 0，是因为切换抄表地址前刚刚向模块发送了
			// 最后一个任务数据上报的确认信息，需要等待确认信息发送完毕，若不进行此操作，则会因为添加
			// 任务的第一个步骤串口被占用，而设置超时时间为 3 S，时间比较长，浪费时间。
			break;
	}
	
	return Result;
}
ResultEnum PLC_AMR_RealTimeAddTaskProcess(u32 PORTn, AMRCtrlStruct* AMRCtrl, PLCManageStruct* PLCManage, QCSGLocalFrameStruct* LocalFrame)
{
	u16* pPortAckTimer;
	UartTxReqStruct UartTxReq;
	DLT645FrameStruct DLT645Frame;
	RT_AMRCtrlStruct* Task = (RT_AMRCtrlStruct*)ADDR_RealTimeAMRTaskCtrl;
	Terminal_Router_TypeDef* pTerminalRouter = Terminal_Router;
	u32 TxBuf = 0, TxLen = 0;

	pPortAckTimer = (u16*)GetUartPortAckTimerAddr(PORTn);
	if(pPortAckTimer[0] != 0) return ERROR_WRONG_TIME;
	
