gdgly/NUC97X_JS/STM32F4xx/CSG/QCSG_Task/CH_PLC_AMR_Task.c
	MC(0, (u32)&UartTxReq, sizeof(UartTxReqStruct));
	TxBuf = GetUartPortTxBuf(PORTn);
	
	if(pTerminalRouter->RetryCnt < PLC_CMD_MAX_CNT)
	{	
		MC(0, (u32)LocalFrame, sizeof(QCSGLocalFrameStruct));
		pPortAckTimer[0] = PLC_WAIT_ACK_TIME_OUT;
		LocalFrame->FC = LOCAL_FRAME_PRM_BIT | LOCAL_FRAME_ADR_BIT;
		MR((u32)LocalFrame->SrcAddr, (u32)PLCManage->TerminalAddr, METER_ADDR_SIZE);
		MR((u32)LocalFrame->DstAddr, (u32)Task->Addr, METER_ADDR_SIZE);
		LocalFrame->AFN = LOCAL_FRAME_AFN_02;
		LocalFrame->SEQ = PLCManage->SEQ++;
		LocalFrame->DI = 0xE8020201;
		LocalFrame->DataLen = 0;
		LocalFrame->Data[LocalFrame->DataLen++] = Task->PLCTaskIDAddNum;
		LocalFrame->Data[LocalFrame->DataLen++] = Task->PLCTaskIDAddNum >> 8;
		if((Task->SrcDataType == DATA_TYPE_RELAY) || (Task->SrcDataType == DATA_TYPE_STRUCT) || (Task->SrcDataType == DATA_TYPE_FRAME))//err20180623 鎺у埗鍛戒护涔熼渶瑕佸洖澶?
		{
			LocalFrame->Data[LocalFrame->DataLen++] = PLC_TASK_LEVEL_0 | PLC_TASK_RESP_BIT;
		}
		else
		{
			LocalFrame->Data[LocalFrame->DataLen++] = PLC_TASK_LEVEL_0;//err20180623 骞挎挱鏍℃椂涓嶉渶瑕佸洖澶?
		}
		
		PLCManage->AMRTimeOut = PLC_AMR_RT_TIME_OUT;
		
		if(Task->SrcDataType == DATA_TYPE_RELAY)
		{//err20190311 中继转发设置的超时时间大于最小超时时间时，则按设置的时间计算超时。
			if(Task->RelayTimeOut > PLC_AMR_RT_TIME_OUT)
				PLCManage->AMRTimeOut = Task->RelayTimeOut;
		}
		
		LocalFrame->Data[LocalFrame->DataLen++] = PLCManage->AMRTimeOut;
		LocalFrame->Data[LocalFrame->DataLen++] = PLCManage->AMRTimeOut >> 8;
		
		MC(0, (u32)&DLT645Frame, sizeof(DLT645FrameStruct));		
		if(Task->SrcDataType == DATA_TYPE_BCAST_CMD)
		{
			LocalFrame->Data[LocalFrame->DataLen++] = Task->CurPnDataLen;
			MR((u32)&LocalFrame->Data[LocalFrame->DataLen], (u32)&Task->SrcData[Task->SrcDataPos], Task->CurPnDataLen);
			LocalFrame->DataLen += (u8)Task->CurPnDataLen;
			UartTxReq.NeedAck = 0x00;
			PLCManage->AMRTimeOut = 30;
		}
		else if(Task->SrcDataType == DATA_TYPE_FRAME)
		{
			LocalFrame->Data[LocalFrame->DataLen++] = Task->CurPnDataLen;
			MR((u32)&LocalFrame->Data[LocalFrame->DataLen], (u32)&Task->SrcData[Task->SrcDataPos], Task->CurPnDataLen);	
			LocalFrame->DataLen += (u8)Task->CurPnDataLen;
			UartTxReq.NeedAck = 0x00;
			PLCManage->AMRTimeOut = 30;
		}
		else if(Task->SrcDataType == DATA_TYPE_RELAY)
		{
			LocalFrame->Data[LocalFrame->DataLen++] = Task->CurPnDataLen;
			MR((u32)&LocalFrame->Data[LocalFrame->DataLen], (u32)&Task->SrcData[Task->SrcDataPos], Task->CurPnDataLen);	
			LocalFrame->DataLen += (u8)Task->CurPnDataLen;
			UartTxReq.NeedAck = 0x01;
		}
		else //if(Task->SrcDataType == DATA_TYPE_STRUCT)
		{
			MC(0, (u32)&DLT645Frame, sizeof(DLT645FrameStruct));
			MR((u32)DLT645Frame.Addr, (u32)Task->Addr, METER_ADDR_SIZE);
			if(Task->Protocol == DLT_645_PROTOCOL_07)
			{
				DLT645Frame.CtrlCode = DLT_07_READ;
				DLT645Frame.DataLen = DLT_645_07_ID_SIZE;
				DLT645Frame.Data[0] = Task->Cur645_DI;
				DLT645Frame.Data[1] = Task->Cur645_DI >> 8;
				DLT645Frame.Data[2] = Task->Cur645_DI >> 16;
				DLT645Frame.Data[3] = Task->Cur645_DI >> 24;
			}
			else //if(Task->Protocol == DLT_645_PROTOCOL_97)
			{
				DLT645Frame.CtrlCode = DLT_97_READ;
				DLT645Frame.DataLen = DLT_645_97_ID_SIZE;
				DLT645Frame.Data[0] = Task->Cur645_DI;
				DLT645Frame.Data[1] = Task->Cur645_DI >> 8;		
			}
			LocalFrame->Data[LocalFrame->DataLen] = Build645Frame(&DLT645Frame, &LocalFrame->Data[LocalFrame->DataLen + 1], NO_FE_IN_645);
			LocalFrame->DataLen += LocalFrame->Data[LocalFrame->DataLen] + 1;
			UartTxReq.NeedAck = 0x01;
		}	
		
		TxLen = BuildLocalModuleFrame((u8*)TxBuf, LocalFrame);
		MC(0, (u32)&UartTxReq, sizeof(UartTxReqStruct));				
		UartTxReq.SrcTask = TASK_ID_PLC_AMR;
		UartTxReq.FrameType = FRAME_TYPE_QCSG_LOCAL;
		UartTxReq.RetryCnt = 0;
		UartTxReq.BpsCtrl = 0;
		UartTxReq.TimeOut = PLC_WAIT_ACK_TIME_OUT;
		UartTxReq.DataLen = TxLen;
		UartTxReq.DataBuf = (u8*)TxBuf;
		if(UartPortTxReqNew(PORTn, &UartTxReq) == NO_ERROR)
		{
			pTerminalRouter->RouterInitTask++;
			pTerminalRouter->RetryCnt++;
		}	
	}
	else
	{
		PLCManage->State = PLC_RESET_INIT;
		pTerminalRouter->RouterResetCnt = 0;		
		pTerminalRouter->RouterInitTask = 0;
		pTerminalRouter->RetryCnt = 0;
	}
	return NO_ERROR;
}

ResultEnum PLC_AMR_WaitRealTimeRxProcess(u32 PORTn, AMRCtrlStruct* AMRCtrl, PLCManageStruct* PLCManage)
{
	DLT645FrameStruct DLT645Frame;
	u16* pAckTimer;
	
	ResultEnum Result = NO_ERROR;
	RT_AMRCtrlStruct* Task = (RT_AMRCtrlStruct*)ADDR_RealTimeAMRTaskCtrl;
	u32 DataLen = 0, i = 0, LeftLen = 0, Index= 0, Cur645_DI = 0;
	u16 OffSet = 0, TempOffSet = 0;
	u8* DataBuf = NULL; 

	AlarmAMRDataStruct* AlarmAMRData = (AlarmAMRDataStruct*)ADDR_AlarmTaskAMRDataBuf_New;
	Terminal_Router_TypeDef* pTerminalRouter = Terminal_Router;


	pAckTimer = (u16*)GetUartPortAckTimerAddr(PORTn);
	if(pAckTimer[0] == 0)
	{
		AMRCtrl->State = AMR_Pause;
		pAckTimer[0] = AMR_PAUSE_MAX_TIME;
		Task->Flag |= RT_AMR_DATA_READY;
		return Result;
	}

	if(PLCManage->DataLenInDataBuf == 0) return ERROR_WRONG_LENGTH;	
	if(PLCManage->ReportTaskID < RT_AMR_TASK_ID_START) 
	{
		//err20190308 此处是为了适配微功率无线模块，下发实时任务后可能首先上报一帧周期抄表任务数据。需要接收处理否则将丢失。
		if((AMRCtrl->OldState == AMR_WaitRx)&& (AMRCtrl->AMR_ID_Step == AMR_ALARM_TASK_ID)&& (AMRCtrl->PLCTaskIDAckNum < AMRCtrl->PLCTaskIDAddNum))
		{//周期抄表还没有抄完 则接收周期抄表数据
			DataBuf = (u8*)Get_AMR_CH_DataBufAddr(PORTn);
			if(DataBuf == NULL) return ERROR_POINTER_NULL;

			Result = DLT645FrameDcompress(&DLT645Frame, DataBuf, PLCManage->DataLenInDataBuf);
			PLCManage->DataLenInDataBuf = 0;
			if(Result != NO_ERROR) return Result;

			if(MemCompare(DLT645Frame.Addr, AMRCtrl->Addr, METER_ADDR_SIZE) != 0) return ERROR_WRONG_ADDR;
	
			if(GetProtocolTypeByCtrlCode(DLT645Frame.CtrlCode & DLT_645_CODE_MASK) != AMRCtrl->Protocol) return ERROR_InvalidData;

			if((DLT645Frame.CtrlCode & DLT_645_ERROR_BIT) == 0)
			{
				if(AMRCtrl->Protocol == DLT_645_PROTOCOL_97)
				{
					StoreAlarmTaskAMRData_97(PORTn, AMRCtrl, &DLT645Frame);
				}
				else
				{
					StoreAlarmTaskAMRData_07(PORTn, AMRCtrl, &DLT645Frame);
				}
			}
			AMRCtrl->PLCTaskIDAckNum++;
			///////////////////////////ybwhz测试///////////////////////////////
				if(YBWHZ_TEST)
				{
					u8 *p8;
					u8 count = 0;
					MC(0, ADDR_YBWHZ_DATABUFF, 64); 
					p8=(u8*)(ADDR_YBWHZ_DATABUFF);
					p8[count++] = 'A';
					p8[count++] = 'M';
					p8[count++] = 'R';
					p8[count++] = 'T';
					
					p8[count++] = AMRCtrl->MeterIndex/10%10 +'0';
					p8[count++] = AMRCtrl->MeterIndex/1%10 +'0';
					p8[count++] = '*';
					p8[count++] = AMRCtrl->PLCTaskIDAckNum/10%10 +'0';
					p8[count++] = AMRCtrl->PLCTaskIDAckNum/1%10 +'0';
					p8[count++] = '/';
					p8[count++] = AMRCtrl->PLCTaskIDAddNum/10%10 +'0';
					p8[count++] = AMRCtrl->PLCTaskIDAddNum/1%10 +'0';
					p8[count++] = ' ';
			
					p8[count++] = PLCManage->ReportTaskID/10%10 +'0';
					p8[count++] = PLCManage->ReportTaskID/1%10 +'0';
					p8[count++] = '#';
			
			
					QCSG_LogToRS232Port((u32)PORTn,ADDR_YBWHZ_DATABUFF,count);
				}
			////////////////////////////ybwhz测试/////////////////////////////
			if(AMRCtrl->PLCTaskIDAckNum < AMRCtrl->PLCTaskIDAddNum) return ERROR_WRONG_LENGTH;
					//周期抄表任务未上报完则继续等待
			pAckTimer = (u16*)GetUartPortAckTimerAddr(PORTn);
			pAckTimer[0] = 30;//还需等待实时任务接收完成
			
