gdgly/NUC97X_JS/STM32F4xx/CSG/QCSG_Task/CH_PLC_AMR_Task.c
			AlarmAMRData->State[1] = 0x01;	//数据已更新
			Result = AMR_SwitchToNextMeter(PORTn, AMRCtrl);
			if(Result == NO_ERROR)
			{
				AMRCtrl->OldState = AMR_Tx;
				pTerminalRouter->RouterInitTask = PLC_ADD_TASK_DONE + 1;
				SwitchMeterClearAMRInfo(AMRCtrl);
			}
			else if(Result == ERROR_NO_AMR_TASK)
			{
				AMRCtrl->OldState = AMR_Idle;
				AMRCtrl->AMR_ID = 0;
				WarningCancel(PORTn);
			}
			else
			{
			
			}	
		}
		PLCManage->DataLenInDataBuf = 0;
		return ERROR_WRONG_ACCESS;	
	}
	DataBuf = (u8*)Get_AMR_CH_DataBufAddr(PORTn);
	if(DataBuf == NULL) return ERROR_POINTER_NULL;
	DataLen = PLCManage->DataLenInDataBuf;
	PLCManage->DataLenInDataBuf = 0;
	
	Task->PLCTaskIDAckNum++;
	///////////////////////////ybwhz测试///////////////////////////////
		if(YBWHZ_TEST)
		{
			u8 *p8;
			u8 count = 0;
			MC(0, ADDR_YBWHZ_DATABUFF, 64); 
			p8=(u8*)(ADDR_YBWHZ_DATABUFF);
			p8[count++] = 'R';
			p8[count++] = 'T';
			p8[count++] = ' ';
			p8[count++] = ':';
			
			p8[count++] = SwitchPnToNum(Task->CurPn)/10%10 +'0';
			p8[count++] = SwitchPnToNum(Task->CurPn)/1%10 +'0';
			p8[count++] = '*';
			p8[count++] = Task->PLCTaskIDAckNum/10%10 +'0';
			p8[count++] = Task->PLCTaskIDAckNum/1%10 +'0';
			p8[count++] = '/';
			p8[count++] = Task->PLCTaskIDAddNum/10%10 +'0';
			p8[count++] = Task->PLCTaskIDAddNum/1%10 +'0';
			p8[count++] = ' ';
	
			p8[count++] = PLCManage->ReportTaskID/10%10 +'0';
			p8[count++] = PLCManage->ReportTaskID/1%10 +'0';
			p8[count++] = '#';
	
	
			QCSG_LogToRS232Port((u32)PORTn,ADDR_YBWHZ_DATABUFF,count);
		}
	////////////////////////////ybwhz测试/////////////////////////////

	
	pAckTimer[0] = PLCManage->AMRTimeOut;
	Result = DLT645FrameDcompress(&DLT645Frame, DataBuf, DataLen);
	if(Result != NO_ERROR) return Result;

	if(Task->SrcDataType == DATA_TYPE_STRUCT)
	{
		if(MemCompare(DLT645Frame.Addr, Task->Addr, METER_ADDR_SIZE) != 0) return ERROR_WRONG_ADDR;
		if(GetProtocolTypeByCtrlCode(DLT645Frame.CtrlCode & DLT_645_CODE_MASK) != Task->Protocol) return ERROR_InvalidData;

		Task->Cur645_DI = 0;
		Task->Cur645_DI_Step = 0;
		Index = Task->CurNW_DI_TblIndex;		
		if((DLT645Frame.CtrlCode & DLT_645_ERROR_BIT) == 0)
		{		
			Cur645_DI = Get645FrameDataID(&DLT645Frame, Task->Protocol);
			while(Task->Cur645_DI != 0xFFFFFFFF)
			{
				if(Task->Protocol == DLT_645_PROTOCOL_97)
				{
					Task->Cur645_DI = gc_stQCSGAFN0C_0D_DLT645_Table[Index].stDLT64597Resolve[Task->Cur645_DI_Step].u32Ident;
					TempOffSet = gc_stQCSGAFN0C_0D_DLT645_Table[Index].stDLT64597Resolve[Task->Cur645_DI_Step].u8BlDataLen;
				}
				else
				{	
					Task->Cur645_DI = gc_stQCSGAFN0C_0D_DLT645_Table[Index].stDLT64507Resolve[Task->Cur645_DI_Step].u32Ident;
					TempOffSet = gc_stQCSGAFN0C_0D_DLT645_Table[Index].stDLT64507Resolve[Task->Cur645_DI_Step].u8BlDataLen;
				}
				if(Cur645_DI == Task->Cur645_DI) break;
				OffSet += TempOffSet;
				Task->Cur645_DI_Step++;
			}
			if(Cur645_DI != Task->Cur645_DI) return ERROR_InvalidData;	
		}
		else
		{
			while((Task->Cur645_DI != 0xFFFFFFFF) && (Task->Cur645_DI_Step < (PLCManage->ReportTaskID - RT_AMR_TASK_ID_START)))
			{
				if(Task->Protocol == DLT_645_PROTOCOL_97)
				{
					Task->Cur645_DI = gc_stQCSGAFN0C_0D_DLT645_Table[Index].stDLT64597Resolve[Task->Cur645_DI_Step].u32Ident;
					TempOffSet = gc_stQCSGAFN0C_0D_DLT645_Table[Index].stDLT64597Resolve[Task->Cur645_DI_Step].u8BlDataLen;
				}
				else
				{	
					Task->Cur645_DI = gc_stQCSGAFN0C_0D_DLT645_Table[Index].stDLT64507Resolve[Task->Cur645_DI_Step].u32Ident;
					TempOffSet = gc_stQCSGAFN0C_0D_DLT645_Table[Index].stDLT64507Resolve[Task->Cur645_DI_Step].u8BlDataLen;
				}
				OffSet += TempOffSet;
				Task->Cur645_DI_Step++;
			}
			Task->Cur645_DI_Step = PLCManage->ReportTaskID - RT_AMR_TASK_ID_START;
		}
		
		AMRCtrl->Cur645DataLen = 0;
		Result = Convert645ToNWAMRData(&DLT645Frame, Index, Task->Cur645_DI_Step, Task->Protocol, AMRCtrl->Cur645Data, &AMRCtrl->Cur645DataLen);	

		OffSet += sizeof(QCSG_PnListStruct);
		MR((u32)&Task->AckData[OffSet], (u32)AMRCtrl->Cur645Data, AMRCtrl->Cur645DataLen);
		if((OffSet + AMRCtrl->Cur645DataLen) >= Task->AckDataLen)
		{
			Task->AckDataLen = OffSet + AMRCtrl->Cur645DataLen;
		}
		
		if(Task->PLCTaskIDAckNum >= Task->PLCTaskIDAddNum)
		{
			if((Task->Protocol == DLT_645_PROTOCOL_97) && (Task->AckDataLen > sizeof(QCSG_PnListStruct)))
			{
				DataLen = gc_stQCSGAFN0C_0D_DLT645_Table[Task->CurNW_DI_TblIndex].u16Dlen;		
				if((u16)DataLen > (Task->AckDataLen - sizeof(QCSG_PnListStruct)))
				{	
					LeftLen = DataLen - (Task->AckDataLen - sizeof(QCSG_PnListStruct));
					for(i = 0; i < LeftLen; i++)
					{
						Task->AckData[Task->AckDataLen++] = 0xFF;
					}
				}
			}
		}
	}
	else if(Task->SrcDataType == DATA_TYPE_RELAY)
	{
		if(MemCompare(DLT645Frame.Addr, Task->Addr, METER_ADDR_SIZE) != 0) return ERROR_WRONG_ADDR;
		if(PLCManage->ReportTaskID != (Task->PLCTaskIDAddNum - 1))  return ERROR_WRONG_ACCESS;
		Task->AckData[Task->AckDataLen++] = Task->RelayType;
		Task->AckData[Task->AckDataLen++] = DataLen;
		MR((u32)&Task->AckData[Task->AckDataLen], (u32)DataBuf, DataLen);
		Task->AckDataLen += DataLen;
	}
	else if(Task->SrcDataType == DATA_TYPE_FRAME)
	{
		if(MemCompare(DLT645Frame.Addr, Task->Addr, METER_ADDR_SIZE) != 0) return ERROR_WRONG_ADDR;
		if(PLCManage->ReportTaskID != (Task->PLCTaskIDAddNum - 1))  return ERROR_WRONG_ACCESS;
		MR((u32)&Task->AckData[Task->AckDataLen], (u32)DataBuf, DataLen);
		Task->AckDataLen += DataLen;
	}
	else //if(Task->SrcDataType == DATA_TYPE_BCAST_CMD)
	{
		
	}

	if(Task->PLCTaskIDAckNum >= Task->PLCTaskIDAddNum)
	{//实时数据已经全部回复了
	if((AMRCtrl->OldState == AMR_WaitRx)&& (AMRCtrl->AMR_ID_Step == AMR_ALARM_TASK_ID)&& (AMRCtrl->PLCTaskIDAckNum < AMRCtrl->PLCTaskIDAddNum))
	{
		//周期抄表还没有抄完 则跳转接收周期抄表数据
		Task->Flag |= RT_AMR_DATA_READY;
		AMRCtrl->State = AMR_WaitRx;
		pAckTimer[0] = PLCManage->AMRTimeOut;
	}
	else
		{
		Task->Flag |= RT_AMR_DATA_READY;
		AMRCtrl->State = AMR_Pause;
		pAckTimer[0] = AMR_PAUSE_MAX_TIME;
		}
	}

	return Result;
}



ResultEnum PLC_AMR_ResumeProcess(u32 PORTn, AMRCtrlStruct* AMRCtrl, PLCManageStruct* PLCManage)
{
	u16* pAckTimer;
	ResultEnum Result = NO_ERROR;
	Terminal_Router_TypeDef* pTerminalRouter = Terminal_Router;
	pAckTimer = (u16*)GetUartPortAckTimerAddr(PORTn);
	if(pAckTimer[0] != 0) return ERROR_WRONG_TIME;

if((AMRCtrl->OldState == AMR_WaitRx)&& (AMRCtrl->AMR_ID_Step == AMR_ALARM_TASK_ID))
{
	AMRCtrl->State = AMR_WaitRx;
}
else
{
	AMRCtrl->State = AMRCtrl->OldState;
	if(AMRCtrl->OldState != AMR_Idle)
	{
		AMRCtrl->MeterIndex--;
		if(AMRCtrl->AMR_ID_Step == AMR_NORMAL_TASK_ID)
		{
			AMRCtrl->NormalTask->PnListIndex--;
		}
		else if(AMRCtrl->AMR_ID_Step == AMR_RELAY_TASK_ID)
		{
			AMRCtrl->RelayTask->CurTaskID--;
		}
		else 
		{

