gdgly/NUC97X_JS/STM32F4xx/CSG/QCSG_Task/CH_PLC_AMR_Task.c
		}
		Result = AMR_SwitchToNextMeter(PORTn, AMRCtrl);
		if(Result == NO_ERROR)
		{
			AMRCtrl->State = AMR_Tx;
			pTerminalRouter->RouterInitTask = PLC_ADD_TASK_DONE + 1;
			MC(0, (u32)PLCManage->AMR_Data, sizeof(NwDIAMRDataStruct) * SIZE_12);
			SwitchMeterClearAMRInfo(AMRCtrl);
		}
		else
		{
			AMRCtrl->State = AMR_Idle;
			AMRCtrl->AMR_ID = 0;
		}
	}
	else
	{
		AMRCtrl->State = AMR_Idle;
		AMRCtrl->AMR_ID = 0;
	}
	WarningCancel(PORTn);
}
	return Result;
}


//容错机制
void PLC_CheckModle(u32 PORTn, PLCManageStruct* PLCManage)
{
	u16* pAckTimer;
	QCSGLocalFrameStruct LocalFrame;
	Terminal_Router_TypeDef* pTerminalRouter = Terminal_Router;
	Terminal_Ram_TypeDef* pTerminalRam = Terminal_Ram;
	AMRCtrlStruct* AMRCtrl = (AMRCtrlStruct*)Get_AMR_TaskCtrlAddr(PORTn);
	pAckTimer = (u16*)GetUartPortAckTimerAddr(PORTn);

	switch(pTerminalRouter->RouterInitTask)
	{
		case PLC_CHECK_MODLE_TASK_NUM:
			PLC_TxCheckUnfinishTaskNum(PORTn, PLCManage, &LocalFrame);
			break;
		case PLC_CHECK_MODLE_TASK_NUM_WAIT_ACK:
			if((PLCManage->Flag & PLC_FLAG_READ_UNFINISH_TASK_DONE) != 0)
			{
				PLCManage->Flag &= ~PLC_FLAG_READ_UNFINISH_TASK_DONE;
				if((AMRCtrl->PLCTaskIDAddNum - AMRCtrl->PLCTaskIDAckNum) != pTerminalRouter->UnfinishTaskNum)
				{// 模块未完成任务数与终端不一致，则进入初始化任务步骤
					//pTerminalRouter->RouterInitTask++;
					PLCManage->State = PLC_AMR_STATE;
					AMRCtrl->State = AMR_Tx;
					pAckTimer[0] = 0;
					pTerminalRouter->RouterInitTask = PLC_ADD_TASK_STOP_TASK;
					pTerminalRouter->RetryCnt = 0;
				}
				else
				{// 模块未完成任务数与终端一致，则
					//pTerminalRouter->RouterInitTask = PLC_FILE_SYNC_READ_NODE_INFO;
					PLCManage->State = PLC_AMR_STATE;
					AMRCtrl->State = AMRCtrl->OldState;
					pTerminalRouter->RouterInitTask = pTerminalRouter->Old_RouterInitTask;
					pTerminalRouter->RetryCnt = 0;
				}
			}
			else
			{
				if(pTerminalRam->RouterAck_S_Timer == 0)
				{
					pTerminalRouter->RouterInitTask--;
				}
			}
			break;
		default:
			pTerminalRouter->RouterInitTask = 0;
			break;
		
	}
}



//err20190403 载波模块测试
void PLC_YBWHZ_Test(u32 PORTn, PLCManageStruct* PLCManage)
{
//	u16* pAckTimer;
	QCSGLocalFrameStruct LocalFrame;
	Terminal_Router_TypeDef* pTerminalRouter = Terminal_Router;
	Terminal_Ram_TypeDef* pTerminalRam = Terminal_Ram;
	AMRCtrlStruct* AMRCtrl = (AMRCtrlStruct*)Get_AMR_TaskCtrlAddr(PORTn);
	//pAckTimer = (u16*)GetUartPortAckTimerAddr(PORTn);

	switch(pTerminalRouter->RouterInitTask)
	{
		case PLC_YBWHZ_TEST_NUM1:
			PLC_Tx_YBWHZ_Test(PORTn, PLCManage, &LocalFrame);
			break;
		case PLC_YBWHZ_TEST_NUM1_WAIT_ACK:
			if((PLCManage->Flag & PLC_FLAG_YBWHZ_TEST_DONE) != 0)
			{
				PLCManage->Flag &= ~PLC_FLAG_YBWHZ_TEST_DONE;
				pTerminalRouter->RouterInitTask++;
				PLCManage->State = PLC_AMR_STATE;
				AMRCtrl->State = AMRCtrl->OldState;
				pTerminalRouter->RouterInitTask = pTerminalRouter->Old_RouterInitTask;
				pTerminalRouter->RetryCnt = 0;
				/*if((AMRCtrl->PLCTaskIDAddNum - AMRCtrl->PLCTaskIDAckNum) != pTerminalRouter->UnfinishTaskNum)
				{// 模块未完成任务数与终端不一致，则进入初始化任务步骤
					//pTerminalRouter->RouterInitTask++;
					PLCManage->State = PLC_AMR_STATE;
					AMRCtrl->State = AMR_Tx;
					pAckTimer[0] = 0;
					pTerminalRouter->RouterInitTask = PLC_ADD_TASK_STOP_TASK;
					pTerminalRouter->RetryCnt = 0;
				}
				else
				{// 模块未完成任务数与终端一致，则
					//pTerminalRouter->RouterInitTask = PLC_FILE_SYNC_READ_NODE_INFO;
					PLCManage->State = PLC_AMR_STATE;
					AMRCtrl->State = AMRCtrl->OldState;
					pTerminalRouter->RouterInitTask = pTerminalRouter->Old_RouterInitTask;
					pTerminalRouter->RetryCnt = 0;
				}*/
			}
			else
			{
				if(pTerminalRam->RouterAck_S_Timer == 0)
				{
					pTerminalRouter->RouterInitTask--;
				}
			}
			break;
		default:
			pTerminalRouter->RouterInitTask = 0;
			break;
		
	}
	
}


ResultEnum PLC_TxCheckUnfinishTaskNum(u32 PORTn, PLCManageStruct* PLCManage, QCSGLocalFrameStruct* LocalFrame)
{
	u32 FrameLen = 0, AddrTxBuf = 0;
	UartTxReqStruct UartTxReq;
	Terminal_Router_TypeDef* pTerminalRouter = Terminal_Router;
	Terminal_Ram_TypeDef* pTerminalRam = Terminal_Ram;
	
	if(pTerminalRam->RouterAck_S_Timer != 0) return ERROR_WRONG_TIME;
	
	if(pTerminalRouter->RetryCnt < PLC_CMD_MAX_CNT)
	{
		MC(0, (u32)LocalFrame, sizeof(QCSGLocalFrameStruct));
		pTerminalRam->RouterAck_S_Timer = PLC_RECOGNIZE_TIME_OUT;
		LocalFrame->FC = LOCAL_FRAME_PRM_BIT;
		LocalFrame->AFN = LOCAL_FRAME_AFN_02;
		LocalFrame->SEQ = PLCManage->SEQ++;
		LocalFrame->DI = 0xE8000203;
		LocalFrame->DataLen = 0;

		AddrTxBuf = GetUartPortTxBuf(PORTn);
		FrameLen = BuildLocalModuleFrame((u8*)AddrTxBuf, LocalFrame);
		MC(0, (u32)&UartTxReq, sizeof(UartTxReqStruct));				
		UartTxReq.SrcTask = TASK_ID_PLC_AMR;//待修改
		UartTxReq.NeedAck = 1;
		UartTxReq.FrameType = FRAME_TYPE_QCSG_LOCAL;
		UartTxReq.RetryCnt = 0;
		UartTxReq.BpsCtrl = 0;
		UartTxReq.TimeOut = PLC_RECOGNIZE_TIME_OUT;
		UartTxReq.DataLen = FrameLen;
		UartTxReq.DataBuf = (u8*)AddrTxBuf;
		if(UartPortTxReqNew(PORTn, &UartTxReq) == NO_ERROR)
		{
			pTerminalRouter->RouterInitTask++;
			pTerminalRouter->RetryCnt++;
		}
	}
	else
	{
		PLCManage->State = PLC_RESET_INIT;
		pTerminalRouter->RouterResetCnt = 0;		
		pTerminalRouter->RouterInitTask = 0;
		pTerminalRouter->RetryCnt = 0;
	}	
	return NO_ERROR;
}

ResultEnum PLC_TxCheckRemainTask(u32 PORTn, PLCManageStruct* PLCManage, QCSGLocalFrameStruct* LocalFrame)
{
	u32 FrameLen = 0, AddrTxBuf = 0;
	UartTxReqStruct UartTxReq;
	Terminal_Router_TypeDef* pTerminalRouter = Terminal_Router;
	Terminal_Ram_TypeDef* pTerminalRam = Terminal_Ram;
	
	if(pTerminalRam->RouterAck_S_Timer != 0) return ERROR_WRONG_TIME;
	
	if(pTerminalRouter->RetryCnt < PLC_CMD_MAX_CNT)
	{
		MC(0, (u32)LocalFrame, sizeof(QCSGLocalFrameStruct));
		pTerminalRam->RouterAck_S_Timer = PLC_WAIT_ACK_TIME_OUT;
		LocalFrame->FC = LOCAL_FRAME_PRM_BIT;
		LocalFrame->AFN = LOCAL_FRAME_AFN_02;
		LocalFrame->SEQ = PLCManage->SEQ++;
		LocalFrame->DI = 0xE8000206;
		LocalFrame->DataLen = 0;

		AddrTxBuf = GetUartPortTxBuf(PORTn);
		FrameLen = BuildLocalModuleFrame((u8*)AddrTxBuf, LocalFrame);
		MC(0, (u32)&UartTxReq, sizeof(UartTxReqStruct));				
		UartTxReq.SrcTask = TASK_ID_PLC_AMR;//待修改
		UartTxReq.NeedAck = 1;
		UartTxReq.FrameType = FRAME_TYPE_QCSG_LOCAL;
		UartTxReq.RetryCnt = 0;
		UartTxReq.BpsCtrl = 0;
		UartTxReq.TimeOut = PLC_WAIT_ACK_TIME_OUT;
		UartTxReq.DataLen = FrameLen;
		UartTxReq.DataBuf = (u8*)AddrTxBuf;
		if(UartPortTxReqNew(PORTn, &UartTxReq) == NO_ERROR)
		{
			pTerminalRouter->RouterInitTask++;
			pTerminalRouter->RetryCnt++;
		}
	}
	else
	{
		//PLCManage->State = PLC_RESET_INIT;
		pTerminalRouter->RouterResetCnt = 0;		
		pTerminalRouter->RouterInitTask = PLC_ADD_TASK_INIT;
		pTerminalRouter->RetryCnt = 0;
	}	
	return NO_ERROR;
}

