gdgly/NUC97X_JS/STM32F4xx/CSG/QCSG_Task/CH_PLC_AMR_Task.c
ResultEnum PLC_Tx_YBWHZ_Test(u32 PORTn, PLCManageStruct* PLCManage, QCSGLocalFrameStruct* LocalFrame)
{
	u32 FrameLen = 0, AddrTxBuf = 0;
	UartTxReqStruct UartTxReq;
	Terminal_Router_TypeDef* pTerminalRouter = Terminal_Router;
	Terminal_Ram_TypeDef* pTerminalRam = Terminal_Ram;
	
	if(pTerminalRam->RouterAck_S_Timer != 0) return ERROR_WRONG_TIME;
	
	if(pTerminalRouter->RetryCnt < PLC_CMD_MAX_CNT)
	{
		MC(0, (u32)LocalFrame, sizeof(QCSGLocalFrameStruct));
		pTerminalRam->RouterAck_S_Timer = PLC_RECOGNIZE_TIME_OUT;
		LocalFrame->FC = LOCAL_FRAME_PRM_BIT;
		LocalFrame->AFN = LOCAL_FRAME_AFN_03;
		LocalFrame->SEQ = PLCManage->SEQ++;
		LocalFrame->DI = 0xE8030311;//0xE8000203;
		LocalFrame->DataLen = 0;
		LocalFrame->Data[LocalFrame->DataLen++] = (1);
		LocalFrame->Data[LocalFrame->DataLen++] = (1) >> 8;
		LocalFrame->Data[LocalFrame->DataLen++] = 3;

		AddrTxBuf = GetUartPortTxBuf(PORTn);
		FrameLen = BuildLocalModuleFrame((u8*)AddrTxBuf, LocalFrame);
		MC(0, (u32)&UartTxReq, sizeof(UartTxReqStruct));				
		UartTxReq.SrcTask = TASK_ID_PLC_AMR;//待修改
		UartTxReq.NeedAck = 1;
		UartTxReq.FrameType = FRAME_TYPE_QCSG_LOCAL;
		UartTxReq.RetryCnt = 0;
		UartTxReq.BpsCtrl = 0;
		UartTxReq.TimeOut = PLC_RECOGNIZE_TIME_OUT;
		UartTxReq.DataLen = FrameLen;
		UartTxReq.DataBuf = (u8*)AddrTxBuf;
		if(UartPortTxReqNew(PORTn, &UartTxReq) == NO_ERROR)
		{
			pTerminalRouter->RouterInitTask++;
			pTerminalRouter->RetryCnt++;
		}
	}
	else
	{
		PLCManage->State = PLC_RESET_INIT;
		pTerminalRouter->RouterResetCnt = 0;		
		pTerminalRouter->RouterInitTask = 0;
		pTerminalRouter->RetryCnt = 0;
	}	
	return NO_ERROR;
}

ResultEnum QCSG_LocalModuleFrameProcess(u32 PORTn, PLCManageStruct* PLCManage)
{	
	QCSGLocalFrameStruct LocalFrame;
	UartTaskCtrlStruct* pUTask;
	UartRxChCtrlStruct* UartRxChCtrl;
	ResultEnum Result = NO_ERROR;
	
	//u32 FrameLen = 0;
	//u8 DataType = 0, FrameType = 0;
	//u8* FrameBuf = (u8*)GetUartPortRxBuf(PORTn, DATA_TYPE_FRAME);
	//Result = UartPortRxReq(PORTn, FrameBuf, &FrameLen, &FrameType, &DataType);
	//if(Result != NO_ERROR) return Result;
	//if(FrameType != FRAME_TYPE_QCSG_LOCAL) return ERROR_WRONG_PROTOCOL;
	
	UartRxChCtrl = (UartRxChCtrlStruct*)GetUartPortRxChCtrl(PORTn);
	if(UartRxChCtrl == NULL) return ERROR_POINTER_NULL;
	if(UartRxChCtrl->Empty == BUFFER_EMPTY) return ERROR_BUF_EMPTY;
	if(UartRxChCtrl->FrameBuf == NULL) return ERROR_POINTER_NULL;	
	pUTask = (UartTaskCtrlStruct*)GetUartTaskCtrl(PORTn);
	if(pUTask == NULL) return ERROR_POINTER_NULL;
	pUTask->Flag |= UART_FLAG_RX_BUF_READ_DONE;
	UartRxChCtrl->Empty = BUFFER_EMPTY;
	if(UartRxChCtrl->FrameType != FRAME_TYPE_QCSG_LOCAL) return ERROR_WRONG_PROTOCOL;	

	MC(0, (u32)&LocalFrame, sizeof(QCSGLocalFrameStruct));
	Result = QCSG_LocalFrameDecompress(UartRxChCtrl->FrameBuf, (u32)UartRxChCtrl->FrameLen, &LocalFrame);
	if(Result != NO_ERROR) return Result;
	#if LOG_1376_2==1//0=没,1=有
		LOG(13762,0,PLC_PORT,UartRxChCtrl->FrameBuf, UartRxChCtrl->FrameLen,0);//入口:TR=0接收=1发送;protocol=13761,13762,13763,6451997,6452007;ascii=0为hex码=1本身为ascii码
	#endif

	PLCManage->LastRcvTicks = HAL_GetSystemTick();
	switch(LocalFrame.AFN)
	{
		case 0x00:
			LocalFrame_AFN00_Process(PORTn, &LocalFrame);
			break;
		case 0x01:
			LocalFrame_AFN01_Process(PORTn, &LocalFrame);
			break;
		case 0x02:
			LocalFrame_AFN02_Process(PORTn, &LocalFrame);
			break;
		case 0x03:
			LocalFrame_AFN03_Process(PORTn, &LocalFrame);
			break;
		case 0x04:
			LocalFrame_AFN04_Process(PORTn, &LocalFrame);
			break;
		case 0x05:
			LocalFrame_AFN05_Process(PORTn, &LocalFrame);
			break;
		case 0x06:
			LocalFrame_AFN06_Process(PORTn, &LocalFrame);
			break;
		case 0x07:
			LocalFrame_AFN07_Process(PORTn, &LocalFrame);
			break;
		default:
			break;
		
	}
	return NO_ERROR;
}



ResultEnum LocalFrame_AFN00_Process(u32 PORTn, QCSGLocalFrameStruct* LocalFrame)
{
	PLCManageStruct* PLCManage = (PLCManageStruct*)ADDR_PLCManageCtrl;
	Terminal_Router_TypeDef* pTerminalRouter = Terminal_Router;

	if(LocalFrame->DI == 0xE8010002)
	{
		return ERROR_WRONG_ACCESS;
	}
	
	switch(PLCManage->State)
	{
		case PLC_MODLE_RECOGNIZE:
			if(pTerminalRouter->RouterInitTask == PLC_RECOGNIZE_WAIT_INIT_FILE_ACK)
			{
				PLCManage->Flag |= PLC_FLAG_INIT_FILE_DONE;
			}
			if(pTerminalRouter->RouterInitTask == PLC_RECOGNIZE_WAIT_INIT_TASK_ACK)
			{
				PLCManage->Flag |= PLC_FLAG_INIT_TASK_DONE;
			}
			if(pTerminalRouter->RouterInitTask == PLC_RECOGNIZE_WAIT_SET_MODLE_ADDR_ACK)
			{
				PLCManage->Flag |= PLC_FLAG_SET_MODLE_ADDR_DONE;
			}
			break;
		case PLC_FILE_SYNC:
			if(pTerminalRouter->RouterInitTask == PLC_FILE_SYNC_WAIT_INIT_FILE_ACK)
			{
				PLCManage->Flag |= PLC_FLAG_INIT_FILE_DONE;
			}
			if(pTerminalRouter->RouterInitTask == PLC_FILE_SYNC_WAIT_ADD_NODE_ACK)
			{
				PLCManage->Flag |= PLC_FLAG_ADD_NODE_DONE;
			}
			if(pTerminalRouter->RouterInitTask == PLC_FILE_SYNC_WAIT_INIT_TASK_ACK)
			{
				PLCManage->Flag |= PLC_FLAG_INIT_TASK_DONE;
			}
			break;
		case PLC_FILE_ADD:
			if(pTerminalRouter->RouterInitTask == PLC_FILE_ADD_WAIT_ADD_NODE_ACK)
			{
				PLCManage->Flag |= PLC_FLAG_ADD_NODE_DONE;
			}
			break;
		case PLC_AMR_STATE:
			if(pTerminalRouter->RouterInitTask == PLC_ADD_TASK_STOP_TASK_WAIT_ACK)
			{
				PLCManage->Flag |= PLC_FLAG_STOP_TASK_DONE;
			}
			if(pTerminalRouter->RouterInitTask == PLC_ADD_TASK_INIT_WAIT_ACK)
			{
				PLCManage->Flag |= PLC_FLAG_INIT_TASK_DONE;
			}
			if(pTerminalRouter->RouterInitTask == PLC_ADD_TASK_ADD_ONE_WAIT_ACK)
			{
				PLCManage->Flag |= PLC_FLAG_ADD_ONE_TASK_DONE;
			}
			if(pTerminalRouter->RouterInitTask == PLC_ADD_TASK_START_TASK_WAIT_ACK)
			{
				PLCManage->Flag |= PLC_FLAG_START_TASK_DONE;
			}
			break;
	}
	return NO_ERROR;
}

ResultEnum LocalFrame_AFN01_Process(u32 PORTn, QCSGLocalFrameStruct* LocalFrame)
{
	
	return NO_ERROR;
}


ResultEnum LocalFrame_AFN02_Process(u32 PORTn, QCSGLocalFrameStruct* LocalFrame)
{
	switch(LocalFrame->DI)
	{
		case 0xE8000203:
			LocalFrame_AFN02_E8000203_Process(PORTn, LocalFrame);
			break;
		case 0xE8000206:
			LocalFrame_AFN02_E8000206_Process(PORTn, LocalFrame);
			break;
	}
	return NO_ERROR;
}
/*****************************************************************************************************
功     能: 	南网本地 PLC 协议写参数AFN=02, E8040204,返回查询未完成任务数
入口参 数: 	PORTn: 帧源端口号
			LocalFrame: 输入的源数据帧指针
返     回: 返回操作是否成功
编     写: nw
编写时 间; 2018-7-4
*****************************************************************************************************/
ResultEnum LocalFrame_AFN02_E8000203_Process(u32 PORTn, QCSGLocalFrameStruct* LocalFrame)
{
	u16 Index = 0;
	Terminal_Router_TypeDef* pTerminalRouter = Terminal_Router;
	PLCManageStruct* PLCManage = (PLCManageStruct*)ADDR_PLCManageCtrl;

	pTerminalRouter->UnfinishTaskNum = LocalFrame->Data[Index++];
	pTerminalRouter->UnfinishTaskNum += LocalFrame->Data[Index++] << 8;

	PLCManage->Flag |= PLC_FLAG_READ_UNFINISH_TASK_DONE;

	return NO_ERROR;		
}

