gdgly/NUC97X_JS/STM32F4xx/CSG/QCSG_Task/CH_PLC_AMR_Task.c
/*****************************************************************************************************
功     能: 	南网本地 PLC 协议写参数AFN=02, E8000206,查询剩余可分配任务数
入口参 数: 	PORTn: 帧源端口号
			LocalFrame: 输入的源数据帧指针
返     回: 返回操作是否成功
编     写: nw
编写时 间; 2018-7-4
*****************************************************************************************************/
ResultEnum LocalFrame_AFN02_E8000206_Process(u32 PORTn, QCSGLocalFrameStruct* LocalFrame)
{
	u16 Index = 0;
	Terminal_Router_TypeDef* pTerminalRouter = Terminal_Router;

	pTerminalRouter->ResDistribTaskNum = LocalFrame->Data[Index++];
	pTerminalRouter->ResDistribTaskNum += LocalFrame->Data[Index++] << 8;

	return NO_ERROR;		
}

ResultEnum LocalFrame_AFN03_Process(u32 PORTn, QCSGLocalFrameStruct* LocalFrame)
{
	switch(LocalFrame->DI)
	{
		case 0xE8000301:
			LocalFrame_AFN03_E8000301_Process(PORTn, LocalFrame);
			break;
		case 0xE8000302:
			LocalFrame_AFN03_E8000302_Process(PORTn, LocalFrame);
			break;
		case 0xE8000303:
			LocalFrame_AFN03_E8000303_Process(PORTn, LocalFrame);
			break;
		case 0xE8030304:
			break;
		case 0xE8000305:
			LocalFrame_AFN03_E8000305_Process(PORTn, LocalFrame);
			break;
		case 0xE8030306:
			break;
		case 0xE8000307:
			LocalFrame_AFN03_E8000307_Process(PORTn, LocalFrame);
			break;
		case 0xE8030308:
			break;
		case 0xE8040304:
			LocalFrame_AFN03_E8040304_Process(PORTn, LocalFrame);
			break;
		case 0xE8040306:
			LocalFrame_AFN03_E8040306_Process(PORTn, LocalFrame);
			break;
		case 0xE8040308:
			LocalFrame_AFN03_E8040308_Process(PORTn, LocalFrame);
			break;
		case 0xE8040311:
			LocalFrame_AFN03_E8040321_Process(PORTn, LocalFrame);//返回查询网络拓扑信息
			break;
		case 0xE8040312:
			LocalFrame_AFN03_E8040321_Process(PORTn, LocalFrame);//返回查询网络相位和台区信息
			break;
		case 0xE8040321:
			LocalFrame_AFN03_E8040321_Process(PORTn, LocalFrame);//返回批量查询入网节点版本信息
			break;
	}
	return NO_ERROR;
}

/*****************************************************************************************************
功     能: 	南网本地 PLC 协议写参数AFN=03, E8000301,查询本地通信模块厂商代码与版本信息
入口参 数: 	PORTn: 帧源端口号
			LocalFrame: 输入的源数据帧指针
返     回: 返回操作是否成功
编     写: zhaoyun
编写时 间; 2017-8-10
*****************************************************************************************************/
ResultEnum LocalFrame_AFN03_E8000301_Process(u32 PORTn, QCSGLocalFrameStruct* LocalFrame)
{
	u16 Index = 0;
	Terminal_Router_TypeDef* pTerminalRouter = Terminal_Router;

	pTerminalRouter->RouterMFCode[0] = LocalFrame->Data[Index++];
	pTerminalRouter->RouterMFCode[1] = LocalFrame->Data[Index++];
	
	pTerminalRouter->RouterICCode[0] = LocalFrame->Data[Index++];
	pTerminalRouter->RouterICCode[1] = LocalFrame->Data[Index++];

	pTerminalRouter->RouterVerDate[0] = LocalFrame->Data[Index++];
	pTerminalRouter->RouterVerDate[1] = LocalFrame->Data[Index++];
	pTerminalRouter->RouterVerDate[2] = LocalFrame->Data[Index++];

	pTerminalRouter->RouterVer[0] = LocalFrame->Data[Index++];
	pTerminalRouter->RouterVer[1] = LocalFrame->Data[Index++];

	return NO_ERROR;		
}

/*****************************************************************************************************
功     能: 	南网本地 PLC 协议写参数AFN=03, E8000302,查询本地通信模块运行模式信息
入口参 数: 	PORTn: 帧源端口号
			LocalFrame: 输入的源数据帧指针
返     回: 返回操作是否成功
编     写: zhaoyun
编写时 间; 2017-8-10
*****************************************************************************************************/
ResultEnum LocalFrame_AFN03_E8000302_Process(u32 PORTn, QCSGLocalFrameStruct* LocalFrame)
{
	//UARTCtrl_TypeDef* UARTCtrl;
	UartTaskCtrlStruct* UartTask;
	
	u16 Index = 0, FrameLen = 0;
	u32 AddrTxBuf = 0;	
	Terminal_Ram_TypeDef* pTerminalRam = Terminal_Ram;
	PLCManageStruct* PLCManage = (PLCManageStruct*)ADDR_PLCManageCtrl;
	Terminal_Router_TypeDef* pTerminalRouter = Terminal_Router;
	
	pTerminalRouter->RouterRunMode_1 = LocalFrame->Data[Index++];
	pTerminalRouter->MaxTxByte = LocalFrame->Data[Index++];
	pTerminalRouter->MaxTxByte += LocalFrame->Data[Index++] << 8;
	pTerminalRouter->MaxFileByte = LocalFrame->Data[Index++];
	pTerminalRouter->MaxFileByte += LocalFrame->Data[Index++] << 8;
	pTerminalRouter->MaxUpDateTime = LocalFrame->Data[Index++];

	MR((u32)pTerminalRouter->RouterAddr, (u32)&LocalFrame->Data[Index], METER_ADDR_SIZE);
	Index += METER_ADDR_SIZE;
	pTerminalRouter->MaxNodeNum = LocalFrame->Data[Index++];
	pTerminalRouter->MaxNodeNum += LocalFrame->Data[Index++] << 8;
	pTerminalRouter->TotalNodeNum = LocalFrame->Data[Index++];
	pTerminalRouter->TotalNodeNum += LocalFrame->Data[Index++] << 8;
	pTerminalRouter->MaxRWNodeNum = LocalFrame->Data[Index++];
	pTerminalRouter->MaxRWNodeNum += LocalFrame->Data[Index++] << 8;
	
	pTerminalRouter->RouterDate[0] = LocalFrame->Data[Index++];
	pTerminalRouter->RouterDate[1] = LocalFrame->Data[Index++];
	pTerminalRouter->RouterDate[2] = LocalFrame->Data[Index++];

	pTerminalRouter->RouterMFCode[0] = LocalFrame->Data[Index++];
	pTerminalRouter->RouterMFCode[1] = LocalFrame->Data[Index++];
	
	pTerminalRouter->RouterICCode[0] = LocalFrame->Data[Index++];
	pTerminalRouter->RouterICCode[1] = LocalFrame->Data[Index++];

	pTerminalRouter->RouterVerDate[0] = LocalFrame->Data[Index++];
	pTerminalRouter->RouterVerDate[1] = LocalFrame->Data[Index++];
	pTerminalRouter->RouterVerDate[2] = LocalFrame->Data[Index++];

	pTerminalRouter->RouterVer[0] = LocalFrame->Data[Index++];
	pTerminalRouter->RouterVer[1] = LocalFrame->Data[Index++];

	if(PLCManage->State == PLC_RESET_INIT)
	{
		LocalFrame->FC  &= ~(LOCAL_FRAME_PRM_BIT | LOCAL_FRAME_DIR_BIT);
		LocalFrame->AFN = LOCAL_FRAME_AFN_00;		
		LocalFrame->DI  = 0xE8010001;
		LocalFrame->DataLen = 2;
		LocalFrame->Data[0] = 0x00;
		LocalFrame->Data[1] = 0x00;
		
		//UARTCtrl = (UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(PORTn);
		UartTask = GetUartTaskCtrl(PORTn);
		AddrTxBuf = Get_ADDR_UARTnTx(PORTn);
		FrameLen = BuildLocalModuleFrame((u8*)AddrTxBuf, LocalFrame);
		//UARTCtrl->TxByte = FrameLen;
		UartTask->AckLen = FrameLen;
		UartTask->Flag |= UART_FLAG_TX_ACK;	
		pTerminalRam->RouterAck_S_Timer = 2;
	}
	else
	{
		PLCManage->Flag |= PLC_FLAG_READ_MODLE_INFO_DONE;
	}	
	return NO_ERROR;
}

