gdgly/NUC97X_JS/STM32F4xx/CSG/QCSG_Task/CH_PLC_AMR_Task.c
/*****************************************************************************************************
功     能: 	南网本地 PLC 协议写参数AFN=03, E8000303,查询本地通信模块主节点地址
入口参 数: 	PORTn: 帧源端口号
			LocalFrame: 输入的源数据帧指针
返     回: 返回操作是否成功
编     写: zhaoyun
编写时 间; 2017-8-10
*****************************************************************************************************/
ResultEnum LocalFrame_AFN03_E8000303_Process(u32 PORTn, QCSGLocalFrameStruct* LocalFrame)
{
	PLCManageStruct* PLCManage = (PLCManageStruct*)ADDR_PLCManageCtrl;
	Terminal_Router_TypeDef* pTerminalRouter = Terminal_Router;

	MR((u32)pTerminalRouter->RouterAddr, (u32)LocalFrame->Data, METER_ADDR_SIZE);
	PLCManage->Flag |= PLC_FLAG_READ_MODLE_ADDR_DONE;

	return NO_ERROR;
}

/*****************************************************************************************************
功     能: 	南网本地 PLC 协议写参数AFN=03, E8000305,查询本地通信模块从节点数量
入口参 数: 	PORTn: 帧源端口号
			LocalFrame: 输入的源数据帧指针
返     回: 返回操作是否成功
编     写: zhaoyun
编写时 间; 2017-8-10
*****************************************************************************************************/
ResultEnum LocalFrame_AFN03_E8000305_Process(u32 PORTn, QCSGLocalFrameStruct* LocalFrame)
{
	PLCManageStruct* PLCManage = (PLCManageStruct*)ADDR_PLCManageCtrl;
	Terminal_Router_TypeDef* pTerminalRouter = Terminal_Router;

	MR((u32)&pTerminalRouter->TotalNodeNum, (u32)LocalFrame->Data, 2);//err20180228-16 原代码:MR((u32)pTerminalRouter->TotalNodeNum, (u32)LocalFrame->Data, 2);//未取地址操作导致数据读地址错误。
	PLCManage->Flag |= PLC_FLAG_READ_NODE_NUM_DONE;

	return NO_ERROR;
}

/*****************************************************************************************************
功     能: 	南网本地 PLC 协议写参数AFN=03, E8000307,查询从节点主动注册进度
入口参 数: 	PORTn: 帧源端口号
			LocalFrame: 输入的源数据帧指针
返     回: 返回操作是否成功
编     写: zhaoyun
编写时 间; 2017-8-10
*****************************************************************************************************/
ResultEnum LocalFrame_AFN03_E8000307_Process(u32 PORTn, QCSGLocalFrameStruct* LocalFrame)
{
/*	PLCManageStruct* PLCManage = (PLCManageStruct*)ADDR_PLCManageCtrl;
	Terminal_Router_TypeDef* pTerminalRouter = Terminal_Router;

	MR((u32)&pTerminalRouter->TotalNodeNum, (u32)LocalFrame->Data, 2);
	PLCManage->Flag |= PLC_FLAG_READ_NODE_NUM_DONE;
*/
	return NO_ERROR;
}

/*****************************************************************************************************
功     能: 	南网本地 PLC 协议写参数AFN=03, E8040304,返回查询通信延时时长
入口参 数: 	PORTn: 帧源端口号
			LocalFrame: 输入的源数据帧指针
返     回: 返回操作是否成功
编     写: zhaoyun
编写时 间; 2017-8-10
*****************************************************************************************************/
ResultEnum LocalFrame_AFN03_E8040304_Process(u32 PORTn, QCSGLocalFrameStruct* LocalFrame)
{
/*	u16 TotalNodeNum = 0, Index = 0;
	PLCManageStruct* PLCManage = (PLCManageStruct*)ADDR_PLCManageCtrl;
	Terminal_Router_TypeDef* pTerminalRouter = Terminal_Router;

	TotalNodeNum = LocalFrame->Data[Index++];
	TotalNodeNum += LocalFrame->Data[Index++] << 8;

	if(TotalNodeNum != pTerminalRouter->TotalNodeNum) return ERROR_InvalidData;
	pTerminalRouter->CurReadNodeNum = LocalFrame->Data[Index++];
	
	MR((u32)ADDR_ReadPLCNodeBuf, (u32)&LocalFrame->Data[Index], pTerminalRouter->CurReadNodeNum * METER_ADDR_SIZE);
	PLCManage->Flag |= PLC_FLAG_READ_NODE_INFO_DONE;
*/
	return NO_ERROR;
}

/*****************************************************************************************************
功     能: 	南网本地 PLC 协议写参数AFN=03, E8040306,返回查询的从节点信息
入口参 数: 	PORTn: 帧源端口号
			LocalFrame: 输入的源数据帧指针
返     回: 返回操作是否成功
编     写: zhaoyun
编写时 间; 2017-8-10
*****************************************************************************************************/
ResultEnum LocalFrame_AFN03_E8040306_Process(u32 PORTn, QCSGLocalFrameStruct* LocalFrame)
{
	u16 TotalNodeNum = 0, Index = 0;
	PLCManageStruct* PLCManage = (PLCManageStruct*)ADDR_PLCManageCtrl;
	Terminal_Router_TypeDef* pTerminalRouter = Terminal_Router;

	TotalNodeNum = LocalFrame->Data[Index++];
	TotalNodeNum += LocalFrame->Data[Index++] << 8;

	pTerminalRouter->TotalNodeNum = TotalNodeNum;
	pTerminalRouter->CurReadNodeNum = LocalFrame->Data[Index++];
	
	MR((u32)ADDR_PLC_AMR_DataBuf, (u32)&LocalFrame->Data[Index], pTerminalRouter->CurReadNodeNum * METER_ADDR_SIZE);
	PLCManage->Flag |= PLC_FLAG_READ_NODE_INFO_DONE;

	return NO_ERROR;
}

/*****************************************************************************************************
功     能: 	南网本地 PLC 协议写参数AFN=03, E8040308,返回查询从节点的父节点
入口参 数: 	PORTn: 帧源端口号
			LocalFrame: 输入的源数据帧指针
返     回: 返回操作是否成功
编     写: zhaoyun
编写时 间; 2017-8-10
*****************************************************************************************************/
ResultEnum LocalFrame_AFN03_E8040308_Process(u32 PORTn, QCSGLocalFrameStruct* LocalFrame)
{
/*	u16 TotalNodeNum = 0, Index = 0;
	PLCManageStruct* PLCManage = (PLCManageStruct*)ADDR_PLCManageCtrl;
	Terminal_Router_TypeDef* pTerminalRouter = Terminal_Router;

	TotalNodeNum = LocalFrame->Data[Index++];
	TotalNodeNum += LocalFrame->Data[Index++] << 8;

	if(TotalNodeNum != pTerminalRouter->TotalNodeNum) return ERROR_InvalidData;
	pTerminalRouter->CurReadNodeNum = LocalFrame->Data[Index++];
	
	MR((u32)ADDR_ReadPLCNodeBuf, (u32)&LocalFrame->Data[Index], pTerminalRouter->CurReadNodeNum * METER_ADDR_SIZE);
	PLCManage->Flag |= PLC_FLAG_READ_NODE_INFO_DONE;
*/
	return NO_ERROR;
}


/*****************************************************************************************************
功     能: 	南网本地 PLC 协议写参数AFN=03, E8040311,返回查询网络拓扑信息
入口参 数: 	PORTn: 帧源端口号
			LocalFrame: 输入的源数据帧指针
返     回: 返回操作是否成功
编     写: ybwhz
编写时 间; 2019-4-4
*****************************************************************************************************/
ResultEnum LocalFrame_AFN03_E8040311_Process(u32 PORTn, QCSGLocalFrameStruct* LocalFrame)
{

	PLCManageStruct* PLCManage = (PLCManageStruct*)ADDR_PLCManageCtrl;
	PLCManage->Flag |= PLC_FLAG_YBWHZ_TEST_DONE;

	return NO_ERROR;
}

/*****************************************************************************************************
功     能: 	南网本地 PLC 协议写参数AFN=03, E8040312,返回查询网络相位和台区信息
入口参 数: 	PORTn: 帧源端口号
			LocalFrame: 输入的源数据帧指针
返     回: 返回操作是否成功
编     写: ybwhz
编写时 间; 2019-4-4
*****************************************************************************************************/
ResultEnum LocalFrame_AFN03_E8040312_Process(u32 PORTn, QCSGLocalFrameStruct* LocalFrame)
{

	PLCManageStruct* PLCManage = (PLCManageStruct*)ADDR_PLCManageCtrl;
	PLCManage->Flag |= PLC_FLAG_YBWHZ_TEST_DONE;

	return NO_ERROR;
}


