gdgly/NUC97X_JS/STM32F4xx/CSG/QCSG_Task/CH_PLC_AMR_Task.c
/*****************************************************************************************************
功     能: 	南网本地 PLC 协议写参数AFN=03, E8040321,返回批量查询入网节点版本信息
入口参 数: 	PORTn: 帧源端口号
			LocalFrame: 输入的源数据帧指针
返     回: 返回操作是否成功
编     写: ybwhz
编写时 间; 2019-4-3
备注:经测试东软宽带载波暂不支持该数据标识
*****************************************************************************************************/
ResultEnum LocalFrame_AFN03_E8040321_Process(u32 PORTn, QCSGLocalFrameStruct* LocalFrame)
{

	PLCManageStruct* PLCManage = (PLCManageStruct*)ADDR_PLCManageCtrl;
	PLCManage->Flag |= PLC_FLAG_YBWHZ_TEST_DONE;

	return NO_ERROR;
}



ResultEnum LocalFrame_AFN04_Process(u32 PORTn, QCSGLocalFrameStruct* LocalFrame)
{
	switch(LocalFrame->DI)
	{
		case 0xE8020401:
			break;
		case 0xE8020402:
			break;
		case 0xE8020403:
			break;
		case 0xE8020404:
			break;
		case 0xE8020405:
			break;
		case 0xE8020406:
			break;
	}
	return NO_ERROR;
}


ResultEnum LocalFrame_AFN05_Process(u32 PORTn, QCSGLocalFrameStruct* LocalFrame)
{
	ResultEnum Result = NO_ERROR;
	switch(LocalFrame->DI)
	{
		case 0xE8050501://上报任务数据
			Result = LocalFrame_AFN05_E8050501_Process(PORTn, LocalFrame);
			break;
		case 0xE8050502://上报从节点事件
			Result = LocalFrame_AFN05_E8050502_Process(PORTn, LocalFrame);
			break;
		case 0xE8050503://上报从节点信息
			Result = LocalFrame_AFN05_E8050503_Process(PORTn, LocalFrame);
			break;
		case 0xE8050504://上报从节点主动注册结束
			Result = LocalFrame_AFN05_E8050504_Process(PORTn, LocalFrame);
			break;
		case 0xE8050505://上报任务状态
			Result = LocalFrame_AFN05_E8050505_Process(PORTn, LocalFrame);
			break;
		default:
			Result = ERROR_NoSuchDataID;
			break;
	}
	return Result;
}

/*****************************************************************************************************
功     能: 	南网本地 PLC 协议写参数AFN=05, E8050501，PLC 模块上报任务数据
入口参 数: 	PORTn: 帧源端口号
			LocalFrame: 输入的源数据帧指针
返     回: 返回操作是否成功
编     写: zhaoyun
编写时 间; 2017-8-10
*****************************************************************************************************/
ResultEnum LocalFrame_AFN05_E8050501_Process(u32 PORTn, QCSGLocalFrameStruct* LocalFrame)
{
	UartTaskCtrlStruct* UartTask;
	AMRCtrlStruct* AMRCtrl;
	PLCManageStruct* PLCManage = (PLCManageStruct*)ADDR_PLCManageCtrl;
	u8* PLCDataBuf = (u8*)ADDR_PLC_AMR_DataBuf;
	u16 Index = 0;
	u32 AddrTxBuf = 0;

	//AMRCtrl = (AMRCtrlStruct*)Get_AMR_TaskCtrlAddr(PORTn);
	//if((AMRCtrl->State == AMR_Pause) || (AMRCtrl->State == AMR_RealTimeTx)) return ERROR_WRONG_ACCESS;

	//err20190308 当实时任务正在发送时，不应答上报帧，否则将丢失帧。(微功率无线)
	AMRCtrl = (AMRCtrlStruct*)Get_AMR_TaskCtrlAddr(PORTn);
	if((AMRCtrl->State == AMR_Pause) || (AMRCtrl->State == AMR_RealTimeTx)) return ERROR_WRONG_ACCESS;

	MR((u32)PLCManage->SrcAddr, (u32)LocalFrame->SrcAddr, METER_ADDR_SIZE);
	MR((u32)PLCManage->DstAddr, (u32)LocalFrame->DstAddr, METER_ADDR_SIZE);

	PLCManage->ReportTaskID = LocalFrame->Data[Index++];
	PLCManage->ReportTaskID += LocalFrame->Data[Index++] << 8;
	PLCManage->ReportDataLen = LocalFrame->Data[Index++];

	PLCManage->DataLenInDataBuf = PLCManage->ReportDataLen;
	MR((u32)PLCDataBuf, (u32)&LocalFrame->Data[Index], PLCManage->ReportDataLen);

	LocalFrame->FC  &= ~(LOCAL_FRAME_DIR_BIT | LOCAL_FRAME_PRM_BIT | LOCAL_FRAME_ADR_BIT);
	LocalFrame->AFN = LOCAL_FRAME_AFN_00;		
	LocalFrame->DI  = 0xE8010001;
	LocalFrame->DataLen = 2;
	LocalFrame->Data[0] = 0x00;
	LocalFrame->Data[1] = 0x00;
	
	UartTask = GetUartTaskCtrl(PORTn);
	AddrTxBuf = Get_ADDR_UARTnTx(PORTn);
	Index = BuildLocalModuleFrame((u8*)AddrTxBuf, LocalFrame);
	//UARTCtrl->TxByte = Index;
	UartTask->AckLen = Index;
	UartTask->Flag |= UART_FLAG_TX_ACK;	

	return NO_ERROR;		
}

/*****************************************************************************************************
功     能: 	南网本地 PLC 协议写参数AFN=05, E8050502，PLC 模块上报从节点事件
入口参 数: 	PORTn: 帧源端口号
			LocalFrame: 输入的源数据帧指针
返     回: 返回操作是否成功
编     写: zhaoyun
编写时 间; 2017-8-10
*****************************************************************************************************/
ResultEnum LocalFrame_AFN05_E8050502_Process(u32 PORTn, QCSGLocalFrameStruct* LocalFrame)
{
	//UARTCtrl_TypeDef* UARTCtrl;
	UartTaskCtrlStruct* UartTask;
	PLCManageStruct* PLCManage = (PLCManageStruct*)ADDR_PLCManageCtrl;
	u8* PLCDataBuf = (u8*)ADDR_PLC_AMR_DataBuf;
	u16 Index = 0;
	u32 AddrTxBuf = 0;

	MR((u32)PLCManage->SrcAddr, (u32)LocalFrame->SrcAddr, METER_ADDR_SIZE);
	MR((u32)PLCManage->DstAddr, (u32)LocalFrame->DstAddr, METER_ADDR_SIZE);

	PLCManage->ReportDataLen = LocalFrame->Data[Index++];
	PLCManage->DataLenInDataBuf = PLCManage->ReportDataLen;
	MR((u32)PLCDataBuf, (u32)&LocalFrame->Data[Index], PLCManage->ReportDataLen);

	LocalFrame->FC  &= ~(LOCAL_FRAME_DIR_BIT | LOCAL_FRAME_PRM_BIT | LOCAL_FRAME_ADR_BIT);
	LocalFrame->AFN = LOCAL_FRAME_AFN_00;		
	LocalFrame->DI  = 0xE8010001;
	LocalFrame->DataLen = 2;
	LocalFrame->Data[0] = 0x00;
	LocalFrame->Data[1] = 0x00;
	
	//UARTCtrl = (UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(PORTn);
	UartTask = GetUartTaskCtrl(PORTn);
	AddrTxBuf = Get_ADDR_UARTnTx(PORTn);
	Index = BuildLocalModuleFrame((u8*)AddrTxBuf, LocalFrame);
	//UARTCtrl->TxByte = Index;
	UartTask->AckLen = Index;
	UartTask->Flag |= UART_FLAG_TX_ACK;	

	return NO_ERROR;		
}

/*****************************************************************************************************
功     能: 	南网本地 PLC 协议写参数AFN=05, E8050503，PLC 模块上报从节点信息
入口参 数: 	PORTn: 帧源端口号
			LocalFrame: 输入的源数据帧指针
返     回: 返回操作是否成功
编     写: zhaoyun
编写时 间; 2017-8-10
*****************************************************************************************************/
ResultEnum LocalFrame_AFN05_E8050503_Process(u32 PORTn, QCSGLocalFrameStruct* LocalFrame)
{
	//UARTCtrl_TypeDef* UARTCtrl;
	UartTaskCtrlStruct* UartTask;
	PLCManageStruct* PLCManage = (PLCManageStruct*)ADDR_PLCManageCtrl;
	u8* PLCDataBuf = (u8*)ADDR_PLC_AMR_DataBuf;
	u16 Index = 0;
	u32 AddrTxBuf = 0;

	MR((u32)PLCManage->SrcAddr, (u32)LocalFrame->SrcAddr, METER_ADDR_SIZE);
	MR((u32)PLCManage->DstAddr, (u32)LocalFrame->DstAddr, METER_ADDR_SIZE);

	PLCManage->ReportDataLen = LocalFrame->Data[Index++];

	PLCManage->DataLenInDataBuf = PLCManage->ReportDataLen;
	MR((u32)PLCDataBuf, (u32)&LocalFrame->Data[Index], PLCManage->ReportDataLen);

	LocalFrame->FC  &= ~(LOCAL_FRAME_DIR_BIT | LOCAL_FRAME_PRM_BIT | LOCAL_FRAME_ADR_BIT);
	LocalFrame->AFN = LOCAL_FRAME_AFN_00;		
	LocalFrame->DI  = 0xE8010001;
	LocalFrame->DataLen = 2;
	LocalFrame->Data[0] = 0x00;
	LocalFrame->Data[1] = 0x00;
	
	//UARTCtrl = (UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(PORTn);
	UartTask = GetUartTaskCtrl(PORTn);
	AddrTxBuf = Get_ADDR_UARTnTx(PORTn);
	Index = BuildLocalModuleFrame((u8*)AddrTxBuf, LocalFrame);
	//UARTCtrl->TxByte = Index;
	UartTask->AckLen = Index;
	UartTask->Flag |= UART_FLAG_TX_ACK;	

	return NO_ERROR;		
}


