gdgly/NUC97X_JS/STM32F4xx/CSG/QCSG_Task/CH_PLC_AMR_Task.c
/*****************************************************************************************************
功     能: 	南网本地 PLC 协议写参数AFN=05, E8050504，PLC 模块上报从节点主动注册结束
入口参 数: 	PORTn: 帧源端口号
			LocalFrame: 输入的源数据帧指针
返     回: 返回操作是否成功
编     写: zhaoyun
编写时 间; 2017-8-10
*****************************************************************************************************/
ResultEnum LocalFrame_AFN05_E8050504_Process(u32 PORTn, QCSGLocalFrameStruct* LocalFrame)
{
	//UARTCtrl_TypeDef* UARTCtrl;
	UartTaskCtrlStruct* UartTask;
	u16 Index = 0;
	u32 AddrTxBuf = 0;
/*
	PLCManageStruct* PLCManage = (PLCManageStruct*)ADDR_PLCManageCtrl;
	u8* PLCDataBuf = (u8*)ADDR_PLC_DataBuf;

	MR((u32)PLCManage->SrcAddr, (u32)LocalFrame->SrcAddr, METER_ADDR_SIZE);
	MR((u32)PLCManage->DstAddr, (u32)LocalFrame->DstAddr, METER_ADDR_SIZE);

	PLCManage->ReportDataLen = LocalFrame->Data[Index++];

	PLCManage->DataLenInDataBuf = PLCManage->ReportDataLen;
	MR((u32)PLCDataBuf, (u32)&LocalFrame->Data[Index], PLCManage->ReportDataLen);
*/
	LocalFrame->FC  &= ~(LOCAL_FRAME_DIR_BIT | LOCAL_FRAME_PRM_BIT | LOCAL_FRAME_ADR_BIT);
	LocalFrame->AFN = LOCAL_FRAME_AFN_00;		
	LocalFrame->DI  = 0xE8010001;
	LocalFrame->DataLen = 2;
	LocalFrame->Data[0] = 0x00;
	LocalFrame->Data[1] = 0x00;
	
	//UARTCtrl = (UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(PORTn);
	UartTask = GetUartTaskCtrl(PORTn);
	AddrTxBuf = Get_ADDR_UARTnTx(PORTn);
	Index = BuildLocalModuleFrame((u8*)AddrTxBuf, LocalFrame);
	//UARTCtrl->TxByte = Index;
	UartTask->AckLen = Index;
	UartTask->Flag |= UART_FLAG_TX_ACK;	

	return NO_ERROR;		
}


/*****************************************************************************************************
功     能: 	南网本地 PLC 协议写参数AFN=05, E8050505，PLC 模块上报任务状态
入口参 数: 	PORTn: 帧源端口号
			LocalFrame: 输入的源数据帧指针
返     回: 返回操作是否成功
编     写: zhaoyun
编写时 间; 2017-8-10
//ybwhz 上报任务状态 01:抄读电能表未响应  FF:其他错误(任务超时)
*****************************************************************************************************/
ResultEnum LocalFrame_AFN05_E8050505_Process(u32 PORTn, QCSGLocalFrameStruct* LocalFrame)
{

	//UARTCtrl_TypeDef* UARTCtrl;
	UartTaskCtrlStruct* UartTask;
	u16 Index = 0;
	u32 AddrTxBuf = 0;
//台体测试
	//Terminal_Router_TypeDef* pTerminalRouter = Terminal_Router;
//	AMRCtrlStruct* AMRCtrl = (AMRCtrlStruct*)Get_AMR_TaskCtrlAddr(PORTn);
	//AlarmAMRDataStruct* AlarmAMRData = (AlarmAMRDataStruct*)ADDR_AlarmTaskAMRDataBuf_New;
	//PLCManageStruct* PLCManage = (PLCManageStruct*)ADDR_PLCManageCtrl;
	//u16* pAckTimer;
	//pAckTimer = (u16*)GetUartPortAckTimerAddr(PORTn);
//台体测试
/*	
	PLCManageStruct* PLCManage = (PLCManageStruct*)ADDR_PLCManageCtrl;
	u8* PLCDataBuf = (u8*)ADDR_PLC_DataBuf;
	

	MR((u32)PLCManage->SrcAddr, (u32)LocalFrame->SrcAddr, METER_ADDR_SIZE);
	MR((u32)PLCManage->DstAddr, (u32)LocalFrame->DstAddr, METER_ADDR_SIZE);

	PLCManage->ReportDataLen = LocalFrame->Data[Index++];

	PLCManage->DataLenInDataBuf = PLCManage->ReportDataLen;
	MR((u32)PLCDataBuf, (u32)&LocalFrame->Data[Index], PLCManage->ReportDataLen);
*/
		//err20190222 暂时去掉否则当有数据项未应答时会等两倍超时时间才判定OUTTIME，抄下一个表
		//不确定对台体是否会有影响？
	//pAckTimer[0] = PLCManage->AMRTimeOut;//台体测试 未接表时回复无数据内容 防止自动同步档案

	LocalFrame->FC  &= ~(LOCAL_FRAME_DIR_BIT | LOCAL_FRAME_PRM_BIT | LOCAL_FRAME_ADR_BIT);
	LocalFrame->AFN = LOCAL_FRAME_AFN_00;		
	LocalFrame->DI  = 0xE8010001;
	LocalFrame->DataLen = 2;
	LocalFrame->Data[0] = 0x00;
	LocalFrame->Data[1] = 0x00;
	
	//UARTCtrl = (UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(PORTn);
	UartTask = GetUartTaskCtrl(PORTn);
	AddrTxBuf = Get_ADDR_UARTnTx(PORTn);
	Index = BuildLocalModuleFrame((u8*)AddrTxBuf, LocalFrame);
	//UARTCtrl->TxByte = Index;
	UartTask->AckLen = Index;
	UartTask->Flag |= UART_FLAG_TX_ACK;	

	/*AMRCtrl->PLCTaskIDAckNumErr++;
	if((AMRCtrl->PLCTaskIDAckNum + AMRCtrl->PLCTaskIDAckNumErr)< AMRCtrl->PLCTaskIDAddNum) return ERROR_WRONG_LENGTH;
		//周期抄表任务未上报完则继续等待
	pAckTimer = (u16*)GetUartPortAckTimerAddr(PORTn);
	pAckTimer[0] = 0;
	
	//AlarmAMRData->State[1] = 0x01;	//数据已更新
	Result = AMR_SwitchToNextMeter(PORTn, AMRCtrl);
	if(Result == NO_ERROR)
	{
		AMRCtrl->State = AMR_Tx;
		pTerminalRouter->RouterInitTask = PLC_ADD_TASK_DONE + 1;
		SwitchMeterClearAMRInfo(AMRCtrl);
	}
	else if(Result == ERROR_NO_AMR_TASK)
	{
		AMRCtrl->State = AMR_Idle;
		AMRCtrl->AMR_ID = 0;
		WarningCancel(PORTn);
	}
	else
	{
	
	}
	*/


	return NO_ERROR;		
}

ResultEnum LocalFrame_AFN06_Process(u32 PORTn, QCSGLocalFrameStruct* LocalFrame)
{
	switch(LocalFrame->DI)
	{
		case 0xE8060601:
			
			break;	
		default:
			break;
	}
	return NO_ERROR;
}

ResultEnum LocalFrame_AFN07_Process(u32 PORTn, QCSGLocalFrameStruct* LocalFrame)
{
	switch(LocalFrame->DI)
	{
		case 0xE8020701:
			break;
		case 0xE8020702:
			break;
		case 0xE8000703:
			break;
		case 0xE8000704:
			break;
		case 0xE8030705:
			break;
		case 0xE8040705:
			break;
		default:
			break;
	}
	return NO_ERROR;
}




void ConvertTerminalAddrToBCD(u32 TerminalAddr, u32 TerminalLocation, u8* BCDAddr)
{
/*	u8 BCD = 0;
	BCD = (TerminalAddr /10) % 10;
	BCD <<= 8;
	BCD += TerminalAddr % 10;	
	BCDAddr[0] = BCD;

	BCD = (TerminalAddr /1000) % 10;
	BCD <<= 8;
	BCD += (TerminalAddr /100) % 10;;	
	BCDAddr[1] = BCD;

	BCD = (TerminalAddr /100000) % 10;
	BCD <<= 8;
	BCD += (TerminalAddr /10000) % 10;;	
	BCDAddr[2] = BCD;

	BCD = (TerminalAddr /10000000) % 10;
	BCD <<= 8;
	BCD += (TerminalAddr /1000000) % 10;;	
	BCDAddr[3] = BCD;

	BCDAddr[4] = (u8)TerminalLocation;
	BCDAddr[5] = (u8)(TerminalLocation >> 8);
*/
	BCDAddr[0] = TerminalAddr;
	BCDAddr[1] = TerminalAddr >> 8;
	BCDAddr[2] = TerminalAddr >> 16;

	BCDAddr[3] = TerminalLocation;
	BCDAddr[4] = TerminalLocation >> 8;
	BCDAddr[5] = TerminalLocation >> 16;
}


void DisplayRouterVer(u32 PORTn)
{
	u32 i;
	u8*p8;
	
	Terminal_Router_TypeDef* pTerminalRouter = Terminal_Router;
	i = pTerminalRouter->RouterMFCode[0];
	i += pTerminalRouter->RouterMFCode[1] << 8;
	switch((u16)i)											//路由器类型:0=保留,1=正泰,2=鼎信,3=东软,4=晓晨,5=瑞斯康
	{
		case (('5'<<8)+'0'):
			CopyString((u8 *)"正泰载波",(u8*)ADDR_DATABUFF);//拷贝字符串;返回拷贝字符串字节数(不计结束0)
			break;
		case (('T'<<8)+'C'):
			CopyString((u8 *)"鼎信载波",(u8*)ADDR_DATABUFF);//拷贝字符串;返回拷贝字符串字节数(不计结束0)
			break;
		case (('E'<<8)+'S'):
			CopyString((u8 *)"东软载波",(u8*)ADDR_DATABUFF);//拷贝字符串;返回拷贝字符串字节数(不计结束0)
			break;
		case (('C'<<8)+'X'):
			CopyString((u8 *)"晓程载波",(u8*)ADDR_DATABUFF);//拷贝字符串;返回拷贝字符串字节数(不计结束0)
			break;
		case (('0'<<8)+'1'):
			CopyString((u8 *)"瑞斯康  ",(u8*)ADDR_DATABUFF);//拷贝字符串;返回拷贝字符串字节数(不计结束0)
			break;
		case (('L'<<8)+'H'):
			CopyString((u8 *)"力合微  ",(u8*)ADDR_DATABUFF);//拷贝字符串;返回拷贝字符串字节数(不计结束0)
			break;
		case (('N'<<8)+'X'):
			CopyString((u8 *)"讯能载波",(u8*)ADDR_DATABUFF);//拷贝字符串;返回拷贝字符串字节数(不计结束0)
			break;
		case (('Q'<<8)+'L'):
			CopyString((u8 *)"钱龙载波",(u8*)ADDR_DATABUFF);//拷贝字符串;返回拷贝字符串字节数(不计结束0)
			break;
		case (('R'<<8)+'H'):
			CopyString((u8 *)"华瑞载波",(u8*)ADDR_DATABUFF);//拷贝字符串;返回拷贝字符串字节数(不计结束0)
			break;			
		case (('M'<<8)+'X'):
			CopyString((u8 *)"麦希载波",(u8*)ADDR_DATABUFF);//拷贝字符串;返回拷贝字符串字节数(不计结束0)
			break;
		case (('F'<<8)+'C'):
			CopyString((u8 *)"友讯达  ",(u8*)ADDR_DATABUFF);//拷贝字符串;返回拷贝字符串字节数(不计结束0)
			break;
		case (('N'<<8)+'W'):
			CopyString((u8 *)"有方载波",(u8*)ADDR_DATABUFF);//拷贝字符串;返回拷贝字符串字节数(不计结束0)
			break;
		case (('S'<<8)+'R'):
			CopyString((u8 *)"桑锐载波",(u8*)ADDR_DATABUFF);//拷贝字符串;返回拷贝字符串字节数(不计结束0)
			break;
			
		default:
			WarningOccur(PORTn,(u8 *)"未知载波");//告警发生,入口告警代码和告警字符串
			return;
	}
	p8=(u8 *)(ADDR_DATABUFF+8);
	p8[0]=(pTerminalRouter->RouterVerDate[2]>>4)+0x30;
	p8[1]=(pTerminalRouter->RouterVerDate[2]&0xf)+0x30;
	p8[2]=(pTerminalRouter->RouterVerDate[1]>>4)+0x30;
	p8[3]=(pTerminalRouter->RouterVerDate[1]&0xf)+0x30;
	p8[4]=(pTerminalRouter->RouterVerDate[0]>>4)+0x30;
	p8[5]=(pTerminalRouter->RouterVerDate[0]&0xf)+0x30;
	p8[6]='V';
	i=(pTerminalRouter->RouterVer[1]>>4);
	if(i>=10)
	{
		i+=55;
	}
	else
	{
		i+=0x30;
	}
	p8[7]=i;
	i=(pTerminalRouter->RouterVer[1]&0xf);
	if(i>=10)
	{
		i+=55;
	}
	else
	{
		i+=0x30;
	}
	p8[8]=i;
	i=(pTerminalRouter->RouterVer[0]>>4);
	if(i>=10)
	{
		i+=55;
	}
	else
	{
		i+=0x30;
	}
	p8[9]=i;
	i=(pTerminalRouter->RouterVer[0]&0xf);
	if(i>=10)
	{
		i+=55;
	}
	else
	{
		i+=0x30;
	}
	p8[10]=i;
	p8[11]=0;
	WarningOccur(PORTn,(u8 *)ADDR_DATABUFF);//告警发生,入口告警代码和告警字符串
}


ResultEnum QCSG_LocalFrameDecompress(u8* FrameBuf, u16 FrameLen, QCSGLocalFrameStruct* Frame)
{
	u16 Len = 0, Index = 0;

	if(FrameBuf == NULL) return ERROR_POINTER_NULL;
	Index++;
	Len = FrameBuf[Index++];
	Len += FrameBuf[Index++] << 8;
	
	if(FrameLen != Len) return ERROR_WRONG_LENGTH;
	if(Len > QCSG_MAX_FRAME_LEN) return ERROR_WRONG_LENGTH;

