gdgly/NUC97X_JS/STM32F4xx/CSG/QCSG_Task/CH_PLC_AMR_Task.c
	Frame->DataLen = Len - LOCAL_FRAME_FIX_LEN;
	Frame->FC = FrameBuf[Index++];
	if((Frame->FC & LOCAL_FRAME_ADR_BIT) != 0)
	{		
		MR((u32)Frame->SrcAddr, (u32)&FrameBuf[Index], METER_ADDR_SIZE);
		Index += 6;
		Frame->DataLen -= METER_ADDR_SIZE;
		MR((u32)Frame->DstAddr, (u32)&FrameBuf[Index], METER_ADDR_SIZE);
		Index += 6;
		Frame->DataLen -= METER_ADDR_SIZE;
	}

	Frame->AFN = FrameBuf[Index++];
	Frame->SEQ = FrameBuf[Index++];	
	MR((u32)&Frame->DI, (u32)&FrameBuf[Index], 4);
	Index += 4;
	Frame->DataLen -= 6;
	
	if(Frame->DataLen > 0)
	{
		MR((u32)Frame->Data, (u32)&FrameBuf[Index], Frame->DataLen);
	}
	return NO_ERROR;
}

u32 BuildLocalModuleFrame(u8* FrameBuf, QCSGLocalFrameStruct* Frame)
{
	u32 Index = 0, CSStartPos = 0, CSLen = 0;
	FrameBuf[Index++] = LOCAL_FRAME_HEAD;
	Index += 2;

	CSStartPos = Index;
	FrameBuf[Index++] = Frame->FC;
	
	if((Frame->FC & LOCAL_FRAME_ADR_BIT) != 0)
	{
		MR((u32)&FrameBuf[Index], (u32)Frame->SrcAddr, METER_ADDR_SIZE);
		Index += METER_ADDR_SIZE;
		MR((u32)&FrameBuf[Index], (u32)Frame->DstAddr, METER_ADDR_SIZE);
		Index += METER_ADDR_SIZE;
	}
	FrameBuf[Index++] = Frame->AFN;
	FrameBuf[Index++] = Frame->SEQ;
	FrameBuf[Index++] = Frame->DI;
	FrameBuf[Index++] = Frame->DI >> 8;
	FrameBuf[Index++] = Frame->DI >> 16;
	FrameBuf[Index++] = Frame->DI >> 24;

	if(Frame->DataLen > 0)
	{
		MR((u32)&FrameBuf[Index], (u32)Frame->Data, Frame->DataLen);
		Index += Frame->DataLen;
	}

	CSLen = Index - CSStartPos;
	FrameBuf[Index++] = (u8)SumCaculation((u8*)&FrameBuf[CSStartPos], CSLen);
	FrameBuf[Index++] = LOCAL_FRAME_TAIL;

	FrameBuf[1] = Index;
	FrameBuf[2] = Index >> 8;
	return Index;
}



u16 CompareMeterAddrInNodeList(u8* MeterAddrStart, u16 MeterNum, NodeListStruct* NodeList, u16 NodeListNum)
{
	u16 i = 0, Index = 0;;
	for(i = 0; i < MeterNum; i++)
	{
		Index = FindMeterInNodeList(&MeterAddrStart[i * METER_ADDR_SIZE], NodeList, NodeListNum);
		if(Index >= NodeListNum) break;
	}
	return i;
}

u16 GetNextBPS(u16 CurBps, u16 BpsSelectBit)
{
	u32 i = 0;
	for(i = 0; i < MAX_BAUD_NUM; i++)
	{
		if(CurBps == UartBPS[i]) break;
	}
	i++;
	for(; i < MAX_BAUD_NUM; i++)
	{
		if((BpsSelectBit & (1 << i)) != 0) break;
	}
	
	if(i >= MAX_BAUD_NUM) return 0xFFFF;

	return UartBPS[i];
}



#endif
/**************************************** (C) COPYRIGHT zhaoyun **********************************END OF FILE****/


